[{"author": "Lotus_2016", "created_utc": 1692399553.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 1734, "post_id": "15uz73k", "score": 3466, "subreddit": "careeradvice", "text": "\"I was very suddenly laid from my job 2 days ago. Effective immediately. I worked as a data analyst/applications manager/the-only-person-knowledgeable-about-anything-computer-related for a small healthcare group. The company has relied on COVID funding since it's inception, so naturally the funding has dried up and they're downsizing. They (the CEO) took a look at my salary and decided to cut my position, immediately. I had no time to stop what I knew would inevitably happen. Backend processes and automations started crashing, and they will soon be out of compliance with local, state, and federal regulations (they don't realize this yet, and they won't until they get the notice that they're in breach of contract- which could take a few weeks). The contract they're operating under ends in a few months, so I was expecting to be laid off in a few months anyways, but not like this.\\n\\nI've been getting panicked texts and emails ever since saying they want to bring be back on part-time, at a substantially lower rate than I was making. No one, not even my boss, knows how to maintain a spreadsheet, let alone the other applications I implemented to keep their business running smoothly.\\n\\nFrom a business perspective, I don't want to take the part-time, less pay offer. It's insulting. From my personal, guilt-ridden perspective, the company provides healthcare to a vulnerable population, and my co-workers, through no fault of their own, will soon lose the ability to care for these patients.\\n\\nAny advice how to navigate this?\\n\\nTo note: I don't need the job right now, and was actually relieved to be laid off after working in a COVID-response capacity the past 3 and a half years. Financially, I'll be ok if I don't work for a couple months, so while the paycheck would be nice, I don't *need* it. \\\\*acknowledging my privilege to be in such a position\\\\*\\n\\nTLDR: I was laid off 2  days ago with no notice. Things started falling apart. No one knows how to fix it, so they want me back - for less pay.  \\n....\\n\\nUpdate:  Thank you everyone for your recommendations! I've never been laid off or fired before, I've always left on my own. So while I won't be accepting the offer, I didn't know how to respond. I told them I would take the weekend to consider it (make em sweat a bit). I also discovered that they will not be paying out my unused vacation time. I'm torn between straight up rejecting their offer, or countering with the suggestions of charging $200/hr as a contractor to fix things over the next month or so. However, I get the inkling that they're setting up to just let it all burn down. I'm pretty sure the CEO is just pocketing as much profit as possible before the contracts end. \\n\\nThis company poached me from the agency that monitors if they're in compliance. I can easily get a job with them again, and probably with their competitor. I'll be applying for unemployment to tie me over. I don't need a job immediately, so I'm not stressed about that aspect.  \\n\\nUpdate 2: \\nI declined their offer,  stating it was not a suitable offer for my skillset and expertise. I did not counter offer. A corporate lawyer friend advised that it could come across as threatening. I have no regrets. I'm slowly applying for new jobs and have had 1 interview already. I'm mostly enjoying the time off, though, and hope to have another month or so to enjoy the peace.\"", "title": "Company laid me off suddenly, now wants me back for less pay", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/careeradvice/comments/15uz73k/company_laid_me_off_suddenly_now_wants_me_back/"}, {"author": "veggies4evr", "created_utc": 1689360041.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 1284, "post_id": "14zofpf", "score": 3412, "subreddit": "careeradvice", "text": "\"I work in finance and was told that I cannot be promoted if I have kids. I am also a young woman and plan to have kids in 2 years or so. I am unable to switch careers or companies easily due to my specialized skills. Should I stay put and deal with HR when I finally have kids or just find another job? Also, this no-kids rule is not a real rule. Plenty of people in my industry have kids and my company has a generous maternity leave policy.\\n\\nEdit: For clarification, I am in the US. My boss verbally mentioned this to me a few times and even told my husband at a social event. I'll look into legal options when the time comes and try to get a recording of it if I can't get it in writing. Thanks for all the advice!\"", "title": "Boss says I can’t have kids", "upvote_ratio": 0.92, "url": "https://www.reddit.com/r/careeradvice/comments/14zofpf/boss_says_i_cant_have_kids/"}, {"author": "rollercoasterup1837", "created_utc": 1690215411.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 978, "post_id": "158f5o3", "score": 2838, "subreddit": "careeradvice", "text": "\"Ugh I\\u2019m so upset at this. I started at this job (manager role) last year and I absolutely love it here and can see myself working here and progressing up the ladder long-term. It was just announced my childhood bully is being hired as a manager in another department. I\\u2019m devastated. This girl has caused so much emotional damage and I just can\\u2019t fathom having to work with her and pretend everything is ok. Any advice?\\n\\nEDIT: Thank you to everyone who has commented. To answer the most common questions: this is *fairly recent* meaning within 10 years. I don\\u2019t think childhood bully was the correct wording. Older teenage bully perhaps? Also, I have been to therapy to work through my insecurities and I acknowledge I have more work to do. I would be a happy just not seeing her ever again, but I will now get to see her daily. It sucks, but I\\u2019m a professional and will act like one. \\ud83d\\ude4f\\ud83c\\udffb\"", "title": "Childhood bully is being hired at my work. How do I deal??", "upvote_ratio": 0.91, "url": "https://www.reddit.com/r/careeradvice/comments/158f5o3/childhood_bully_is_being_hired_at_my_work_how_do/"}, {"author": "Ben5544477", "created_utc": 1695776413.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 1064, "post_id": "16t6242", "score": 2810, "subreddit": "careeradvice", "text": "\"There's a guy I talked to who's basically an executive. He told me mainting and getting a high level job is basically just about knowing people or being well liked. Like he said executives generally aren't more talented in any way than the people below them.\\n\\nIs this true in general?\"", "title": "I talked to a guy with a high level job and he told me that high level jobs are all about being liked by other high level people or knowing people. Is that really true in general?", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/careeradvice/comments/16t6242/i_talked_to_a_guy_with_a_high_level_job_and_he/"}, {"author": "MissMignon", "created_utc": 1687789579.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 483, "post_id": "14jistd", "score": 2430, "subreddit": "careeradvice", "text": "\"Like the title says, I was abruptly laid off early March after the company was acquired by a private equity firm. I received a message today from the private equity firm they need my assistance removing my admin access from softwares used by the company. \\n\\nDo I have to even respond? Or can I respond requesting payment for my time to do this?\\n\\nUpdate: I took everyone\\u2019s advice and responded that I could assist, to email the request, and I provided a reasonable hourly rate. I was courteous and asked for nothing that could be perceived as bridge burning. Now we wait. Not losing sleep if they respond or not.\"", "title": "Company that laid me off wants my help removing my access", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/careeradvice/comments/14jistd/company_that_laid_me_off_wants_my_help_removing/"}, {"author": "Worth-Investment-436", "created_utc": 1683905200.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 559, "post_id": "13fo8b2", "score": 2198, "subreddit": "careeradvice", "text": "\"I\\u2019m in the process of interviewing for a new job. Today I had my 7th round interview scheduled from 10:00-10:45. I was really hitting it off with the interviewer so we went an extra 10 minutes, ending at 10:55. It honestly went really well and I thought I crushed it, the guy seemed like he really liked me a lot. When I got off of the Teams meeting at 10:55, I looked at my phone and at 10:47 I had gotten an automated rejection email. Do you think that it was a mistake? Why would they send a rejection in the middle of my interview? And given that I was in the 7th (final) round of interviews, is it really normal to get an automated rejection? Should I just reach out to an actual person there and ask about it? Or should I give it a couple days?\"", "title": "Got a rejection email…during my interview?", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/careeradvice/comments/13fo8b2/got_a_rejection_emailduring_my_interview/"}, {"author": "BlackMelb", "created_utc": 1688032572.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 725, "post_id": "14m0uiw", "score": 2191, "subreddit": "careeradvice", "text": "\"He checks my work at 430, and it always takes longer than 30mins to make the changes that he wants. I'll be stuck at the office till 6/7/8 o'clock. When I should be leaving at 5 o'clock. The problem is he could easily be checking my work during the day. Instead he waits till the last minute.\\n\\nPs.I know he does it on purpose. As a way to steal time. And I'll be looking for a new job soon enough .\"", "title": "How do I ask my boss to stop checking my work 30mins before home time.", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/careeradvice/comments/14m0uiw/how_do_i_ask_my_boss_to_stop_checking_my_work/"}, {"author": "ZealousidealSweet509", "created_utc": 1682719465.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 832, "post_id": "132b7h1", "score": 1996, "subreddit": "careeradvice", "text": "\"Hi, I put down my papers at my current job and they are apparently not happy about it. I did not want to divulge too much information about where I am going since it is my personal decision. Now they are asking for proof of where I am going in the form of a joining letter. I think this is highly unprofessional on their part. How do you think I should handle the situation?\"", "title": "I resigned, employer is asking for proof of next employment", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/careeradvice/comments/132b7h1/i_resigned_employer_is_asking_for_proof_of_next/"}, {"author": "Spiritual_Draw_4525", "created_utc": 1688102009.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 307, "post_id": "14mr388", "score": 1936, "subreddit": "careeradvice", "text": "\"20 minutes into the shift, my stomach started bubbling so I ran to the bathroom. Came back and my boss was pissed. Grilled me out saying dumb shit like why I didn't use the bathroom before. I'm his best worker, multiple people said so but he only bullies me, so two hours in, I walked out. Fuck slave labor. Now I'm stressed. My future is unsure.\\n\\n\\n\\nEdit: thanks y'all for the support. I'll be fine. Y'all are awesome. For context, the reason I said my future is unsure is because I have tuitions to pay and waiting on my student loans to apply. I live with family so money isn't that tough. You have no idea how bad this company is. We don't even get paid for holidays unless you have PTO and it takes a year to qualify for PTO. Be honest, doesn't this sound like a shit job?\"", "title": "Quit my job literally just now.", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/careeradvice/comments/14mr388/quit_my_job_literally_just_now/"}, {"author": "anthonydp123", "created_utc": 1692977151.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 3177, "post_id": "1612crv", "score": 1843, "subreddit": "careeradvice", "text": "\"So I\\u2019m currently  31 years old with a degree in sports management and business management. Since college I have not been able to land a high salary job (65k or more). Thus far I only have work experience in call center sales. To be honest I am bored of those jobs and want a higher paying real career. Currently I\\u2019m making 45k a year which is not going to cut it in this economy. I initially applied to go back for a bachelors in Software engineering at WGU and was accepted but I am beginning to have second thoughts because of the job market. \\n\\nAny advice is appreciated, I\\u2019m just tired of eating mayonnaise sandwiches and cornflakes with water\"", "title": "How were you able to land a high salary job of $70k or more?", "upvote_ratio": 0.93, "url": "https://www.reddit.com/r/careeradvice/comments/1612crv/how_were_you_able_to_land_a_high_salary_job_of/"}, {"author": "kicksjoysharkness", "created_utc": 1687636055.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 667, "post_id": "14i1st9", "score": 1820, "subreddit": "careeradvice", "text": "\"It was supposed to be a warm up phase. Making sure I could do the job first for 3 months etc. tbh I don\\u2019t really have an issue with this. It\\u2019s just how it is in work sometimes. \\n\\nI\\u2019ve done well so far. I\\u2019m my own harshest critique, but I\\u2019ve done the work that was given to me and also worked on other things that I ideated and was approved and appreciated by leadership. \\n\\nI was just told in the next review window I won\\u2019t get the title and salary change as I\\u2019m \\u201cnot quite ready.\\u201d I don\\u2019t have an issue with this if I \\u201cdidn\\u2019t get the job.\\u201d But the expectation is that I continue on this \\u201ctrial period\\u201d at my same pay and title. \\n\\nIs this shady? Or normal? I\\u2019m pretty frustrated to be honest even though I enjoy the work.\"", "title": "My boss left 4 months ago, I took his job with no official promo and salary increase and they just told me I won’t get either. I could use some advice.", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/careeradvice/comments/14i1st9/my_boss_left_4_months_ago_i_took_his_job_with_no/"}, {"author": "justblazeNburn", "created_utc": 1707494928.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 2102, "post_id": "1amrm8c", "score": 1778, "subreddit": "careeradvice", "text": "\"i\\u2019ve seen so many posts on here or in \\nfinancial advice asking what to do with left over money. \\n\\nlike for example i see multiple posts saying im 23 and making 140k a year like what the fuck?\\n\\nsome say they get out of college and just somehow getting a 6 figure job right away? \\ndid i miss something in life?\"", "title": "how are all these people in their 20’s making over 100k?", "upvote_ratio": 0.94, "url": "https://www.reddit.com/r/careeradvice/comments/1amrm8c/how_are_all_these_people_in_their_20s_making_over/"}, {"author": "omega_cringe69", "created_utc": 1706726474.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 1266, "post_id": "1afp389", "score": 1721, "subreddit": "careeradvice", "text": "\"I've seen quite a few people not liking their office job and wishing it was something else. Usually, the advice you see in those threads is learn a trade. I grew up with a blue collar dad who took me plumbing with him in the Texas summers. Yes, he made good money. But you are insane if you have the opportunity to get an indoor office job and decide it's not for you. Those summers were the best motivator for me to get educated and end up in corporate america.\\n\\nMind you, when most people start throwing the money that trades people make it is such a small majority of the people that work trades or they are working 60-80 hour weeks. You gotta really REALLY consider if the trades are for you.\\n\\nEdit: This has become a great thread for people who want to make a decision between an office job and a trade job to see a lot of different perspectives. Both sides should be respected, the grass is not always greener, and it's not always black and white.\\nAlthough this post was not worded great (I'm man enough to say my bad for that), my intention was to mainly speak on seeing the advice that is given to young people to quit their office job and go to trades and only sharing the positives of how much money they can make. Making a big decision to completely switch careers and put a certain skillset on hold to go to another career that doesn't have transferring skills, or very little atleast, can really set someone back. Trades for a lot of new people entering the field is physical labor for several hours a week... every week. Yes, you may get to a point where it's not as back breaking and you get to be a bit more of a manager. But there's always more sheep than there are shepherds. Not everyone can own a business, not everyone is going to live in California and make 6 figures as an electrician. Go on linkedin and see what a technician is making in most industries with no years of experience it is on par with entry level office jobs. So, I say again. Really, really consider making that jump.\"", "title": "Office jobs are a much better job than trades for most people.", "upvote_ratio": 0.91, "url": "https://www.reddit.com/r/careeradvice/comments/1afp389/office_jobs_are_a_much_better_job_than_trades_for/"}, {"author": "meowmuffinz", "created_utc": 1685930843.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 797, "post_id": "140yq8r", "score": 1712, "subreddit": "careeradvice", "text": "\"I am going overseas for 2 weeks in August because my friend is paying for my ticket out there otherwise I don't think I could have ever afforded to go. I gave my job 6 months advance notice but they denied my leave because I didn't have enough pto to cover it (we get 5 days a year pto btw). I told them I am not missing this trip its once in a lifetime for me so they have \\\"accepted my resignation\\\" and my last day will be the day I leave unless I give my 2 weeks before that.\\n\\nThey want me to reapply when I get back if they have any openings and part of me is just blown away by the audacity but the other part is like OK I'll reapply and ask for more money since I am literally  the perfect candidate for the position. \\n\\nWe are now 2.5 months out and they have still not found anyone to replace me.\\n\\nSo I guess the question is do I just reapply to my job when I get back or try to find a different job? My benefits suck but I kinda like the work I do.\"", "title": "Job is ending my employment when I leave for a 2 week vacation but encourage me to reapply when I get back.", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/careeradvice/comments/140yq8r/job_is_ending_my_employment_when_i_leave_for_a_2/"}, {"author": "FastidiousNPrecise", "created_utc": 1687661404.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 440, "post_id": "14iawsl", "score": 1689, "subreddit": "careeradvice", "text": "\"I'm temporarily removing my post. It's gotten WAY more attention than I anticipated, and I'm anxious at the thought of my current employer somehow coming across it and recognizing my circumstances. I've copied my post and will re-edit here once I'm in the clear with my new position. \\n\\nThanks for the positive support, and for sharing you own stories about PIPs. \"", "title": "I'm so glad my boss put me on a PIP.", "upvote_ratio": 0.85, "url": "https://www.reddit.com/r/careeradvice/comments/14iawsl/im_so_glad_my_boss_put_me_on_a_pip/"}, {"author": "Nervous-Chain-928", "created_utc": 1689857281.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 801, "post_id": "154q08o", "score": 1626, "subreddit": "careeradvice", "text": "\"I am quite honestly mesmerize: I have never meet someone so blatantly racist. He just started 3 weeks ago, and in the last days someone has timidly tried to tell me he has a difficult character - I didn't expect tho to find him making race jokes to one of our senior (and not White) tech figure. During lunch break. In front of everyone. And he has been doing It for a while apparently. \\nHe is probably going to be sent away very quickly - if he behave like this,  to one of his SENIOR collegue, after 3 weeks, he Is just going to get worst - but my question is: is It worth to explain that this is not professional behaviour, or is wasted energy from my part?\"", "title": "The new hired is racist. I have to fire him. Do I tell him why or do I stay generic with \"not fit the company culture\"?", "upvote_ratio": 0.89, "url": "https://www.reddit.com/r/careeradvice/comments/154q08o/the_new_hired_is_racist_i_have_to_fire_him_do_i/"}, {"author": "ExitIndependent1404", "created_utc": 1687532802.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 348, "post_id": "14h0z6i", "score": 1615, "subreddit": "careeradvice", "text": "\"Hi, Ive been out of work, but not seeking work either, for 12 months . I\\u2019ve been a stay at home Dad, my kids are 5&2. \\n\\nI started looking recently at roles and was offered what seemed a great public sector job (UK) following a lengthy 3 stage interview process. I accepted it but had not declared at the interview that my wife was 7 mths pregnant.\\n\\nWhen offered the role I advised it and was told \\u2018congrats, no problems at all, we very flexible employer etc etc\\u2019\\n\\nThey said their HR dept was going it be super slow at doing paperwork so it would be very close to due date (like 1/2 weeks prior) they would choose the start date. \\n\\nI asked if it would be ok if we delayed a further 4 weeks - until 2/3 weeks after the due date - after all baby could come anytime and wouldn\\u2019t it be better to all have certainty over when I start rather than starting then taking or requesting leave.\\n\\nThe manager was super happy (to my face anyway) as we met up and had informal coffee and did a tour and met colleagues. We shook hands on the start date and I said if any problems please let me know & I will start sooner. He said do not worry, family comes first and it\\u2019s only a few weeks anyway. I felt reassured.\\n\\nA few days later I get an email(!) from the manager saying \\u201cnow they know of my family circumstance\\u201d they think I am not a good fit and are withdrawing the offer. Surely this is discrimination but should I just forget and move on or call this out to the senior mgmt or other?\\n\\nYou would say if that\\u2019s their attitudes why would you want to work there. But I am still floored by this and apprehensive about how being a young unemployed father is being viewed by potential employers.\"", "title": "Job offer withdrawn after they found out my wife was pregnant - no joke", "upvote_ratio": 0.92, "url": "https://www.reddit.com/r/careeradvice/comments/14h0z6i/job_offer_withdrawn_after_they_found_out_my_wife/"}, {"author": "octodigitus", "created_utc": 1689947865.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 285, "post_id": "155ot0h", "score": 1562, "subreddit": "careeradvice", "text": "\"I'm two months in at my current project management job. In my fourth week, I drew up my first contract with a client and it turns out I majorly undercharged them. I discovered this while on a call with my boss and was absolutely mortified. I took all the blame, apologized and promised to slow down and have people check my work. Later on I was looking through my emails and it turns out I asked him to look for any mistakes in the contract before I sent it. He asked the next guy down the chain to look it over, who emailed me \\\"the numbers all add up, great work.\\\" \\n\\nIs there a proper way to bring this up to my boss that won't just look like I'm throwing blame around? This isn't something we can just move on from; he wants me to call the client and explain myself and it's just a huge mess we have to clean up. Ultimately I'm the project manager and it was my mistake, but others signed off on it, and in my panic yesterday I accepted 100% of the blame. I just don't wamt him to think I'm completely reckless.\\n\\nFor what it's worth, I don't think he would remember any of this on his own, as I didn't, because the workload is like a firehose and it was one of a million things that's happened in the last month.\"", "title": "Made a big mistake but I found out my boss signed off on it. Should I bring it up?", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/careeradvice/comments/155ot0h/made_a_big_mistake_but_i_found_out_my_boss_signed/"}, {"author": "TuneStock5468", "created_utc": 1686677478.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 432, "post_id": "148ktha", "score": 1508, "subreddit": "careeradvice", "text": "\"So back in March my hubby and I bought our first home. I sent out and email to let everyone know that I would be taking a few days off to go to closing and to get everything moved. Well the big boss didn't like that and he had it out for me previously. So a whole week before closing on the house he let me go. Now 3 months later, half of my department left because me getting let go left a bad taste in their mouth. And I'm getting messaged that there's been a lot of talk about me and that they might take me back. I have had no luck in finding another job and kinda need it... but I am only willing to go back with certain stipulations. 1. I will not take harassment of any kind from the boss (I had dealt with this previously) 2. That I can either work hybrid or remote (which is possible because he has let others do it) 3. I will need a sign on bonus or some kind of back pay because it takes a whole month to get the first check and I can't afford to work that long without it. And 4. I will make at least 26 an hour (he tricked me into taking 18 to start with and we agreed on 20 even though the positions listing ranged 20 to 30 an hour)\\nThis guy is a literal narcissistic asshole and tried making me come into work while I had covid. He's even tried giving me unsolicited medical advice. And I just want to know how to go about this because once I give the go ahead to my colleague to confirm my interest, I'm going to get the call from the boss.\"", "title": "Boss laid me off over an email and now needs me back", "upvote_ratio": 0.93, "url": "https://www.reddit.com/r/careeradvice/comments/148ktha/boss_laid_me_off_over_an_email_and_now_needs_me/"}, {"author": "Redditjim0504", "created_utc": 1701785195.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 482, "post_id": "18bcpmh", "score": 1331, "subreddit": "careeradvice", "text": "\"My company's payroll sent me a termination letter and canceled my benefits after I returned from proper medical leave.  I turned in my stuff, left the jobsite and filed for unemployment compensation. Afterwards, they called me in and said it was all a mistake. HR claimed they did not fire me and I claimed they did. I furnished the letter to HR as verification. HRkept denying firing me, I kept claiming that they did.  They asked if I wanted to return to work or quit. I claimed the question irrelevant because they already fired me. They told me they'd consider it a voluntary quit if i did not return, which i did not, still claiming being fired. The company has protested my claim for unemployment compensation. Do I qualify for unemployment compensation?\\nXxxx'xxxxxxxxxxxxxxxxxxcccxxxxxxxxxxxxxxxxcccccccc\\nMore information:\\nThanks Everyone\\nYes. I could have given them the opportunity to straitghten it out.  The letter was from payroll. It stated my benefits were canceled and it stated the reason was that my employment terminated. Before leave HR said my leave was approved. I was concerned that someone needed forms so I asked if there were any forms. They sent me short term disability forms. Then, after the surgery, payroll sent forms to my personal email specifying it was my last chance to submit Leave of Absence forms. HR did not give me these firms when I asked before leave. They simply said I was approved. I was on pain medication, should not have been driving and recovering when I drove the forms back to my doctor. We got them in at 3pm on the day of the deadline.  On the day I stopped working, I was confused. I told them I wanted to speak with an attorney and get some advice. I refused to quit and refused to return to work. HR was blaming payroll, who I consider is part of HR. I felt it was the HR directors fault for not giving me the forms when I asked 2weeks before the leave. I did not want to critisize or argue with her. I was confused so I said very little and did nothing. I wanted to get outside advice.  It felt risky to return to a job after being fired without cause. The conversation happened on a Friday before Thankgiving week and I had to decide the Monday of Thanksgiving week. When I can not decide something i feel its better to do nothing from fear of making a decision that makes it worse. When they forced a decision by Monday I still refused to quit, go back and claimed already being fired. They terminated me by a forced voluntary quit that Monday.  In Iowa, employers can terminate for voluntary quit after 3 days no-show, but they did not allow me 3 days of indecision to abandon the job. HR's letter stated that they could understand the stress it caused me and that they could understand not wanting to continue my employment. Then the letter said that if I did not decide to return by Monday it would be a voluntary quit.\\nI was also on ADA accommodations for mental illness with this company.  I filed for these accomodations several months before. This cancelation of benefits and firing happened just a couple weeks after I lost Medicaid. I had been on the  COVID relief program and had this job and was still on Medicaid and their benefits. Medicaid had just expired after Teo years of full time working when all this happened. I was in a 90 day window where I could renew my Medicaid benefits instead of applying for Medicaid all over again or trust this company to do things right without future mistakes. I attend two weekly therapy groups, see a therapist and take medication to remain employable and healthy. This is more important than the job, unemployment benefits or wrongful termination. Although these would help while I look for a new job. The jobsite is a substance abuse rehabilitation and mental health treatment center.\"", "title": "company mistakenly fired me", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/careeradvice/comments/18bcpmh/company_mistakenly_fired_me/"}, {"author": "dr_dante_octivarious", "created_utc": 1685546504.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 340, "post_id": "13wp5tw", "score": 1314, "subreddit": "careeradvice", "text": "\"So, never been in this position before.  Took a job with a significant pay bump.  In hindsight, ignored some red flags, like the HR person telling me the other interviewee was a current employee and \\\"wasn't a real candidate, and the job is mine\\\", and the employer asking my to attend training seminars while I was still at my previous job (which I did not).\\n\\nYesterday, was called into the office and told it wasn't a good fit.  It's been 3 weeks.  I had no indication of this at all.  Just 0-100 right away.  No \\\"hey, you're too aggressive in trying to change things, so this is your warning to knock it off, as you're in probation\\\".  It feels like they just didn't like me or my style of work.  But 3 weeks isn't nearly enough time to decide anything.  I broke no rules, violated no policies, did nothing unethical.  I treated my staff with dignity, respect, and kindness.  The only thing I did was aggressively push for staffing and funding the moment I got my arms around the state of the department.\\n\\nI feel absolutely crushed, like my career is ruined (I work in public administration).  True, I wasn't fired.  But people in the public sector around the area knew about it THAT DAY, hours after I resigned.  I feel like I'm not hireable because everyone assumes I was fired, even if I resigned.\\n\\nTo boot, I called my old employer and they basically said some people weren't happy with how I left in my last few days, even though I gave them 5 weeks notice.  Turns out he had already heard from 2 people that I was now unemployed.  Basically, I'm reeling here and feel completely out of control and that my career is completely F*ed.\\n\\nThanks for listening.\"", "title": "Forced to resign after 3 weeks", "upvote_ratio": 0.93, "url": "https://www.reddit.com/r/careeradvice/comments/13wp5tw/forced_to_resign_after_3_weeks/"}, {"author": "Grumpy90sKid", "created_utc": 1684252360.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 445, "post_id": "13j90g2", "score": 1290, "subreddit": "careeradvice", "text": "\"I'm currently a manager at a home improvement store making approximately $57,000 a year, broken down hourly to $27.75 an hour. I applied for the next position up and knocked it out of the park, this new position takes over 4 stores and would include a move for me of about 3 hours away. Nowhere internally or externally can I find the salary range for this position. After knocking 2 interviews out of the park, I was offered $63,000. My current manager told me that 90k was possible for this position, while high, still possible. I would rather stay with my company now as I know it and I'm very good at it. I was offered the amount over the phone and I mentioned that I have been recruited for another position (which I have, just haven't been offered it yet) making approximately 90k, guaranteed 110 in 2 years. When I mentioned this on the phone to the hiring manager, he said that he might be able to move up a couple thousand dollars but could not be competitive with 90k. I've proven myself in my current role and felt disrespected. I would be going from an hourly 40-hour based position to a minimum required 48 hours a week salary position. At my current salary working 48 hours with time and a half for 8 hours I would be at $76,000. The top of my current pay scale is $66,000 a year only working 40 hours. He gave me a day to get back to him. How should I approach this?\"", "title": "Job offer felt like a slap in the face", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/careeradvice/comments/13j90g2/job_offer_felt_like_a_slap_in_the_face/"}, {"author": "xMarsx", "created_utc": 1686532379.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 352, "post_id": "147b281", "score": 1286, "subreddit": "careeradvice", "text": "\"Well this is a strange turn of events for my career. \\n\\nAt Company A (current) i was making 65k a year in my role. My raise was only 6% and I felt stagnant in my role. \\n\\nCompany B offered 80k a year in a role similar to the one im currently working. I presented this to my employer whom countered at 82k a year. \\n\\nNot even two weeks later, I was offered 100k a year at a third company doing engineering type work, id say is a huge step up for my career growth. \\n\\nOverall my current employer wouldn't of countered company B in the first place if they didn't believe in me and where I piece into their organization. They answered all my concerns (more potential growth through specific avenues, more money, more remote work.) However, I think this offer from my 3rd employer is too much too pass up. \\n\\nI'm seeking guidance on how I can try and not burn bridges here. The management team for my current employer are excellent people. They fought very hard to keep me the first offer to go elsewhere, and they generally are good managers who want to do write by my profession and by me if they can. \\n\\nI'm having this conversation tomorrow. How do I make this less awkward and to make the next two weeks as comfortable for me, and for them, as possible. \\n\\n\\nThanks\"", "title": "Offered 80k/y job to accept employer counter at 82k to receive new offer of 100k", "upvote_ratio": 0.94, "url": "https://www.reddit.com/r/careeradvice/comments/147b281/offered_80ky_job_to_accept_employer_counter_at/"}, {"author": "oneilmatt", "created_utc": 1706635915.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 1257, "post_id": "1aeu1lc", "score": 1267, "subreddit": "careeradvice", "text": "\"I was warned by my boss last week that my performance rating has been flagged as unsatisfactory and I will be put on a PIP tomorrow. Candidly, he told me that I will almost certainly be fired at the end of it.\\n\\nHe has hinted multiple times that I should resign in order to keep a termination off of my record. I've done lots of research on this, much of it from this sub, and I have some questions.\\n\\nI live in MO, and according to state labor law, a former employer can disclose reason for leaving among other things to any prospective employer. So, if I get fired, they can tell potential new jobs about it and hamstring me.\\n\\nI also have 3 weeks of PTO accrued, but can find nothing in company policy or MO law that states they would need to pay it out to me.\\n\\nI also have been unable to locate my employment contract. I don't even know if I signed/ have one.\\n\\nIf the aforementioned points were not true, I would say it is 100% better to just get fired. However, it looks like the only \\\"benefits\\\" to that are that I'll get paid during my PIP and may be eligible for UEI. However, I work for a massive corporation and suspect they would contest it.\\n\\nSo, what should I do? I don't want me getting fired to screw me out of future jobs, but I also don't want to forfeit a month of pay.\\n\\n\\n**UPDATE:** I was able to negotiate a severance + my 3 weeks of PTO in exchange for my resignation. Many suggested this option, most suggested just sticking it out. This seemed like the best option for my mental health and will allow me plenty of time to aggressively search for a new position. Friday will be my final day.\\n\\nThanks everyone for the insight, advice, and suggestions. It helped me walk into the meeting confidently.\"", "title": "Going on a PIP tomorrow. Will be terminated after. Resign or get fired?", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/careeradvice/comments/1aeu1lc/going_on_a_pip_tomorrow_will_be_terminated_after/"}, {"author": "None", "created_utc": 1702405273.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 360, "post_id": "18gsiwe", "score": 1184, "subreddit": "careeradvice", "text": "\"I am a few years into my career and I graduated in 2020. I had my transcripts requested from a new job I was getting and apparently it dug up a shit storm. \\n\\nWhen I was in college I got a D in Calculus 1 which does not count towards my degree. By my advisor\\u2019s recommendation I took Calculus 1 at a community college over the summer to get a passing grade that could be applied to my requirements. I moved on to Calculus 2 and went on to graduate. \\n\\nWell due to an oversight, Calc 1 at this community college did not meet the criteria to match Calc 1 at my college. In fact, no community college should have counted. Therefore it should\\u2019ve just been an elective. Now my schools called me and said they need to do an audit. My job offer was rescinded and it sounds like I\\u2019m going to be let go from my current job.\\n\\nWhat the hell am I supposed to do? My college is now 1000 miles from me. Am I supposed to take Calc 1 again 1000 miles from where I currently live? How about Calc 2? Is my job experience worthless now? Is my resume tainted?\\n\\nEdit: Both my employers understand this was a mistake by the college, but they can\\u2019t keep me employed because they require a degree.\\n\\nEdit 2: I contacted a law firm and got in contact with a lawyer. She is very interested in my case. Sounds like things might not be all bad.\\n\\n\\n\\n\\n\\nEdit 3: Here are some FAQs\\n\\n1. How did your employer find out?\\n\\n I told them because I didn\\u2019t think it would be a big deal\\n\\n2. If your degree hasn\\u2019t been pulled yet, why did you lose your job? \\n\\nI was in a two week notice period with current employer and they don\\u2019t want to pull it back. Future employer took away my offer.\\n\\n3. Why does your school care/why can\\u2019t they just honor it? \\n\\nSeems like it\\u2019s goes against some guidelines in order to be accredited\\n\\n4. What school? What job?\\n\\nWon\\u2019t say for privacy\\n\"", "title": "My college screwed up and counted a class that shouldn’t have counted towards my degree. How fucked am I?", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/careeradvice/comments/18gsiwe/my_college_screwed_up_and_counted_a_class_that/"}, {"author": "sb4fl", "created_utc": 1699233374.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 536, "post_id": "17or5vm", "score": 1163, "subreddit": "careeradvice", "text": "\"I\\u2019m a recent college graduate.  Graduated with a general business degree, got a salary job working with forecasting and visualization about 4 months ago, which I absolutely loved doing in my college courses.\\n\\nI was really excited to start my career, especially at this particular employer because I\\u2019m passionate about the field.\\n\\nHowever, this job is slowly sucking the life out of me.  There is such little work to do, it\\u2019s insane.  I ask for work and projects, and they\\u2019ll assign me something that takes an hour.  And then there\\u2019s nothing to do.  There are several other people in my role who have the bulk of the responsibilities, and even they are almost always chatting or on their phones.\\n\\nI just stare at the blank screen all day.  I pretend like I\\u2019m busy.  I feel my brain cells rotting away in my head.  It\\u2019s mind numbingly boring.  It\\u2019s also 5 days a week in person 9-5.  So I can\\u2019t just dick off at home.  I sneak time on my phone, but I feel bad doing so and there\\u2019s only so much I can do on that.   \\n\\nIdk, man.  I feel so empty.  So unfulfilled.  I miss my monotonous warehouse job.  I\\u2019d rather be physically exhausted than mentally exhausted.  Depression is at an all time high.  Im in a crap mood and the weekends are barely enough time to regenerate the mental energy required to survive the work week.\\n\\nI just don\\u2019t know what to do.  I need the money, and like the money, but at what cost? That\\u2019s my rant, any advice appreciated of course, thank you.\"", "title": "Is this really what an office job is like? I’m depressed", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/careeradvice/comments/17or5vm/is_this_really_what_an_office_job_is_like_im/"}, {"author": "ThrowRAoverthin", "created_utc": 1691003296.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 454, "post_id": "15ghqt2", "score": 1155, "subreddit": "careeradvice", "text": "\"I applied for a job that requested very specific experience. I mean they were looking for a unicorn and I just so happened to be that unicorn. It was almost like I wrote the job posting myself. So I wasn't surprised when they reached out for an interview. \\n\\nI had the 30 minute interview with the hiring manager where she literally spoke for 25 minutes and gave me barely 5 minutes to speak before she had to go to another call. Then today I got the rejection email saying I'm not moving to the next round.\\n\\nThis job search has been painful. I've been looking for a few months with a ton of applications and just a few interviews so getting rejected from such a perfect fit without getting a chance to even talk is just deflating. I've wondered everything from if it was how I looked to how I spoke or my salary requirements. Job searching is soul crushing and frustrating.\"", "title": "Why am I getting rejected even from perfect fit roles?", "upvote_ratio": 0.94, "url": "https://www.reddit.com/r/careeradvice/comments/15ghqt2/why_am_i_getting_rejected_even_from_perfect_fit/"}, {"author": "anthonydp123", "created_utc": 1686180756.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 2023, "post_id": "143spvd", "score": 1154, "subreddit": "careeradvice", "text": "\"So I\\u2019m 31 years old only making 40k and feel far behind my peers around my age. Does a six figure salary help you feel secure and set for life?\"", "title": "People that make six figures in their career, do you feel like you made it in life since achieving that salary?", "upvote_ratio": 0.93, "url": "https://www.reddit.com/r/careeradvice/comments/143spvd/people_that_make_six_figures_in_their_career_do/"}, {"author": "None", "created_utc": 1690464906.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 1102, "post_id": "15b22n9", "score": 1130, "subreddit": "careeradvice", "text": "\"I (25M) currently work for my fathers business as a CAD operator. The company consists of myself and both of my parents. I graduated high school with no desire to go to college (not much of a school person) and instead wanting to join the military. I was denied by my parents, so I respected their thoughts and went to school. Following each year, watching the debt pile up, I would tell them that I want to enlist, yet their response never changed (quite the people pleaser I am, I know). $200k in debt later with a General Studies degree in hand, I managed to bullshit myself into a doctorate program that I absolutely hated, so I dropped out after a year to not waste any more money. \\n\\nBy the end of the year we will be absorbing another company, their office, and their employees (2). For background, I never was trained in this field, nor did I go to school for anything related. My dad needed help as he was on his own for 4 years and I was doing him a favor. I taught myself completely how to use the software we use and how to draft drawings within 2 weeks of starting. My dad wants to retire in the next 10-15 years, where he then has expressed that he would love to pass it down to me. This is not at all what I enjoy doing, but this student debt put me in a hole that I'm afraid I won't be able to take a leap at anything I actually enjoy, and that I'll be stuck here indefinitely. \\n\\nI make $2k in payments every month towards my loans, leaving me around 500-650 remaining (after whatever other bills) to invest or save. I want to move out and get my life started soon, and at this rate that won't be happening.\\n\\nEdits: \\n\\n1. BA in general studies. Studied exercise science for two years then had to transition to sport management for the remainder as new school didn\\u2019t have exercise science. Dropped major and accepted general studies degree same day as getting accepted to doctorate program. \\n\\n2. I was 17 by the time I had graduated high school so I couldn\\u2019t have enlisted without my parents approval, making college the only other possible option that would be considered \\u201cacceptable\\u201d. \\n\\n3. I did not live very lavishly, I commuted to cut down my expenses, ate at home, etc. I made the mistake of allowing my parents to handle the financial aid things as they \\u201cdid it all for my brothers so they know what to do\\u201d. \\n\\n4. I never said that I wasn\\u2019t taking responsibility for these loans, I\\u2019ve actually turned down any and all assistance from my parents in a show of \\u201cfuck you, I shouldn\\u2019t have listened to your parental advice and now I\\u2019m going to get myself out of this shit\\u201d. And those saying \\u201che works for daddy\\u201d, I taught myself a skill out of necessity for his company to function better and earn my pay daily by putting out 10-12 hour days minimum. I earn my salary, no matter who my boss is. \\n\\n5. Thanks to those that offered genuine advice, I appreciate you.\"", "title": "$200k in student debt and lost", "upvote_ratio": 0.88, "url": "https://www.reddit.com/r/careeradvice/comments/15b22n9/200k_in_student_debt_and_lost/"}, {"author": "nobody2000", "created_utc": 1688846767.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 715, "post_id": "14udygz", "score": 1119, "subreddit": "careeradvice", "text": "\"My questions will be very opinion and experience-based. I'd love to hear from people who took the counter and burned the bridge with the new company as well as people who walked away from a good counter offer...and everything in between. \\n\\nIn short, I was offered a 30% pay bump by a non-competing company to do work similar to what I do for this company, but expanding upon it. I accepted it and I have no intention of using this pay bump to seek a counter offer.\\n\\nMy gut says that this is the best course of action and me posting this question is a waste of time. I'll expand anyway. \\n\\nUpon letting my boss know, he asked the question \\\"how do we get you to stay?\\\" and I let him know that it would take what's probably unreasonable and I made the commitment anyway. \\n\\nMy former boss, who is largely my mentor still, didn't give me that, but when he informed his leadership, suddenly there are plans. Basically - the plan was to hire 4-5 new people and put them on a team under me. \\n\\nTalk is cheap, and plans, especially at this company, come to fruition slowly (although to their credit, not a lot of plans like these die on the vine). Even if I said \\\"okay sounds good!\\\" it would have to be in writing and it would have to be accompanied by a solid pay bump. \\n\\nSo - my questions:\\n\\n- Monday is likely to be very uncomfortable and stressful. I'm likely to get visits by several VPs, our COO, and likely the CEO/Chairman and the President. How do I navigate these conversations? \\n - My plan right now is to hear them out, tell them that this was not me leaving due to an issue, but more me being pulled by an opportunity. I plan on sticking to the \\\"I want to honor my commitment to the offer I accepted.\\\" Is that good?\\n- If they throw a number out there that's well above the new job, what should I consider before accepting/denying it? \\n - I realize that accepting a counter offer means there's a target on my back anytime I mess up (\\\"gee, aren't we paying him way more money now, and he can't even xyz?\\\")\\n - The hiring process at this new company goes back to May 7 when I was first contacted by a recruiter. What's the protocol/etiquette for reneging on an offer like this if my current employer gives me a really sweet deal (in writing)? Remember - I signed and accepted this new job and all my background checks are cleared. \\n - If my employer does offer a generous pay bump, the other thought in my head is going to be \\\"cool...uh...so I wasn't worth this last week, but now that I'm one foot out the door, I'm worth it?\\\" - at what point do I just get over it and take the cash?\\n\\n- 2nd to last thing: given that the wheel turns VERY slowly at my current company, and many of the one-year goals in my role at the current company would dramatically put them in a good spot, would it be a bad idea to stay in touch with them with a possible plan to go back in this enhanced leadership role if it comes to fruition?  \\n\\n- Finally - while this, like any job has had its issues, I feel like two pop out (even though I said earlier that there were no internal things driving me out). Should I share them, or would it just give them ammo to go \\\"oh, we can fix that!\\\" - is it worth entertaining them fixing this, even if they can provide it in writing? \\n - Issue one: I don't think they're getting my best quality work anymore. Maybe it's because I'm distracted by a billion things going on at once in my life (marriage, buying a car, running a side business on weekends), and maybe it's because I'm not being challenged.\\n - Issue two: I believe them when they say that they really, truly do have plans for me to be a leader in the company on the VP and even C-suite level - I know that any real progress will take longer than 5 years in all likelihood unless there is a vacuum left by resignations. Do I mention that I fear that my career advancement at this company is too slow?\"", "title": "I have signed and accepted a job offer and put in my notice at my current company. Suddenly all the big plans they had for me surface and the \"what can we do to keep you?\" is also being said. What's the best course of action to navigate?", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/careeradvice/comments/14udygz/i_have_signed_and_accepted_a_job_offer_and_put_in/"}, {"author": "imshylol42069", "created_utc": 1682517071.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 873, "post_id": "12zi88t", "score": 1123, "subreddit": "careeradvice", "text": "\"what should i do? my current job at a small law office requires i put in a 4 week notice. today i just got a call offering me a position i interviewed for last week. this new employer said he\\u2019d like me to start in 2 weeks. when i told him my current employer needs a 4 week notice, he said \\u201cwell\\u2026 we only give enough time for 2 weeks. we have to do fingerprinting for you still, which usually is the biggest hold up, but if you\\u2019re confident your fingerprints won\\u2019t be an issue, i\\u2019d recommend putting in your notice now.\\u201d\\n\\nthis confused me. is putting my notice is now a good idea, if i haven\\u2019t gotten written confirmation of the new job offer yet? the written confirmation will come in the form of an email sometime next week. in the meantime, i need to send my diploma & set up a fingerprinting appointment. after that, i will receive my start date. \\n\\nthis is my first real job so i\\u2019ve never had to navigate this situation before. please help!\"", "title": "my current employer needs a 4 week notice, but new employer will only wait 2 weeks", "upvote_ratio": 0.94, "url": "https://www.reddit.com/r/careeradvice/comments/12zi88t/my_current_employer_needs_a_4_week_notice_but_new/"}, {"author": "HotRaccoon6843", "created_utc": 1681518634.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 527, "post_id": "12mjno2", "score": 1116, "subreddit": "careeradvice", "text": "\"\\\\#\"", "title": "Feeling insulted by this raise, am I crazy?", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/careeradvice/comments/12mjno2/feeling_insulted_by_this_raise_am_i_crazy/"}, {"author": "emie_des", "created_utc": 1683556151.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 255, "post_id": "13bs92a", "score": 1115, "subreddit": "careeradvice", "text": "\"I (25F) just started a new job less than two weeks ago at a large company. Unfortunately, my dad who I have been the primary caretaker for during a brutal stint of cancer doesn't have much time left and will be moving into hospice care this week. I'm not sure if it's a good idea to tell my manager (especially given that I'm so new); I don't want her to be blindsided if I suddenly ask for bereavement leave but I also hate the way people tend to treat me when they find out I have a terminally ill parent.\\n\\nAny advice or suggestions would be greatly appreciated.\\n\\nUpdate: I feel much more assured that informing my manager is the right move. Also, thank you so much to everyone, I didn't expect nearly this many responses but reading through everyone's kind words and similar experiences definitely makes this feel a little less lonely. \"", "title": "Should I tell my manager that my dad is dying/in hospice?", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/careeradvice/comments/13bs92a/should_i_tell_my_manager_that_my_dad_is_dyingin/"}, {"author": "None", "created_utc": 1691552407.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 798, "post_id": "15m3src", "score": 1091, "subreddit": "careeradvice", "text": "\"Idk what to do. I\\u2019ve applied for over 100 jobs in the last month alone. I have a Bachelors in Nursing and a Bachelors in Political Science. I am a honorably discharged veteran. I can\\u2019t work 12 hour shifts because there\\u2019s literally no child care in the area for that long (1 and 3) and a nanny costs more than I make an hour. I have no family. I\\u2019ve maxed out all my credits cards and can\\u2019t pay my mortgage. The state won\\u2019t give me any assistance because they say I should be able to get a job no problem, but I can\\u2019t even get a call back for an customer service job. How is it possible I literally can\\u2019t get a job doing anything? Idk what I\\u2019m going to do.\"", "title": "If I can’t get a job in the next few weeks I’m going to be homeless with my babies", "upvote_ratio": 0.9, "url": "https://www.reddit.com/r/careeradvice/comments/15m3src/if_i_cant_get_a_job_in_the_next_few_weeks_im/"}, {"author": "GettySpaghetti", "created_utc": 1684189644.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 200, "post_id": "13imqb1", "score": 1031, "subreddit": "careeradvice", "text": "\"So my employer is preparing some social media content for cultural awareness day on the 21st of May and they asked me to film a video of myself saying a few sentences about the company values.\\n\\nWell, I'm a minority in the company and I can say that everyone in the office have been nothing but nice to me, however, even if it is for a good cause I don't like the idea and I don't feel comfortable filming it.\\n\\nWhat would be the proper way of communicating that?\\n\\n\\nUpdate: All went well, I just thanked them for the opportunity and said that I don't feel comfortable in participating. They said no problem and apologised if they had made me uncomfortable.\\n\\nThanks everyone for your answers!\"", "title": "How can I professionally decline to be a part of a \"diversity ad\"?", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/careeradvice/comments/13imqb1/how_can_i_professionally_decline_to_be_a_part_of/"}, {"author": "throwawayelectrical", "created_utc": 1686617273.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 500, "post_id": "1482bub", "score": 1025, "subreddit": "careeradvice", "text": "\"I used to work for a contacting company and we had a job where we needed to do some work that involved dangerous exposure to high voltage equipment. My boss gave me his company card to buy a safety suit to do the work for about $2500 after our safety manager (who was very new to the company at the time) said we didn\\u2019t have it. Turns out we did have it, because the guy was a moron (wound up leaving the company shortly after) and never needed to buy it in the first place. Package gets shipped to my apartment like a week after the work is already done.\\n\\nI send a few emails to the vendor saying we\\u2019d like to return it, but honestly I was really busy with other projects and kinda forgot about it. No one in accounting or my company ever followed up with me either. 6 months later, I got fired and 2 months after that, I\\u2019m working for a competitor of theirs in the same area. It\\u2019s now been 6-7 months since I left that job. I have no way of retuning it now without access to my old work email or the receipt.\\n\\nI went to move out of my apartment a couple weeks ago and found the box in my building\\u2019s storage unit, completely forgotten about and unopened. What the fuck do I do with this?\\n\\nHere are my options as I see it;\\n\\n-throw it away; probably a bad idea incase someone ever catches the issue. Plus it seems wasteful to throw something like this in the trash.\\n\\n-send it to the office with no return address; bad idea that I\\u2019m opposed to, might call attention to me if they look through their records.\\n\\n-take it to my office and essentially donate it to my current company. I\\u2019d definitely have to tell someone, it would be very obvious this is a brand new and expensive piece of equipment.\\n\\nWhat I refuse to do:\\n\\n-Store it indefinitely; I no longer have space for it.\\n\\n-Sell it; takes this from an accident to grand larceny, plus this is pretty unique stuff, its doubtful I could sell it anonymously.\\n\\n-Use it; I\\u2019m not a field guy, I have zero use for it and it\\u2019s unlikely any of my projects will either.\"", "title": "I accidentally stole a $2,500 piece of equipment from my old job and I don’t know what to do", "upvote_ratio": 0.87, "url": "https://www.reddit.com/r/careeradvice/comments/1482bub/i_accidentally_stole_a_2500_piece_of_equipment/"}, {"author": "Own-Style-9879", "created_utc": 1682830818.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 511, "post_id": "133g9av", "score": 1024, "subreddit": "careeradvice", "text": "\"\"", "title": "How do I tell my boss I can’t do a 5 day RTO policy? I got hired on as a hybrid employee. We got a new president a couple months ago, and now he’s making 5 days in office mandatory for everyone. I would not have taken this job if it was on-site. How do I tell him I can’t do it?", "upvote_ratio": 0.93, "url": "https://www.reddit.com/r/careeradvice/comments/133g9av/how_do_i_tell_my_boss_i_cant_do_a_5_day_rto/"}, {"author": "bluescluus", "created_utc": 1691448735.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 2049, "post_id": "15kzvzb", "score": 961, "subreddit": "careeradvice", "text": "\"I\\u2019m struggling to pick a career path, I am 25 and just started a job as an Assistant Property Manager making 50k. I\\u2019m partial to remote work but open to suggestions in any field.\\n\\nThose of you under 30 who make 6 figures or more \\u2014 what do you do and how long did it take you to reach that salary? Do you enjoy your work?\"", "title": "Those of you under 30 who make six figures, what do you do?", "upvote_ratio": 0.86, "url": "https://www.reddit.com/r/careeradvice/comments/15kzvzb/those_of_you_under_30_who_make_six_figures_what/"}, {"author": "Saburo1196", "created_utc": 1687751561.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 266, "post_id": "14j6dj5", "score": 954, "subreddit": "careeradvice", "text": "\"Basically I (M20) got fired from my full time job because I asked for 8 days off from my leftover paid leaves to study for my exams,this was 2 weeks ago now suddenly yesterday I got a msg from him and he said come and work as usual and he will also approve my days off..\\n\\nI don't know what to do back then when I asked him for my leaves he immediately said NO!,I have workload and I can't afford your leaves also I almost forgot to mention we had a new hire in our department and it had only been 2 weeks since he joined and he asked for a consistent full week off to attend his sister's wedding and my manager approved it.\\n\\nI don't know what to say to him, if joined I would have almost a month of pending work to do because he fired me and the other is on break..\\n\\n\\n\\n\\nUpdate: \\nThank you guys for all the response,I sent the reply \\n\\nI said \\\"Thank You for Reconsidering your Decision\\n\\nBut my exams are about a week away and I am giving it my all and only want to focus on my exams right now, I will consider joining after I am done with the exams.\\n\\nHe asked: By when the exams are completed?.\\n\\nI said : By 18th July 2023.\\n\\nHe said: I will give you your days off if you join from tomorrow.\\n\\nP.S: He agreed for the 40% pay raise and Leave Encashment for my last employment.He agreed on writing and mail as well.\\n\\nBut fellow redditors, I am still going to join after my exams.since there will due work and I will have to study I can't divide my mind between work and study if it's my future on the line.\\n\\nThank You, You Guys are the best\"", "title": "The Manager fired me and now he wants me to come back", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/careeradvice/comments/14j6dj5/the_manager_fired_me_and_now_he_wants_me_to_come/"}, {"author": "Vegetable_Bank9063", "created_utc": 1679910112.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 294, "post_id": "123hsb4", "score": 942, "subreddit": "careeradvice", "text": "\"UPDATE: Didn\\u2019t get laid off but ended up quitting instead with nothing lined up. I took a break for one month and will now be starting a new gig next week as a Manager of Business Operations at small business in the outdoor industry. So incredibly grateful. \\n\\nFor those of you who constantly see posts on here about not quitting your high paying job\\u2026at the end of the day it\\u2019s still \\u201cto each their own\\u201d. I currently work in the tech industry and make about $125k USD. For about a year now I\\u2019ve struggled with the fact that I genuinely think B2B SAAS is the most pointless industry to ever exist in the business world. It\\u2019s literally just a bunch of people selling software they built, to other companies who are also selling software they built, to other software companies, all just trying to cash out first. \\n\\nI work as a CSM, helping people set up their accounts with us, and I could care less about what I\\u2019m doing. For a while I justified the pay, but I genuinely can\\u2019t do it anymore. It\\u2019s such a waste of time, regardless of pay. Our company has a board meeting coming up and I\\u2019m really hoping to be apart of the inevitable layoffs. My wife and I want to start our own company that\\u2019s way more aligned with our values and hobbies. If it works out\\u2026great. If not, after a year, I\\u2019ll suck it up and jump back into tech. \\n\\nI guess I make this post to say, don\\u2019t settle, and enjoy your life.\"", "title": "6 figure salary and I hope I get laid off", "upvote_ratio": 0.93, "url": "https://www.reddit.com/r/careeradvice/comments/123hsb4/6_figure_salary_and_i_hope_i_get_laid_off/"}, {"author": "None", "created_utc": 1685461203.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 398, "post_id": "13vtn9n", "score": 927, "subreddit": "careeradvice", "text": "\"Is this it? Work, sleep, die. Ever since I started on a new career 2 years ago I have felt like my life is over. No time, no freedom, no energy, no joy, no life. Forcing myself to do this day in and day out has driven me to the darkest corners of depression you can imagine. I am very much at the edge of a cliff begging for a gust of wind. Nearly everyone I know encourages me to continue down this path tho. Suffering is just part of being an adult I guess. Maybe not a part, maybe it\\u2019s the point. \\n\\nI guess I\\u2019m looking for advice on how to cope with the monotonous, meaninglessness of work. Or I\\u2019m just venting. Honestly I don\\u2019t know, I\\u2019ve lost my mind in an office.\"", "title": "Is this what life is?", "upvote_ratio": 0.93, "url": "https://www.reddit.com/r/careeradvice/comments/13vtn9n/is_this_what_life_is/"}, {"author": "JuriFeetFan", "created_utc": 1706373916.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 354, "post_id": "1acf0c3", "score": 925, "subreddit": "careeradvice", "text": "\"I\\u2019m supposed to work an 11 hour shift, which starts in one hour, in a restaurant staffed entirely by myself (not joking) with the grand total of $2 of the restaurants money in change. I asked my boss \\u201cWhat am I supposed to do if someone doesn\\u2019t have exact change\\u201d and he said to take $50 of my money, split it up, and put in the register. \\n\\nThis is like, fucked right? Yesterday he had $10 in change and believe it or not I had to plead with the customer to give exact change because I couldn\\u2019t break the $50 they had. Should I just though it out?\"", "title": "My boss wants me to put my money in the cash register because he won’t give proper change", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/careeradvice/comments/1acf0c3/my_boss_wants_me_to_put_my_money_in_the_cash/"}, {"author": "Izvestnie", "created_utc": 1692008489.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 460, "post_id": "15qqrbk", "score": 910, "subreddit": "careeradvice", "text": "\"My (33m) boss (70f) forgot to submit my report on business expenses (for taking a client to lunch) and when I discovered this (a month after the deadline), I found out company rules prohibit me from being reimbursed so late. I don't do sales and can't expect that much personally in the way of gain from this client relationship other than the contact. On the one hand, the lunch cost about 10% of my monthly take home which is around the national average where I live. On the other hand, I don't want to ruin my mostly positive relationship with my boss by pressing the issue (the more so because she has already offered to reimburse me herself, which I declined because it was awkward). What would you do in this situation?\"", "title": "My boss made a mistake that cost me money. Should I eat it?", "upvote_ratio": 0.93, "url": "https://www.reddit.com/r/careeradvice/comments/15qqrbk/my_boss_made_a_mistake_that_cost_me_money_should/"}, {"author": "ArthurArkans", "created_utc": 1684525503.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 409, "post_id": "13m5pqi", "score": 905, "subreddit": "careeradvice", "text": "\"So I am planning to move, and yesterday was the time for me to put in my 2 weeks notice. I got a call from him today saying that I don't have to come in anymore, and my heart sank, but then he said that they would still be paying me for the next 2 weeks, insurance is still covered, etc. I asked why, and he said he wasn't sure, but it might have something to do with posting the position for recruitment (we're under a hiring freeze except to fill vacancies). Did I just hit the jackpot, or is there something a little more sinister afoot?\"", "title": "Supervisor let me go when I put my 2 week notice in.", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/careeradvice/comments/13m5pqi/supervisor_let_me_go_when_i_put_my_2_week_notice/"}, {"author": "Terrible-Hurry-3416", "created_utc": 1689767335.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 469, "post_id": "153sse1", "score": 890, "subreddit": "careeradvice", "text": "\"I\\u2019ve had a heck of a year with my current company where I\\u2019ve had various members of my direct and indirect team go off on mat leave, get fired or resign. With every team change somehow the burden has fallen on me to cover the role whilst vacant and train the new person - I\\u2019ve been working insane hours and constantly stressed for too long. I don\\u2019t have any hiring decision power however and we\\u2019ve been short 1 person since April which me and another are covering \\u2026 but management haven\\u2019t started advertising still. \\n\\nI signed a new job contract a few weeks ago at an amazing company that pays 40% more and seems half the stress\\u2026 but I am holding out to put in my notice until 4 weeks before my new job starts- I\\u2019m planning to put it in 10 days.\\n\\nOne of my team mates has just put in her notice, the one also covering the vacant role, but now I feel wrong for putting in my notice which will absolutely leave the team f*cked. \\n\\nI feel really bad about it now and I\\u2019m wondering if I should change my mind on the new job.\"", "title": "Resigning right after colleague resigns…. Feeling bad", "upvote_ratio": 0.94, "url": "https://www.reddit.com/r/careeradvice/comments/153sse1/resigning_right_after_colleague_resigns_feeling/"}, {"author": "SadDoughnut1073", "created_utc": 1681911134.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 512, "post_id": "12rtf3b", "score": 867, "subreddit": "careeradvice", "text": "\"I got offered a job yesterday (edit: hard offer, letter received)\\n\\nMy wife and I discussed whether or not I should negotiate my salary\\u2026 personally I\\u2019m not comfortable with negotiating. I know it\\u2019s typically good to do so, but I don\\u2019t have any data to support the claim\\u2026 tbh the job was already a reach for me and it\\u2019s a $25k increase from my current job. \\n\\nI meet the paper qualifications (degree, certifications, etc.), but am dwarfed by a lot of the \\u201cexperience\\u201d asks, and not just like the passage of time, but also the just like actual \\u201chave you ever done x task?\\u201d Which is kind of why I want this job\\u2026 it will be HUGE experience/resume builder compared to my current job. \\n\\nI\\u2019ve got a wedding coming up, so my sole negotiating point was that the wedding+honeymoon is protected, which given how much of a reach the job is, I think is enough.\\n\\nAlso, a year from now if I prove I can hang\\u2026 then I\\u2019ll ask for a raise based on my performance. \\n\\nDo I sound insane?\"", "title": "Got offered a job, don’t want to negotiate salary", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/careeradvice/comments/12rtf3b/got_offered_a_job_dont_want_to_negotiate_salary/"}, {"author": "thewizarddan", "created_utc": 1708700957.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 1533, "post_id": "1ay2rhl", "score": 861, "subreddit": "careeradvice", "text": "\"I'm in my early 30s with a wife and child.  We are a one-income household and I currently make $80k base, with 5 - 10% bonus. I receive 3% raises.\\n\\nI absolutely love where I work. It is a very renowned healthcare company, but I recently flirted with the idea of seeing what's out there, and I was contacted by a healthcare company in California. After interviewing, they are offering me $110k - $120k base, unlimited PTO, and fully remote (current employer is taking us from 2-days in the office to 3; my commute is 1 hour and 10 minutes each way).\\n\\nTo be clear,  this offer is a life-changing amount of money for me, and the position isn't too different in terms of responsibility from what I have now. It'll be a healthy challenge. The most conflicting thing for me is that my current employer is very well established in our industry, and I love my boss an my co-workers. It's a great culture and I feel a sense of loyalty to my boss especially.\\n\\nBut lately, I just feel like I haven't been getting ahead because I only have about $500 left over every month after all expenses are paid (including entertainment).\\n\\nOn paper, many would see this as a no-brainer, and I kind of see it that way too. But emotionally and spiritually, I wonder if I would be making the right decision.\\n\\nI *really*  wanted to get your thoughts on this guys. I'm feeling very emotional about it.\"", "title": "I have no idea what to do: increase my income by $30k -$40k, or stay working with people I love.", "upvote_ratio": 0.92, "url": "https://www.reddit.com/r/careeradvice/comments/1ay2rhl/i_have_no_idea_what_to_do_increase_my_income_by/"}, {"author": "nobody2000", "created_utc": 1689570801.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 172, "post_id": "151sepz", "score": 861, "subreddit": "careeradvice", "text": "\"EDIT: like...HALF of you didn't even read the title let alone any part of the post. \\\"UPDATE TO:\\\" means there's an update. The post shows what I did. \\n\\nTelling me that I should not take the counter...SMH. \\n\\nThis is why you don't take advice from strangers on the internet - only weigh and consider their offered perspective. Everyone just wants to give their input but not everyone wants to read. \\n\\n***\\n\\nOriginal post: \\n\\nhttps://www.reddit.com/r/careeradvice/comments/14udygz/i_have_signed_and_accepted_a_job_offer_and_put_in/\\n\\nI wanted to thank everyone for the advice and more importantly, the personal stories from those who took the counter/didn't take the counter offer. The boomerang stories were also very appreciated. \\n\\nIn short - I'm not taking the counter. \\n\\n***\\n\\nAs anticipated, the COO, President, a few VPs, my boss, and my old boss all chatted with me. \\n\\n- President was mostly concerned that there was a systemic problem at the company. The company has issues, but nothing that specifically made me leave. There were headaches, sure, but I'll be pretty disappointed if I think that there are workplaces without headaches. I simply saw an opportunity and took it.\\n\\n- VPs and my boss mainly wanted to hear me out about what I'm going to. I was vague as could be - even the tiny bits that I did divulge (I'm going into data engineering) was met with \\\"we can get you opportunities here to do that.\\\"\\n\\n- My former boss was probably the only one who was understanding. He's a huge champion of the company, so I honestly expected him to be more upset, but he's a reasonable guy who fully understands the need to do what's best for yourself. We both came from the same company previously, and he quit that job before I left - and he didn't have ANYTHING lined up. \\n\\n- The COO came to me with the counter and honestly - it sealed the deal for me leaving. \\n - He brought in IT who were thrilled to have me potentially join their team as a data engineer. Again - my mistake for divulging this much.\\n - He agreed to exceed the offer\\n - He framed everything in a \\\"we can use you\\\" perspective and not a \\\"we would like to help you grow your career\\\" perspective. Yes - he mentioned how he sees me in leadership **and I believe him based on my experience with the company**, but I also know that the wheel turns slowly and it would be probably 5 years before I see that come to fruition IF AND ONLY IF someone dies/retires. \\n - It was clear that even though he took his sweet time coming up with a plan, he didn't have a good plan.\\n - It was clear that it was unlikely that any changes would be immediate and no guarantees would be made in terms of minimum time in the new role.\\n\\nSo tomorrow I'm telling them that I appreciate the generous counter, how I appreciate them coming together to find something for me, but ultimately, I do see a greater opportunity outside of the company, but I would like to get together periodically to talk shop and if an opportunity opens up that can use some of my new skills, I'd love to explore jumping back in (i.e. if they have an opportunity to put me on the Executive Committee or hell - within the team of operating directors, I'd be game).\"", "title": "UPDATE TO: I have signed and accepted a job offer and put in my notice at my current company. Suddenly all the big plans they had for me surface and the \"what can we do to keep you?\" is also being said. What's the best course of action to navigate?", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/careeradvice/comments/151sepz/update_to_i_have_signed_and_accepted_a_job_offer/"}, {"author": "KenJyi30", "created_utc": 1686451605.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 808, "post_id": "146ihvl", "score": 848, "subreddit": "careeradvice", "text": "\"I've figured out a way to finish \\\\~5 days work in 1 day; yay me! An 80% time savings per project (200+ projects) should be worth something right? How do I negotiate with this large potential of productivity? Could I reasonably ask for an 80% increase in pay? lol\\n\\nI work at a very small company, I work directly with the CEO and I am the one and only person doing this work; zero overlap of responsibility with anyone else. If I tell him, a bump in salary or bonus is not guaranteed but the increased productivity will be expected because what excuse would I have to do it the slow way?\\n\\nBackstory: 2 months ago I got an increase in pay. It wasnt a raise, it was supposed to be my salary. Despite having it in writing in my offer letter, they paid an intro salary of 70% for the first 90 days and then up to 100% after the 90 days, it took a year and 90 days to get up to my full salary. The difficulty getting the company to honor their own offer letter makes me weary about gaining something for my new discovery. Unfortunately I cant take these new skills elsewhere, the stuff that i figured out is specific to this company. This increase in productivity is not expected of me, this part of my job was inherited from someone who left.\\n\\n&#x200B;\\n\\nEDIT: My discovery is not AI or automation related, it's closer to a creating a specialized tool instead of using a generic one.\\n\\nWe've all had to go back to the office so the time saved is still spent at the office\\n\\nAlso if anyone has tips on how to write this sort of thing into a CV resume please post up or DM me\"", "title": "I've discovered something that will result in a huge increase in productivity, how can I negotiate more pay?", "upvote_ratio": 0.89, "url": "https://www.reddit.com/r/careeradvice/comments/146ihvl/ive_discovered_something_that_will_result_in_a/"}, {"author": "grace_notgrave", "created_utc": 1686321974.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 805, "post_id": "1457742", "score": 830, "subreddit": "careeradvice", "text": "\"*I am posting this for a friend who doesn\\u2019t have Reddit*\\n\\nI (female, 23) just started my first salary job 5 months ago. It is a job working in marketing for a Fortune 500 company. \\n\\nYesterday evening, my city\\u2019s division had dinner meeting. At the meeting, mostly everyone drank and spent time discussing work but also personal lives, sports, etc. Most of attendees had a night booked at a hotel so that anyone who wanted to drink would not worry about driving. \\n\\nAs the dinner was wrapping up, myself and 2 other young coworkers decided we wanted to go to one more bar before going to bed. As we were arranging this plan, an older coworker (male, around 50) asked if he could join us. We said it was fine and headed to the bar. \\n\\nAs we were walking in, my ass was slapped two times. I had assumed it was my young female coworker since we are pretty comfortable with each other. We got drinks then the four of us sat down at a table. A few minutes later, the older coworker asked me if I could chat with him at another table, and I said that was fine. \\n\\nThe first few minutes were ok, but then he suddenly asked, \\u201cwould you want to fuck me?\\u201d. I said no and got up to go back to the original table. While I did this, my older coworker went to the restroom. I immediately told my two younger coworkers what happened and they said they watched him slap my ass two times on the way into the bar. I was shocked. \\n\\nAt the same time, my older coworker was walking back to the table so I asked my younger female coworker to go to the restroom with me. For around 10 minutes we discussed the situation and decided the best course of action was just to leave the bar. As we were waiting for our Uber, my older coworker fell completely down out of drunkenness. \\n\\nMy younger male coworker helped him up,  then we got into an Uber that took us back to my apartment building (which is only one block from the hotel the three of them were staying at). When we got out, my older coworker assumed that we would go into my apartment building and into my apartment together. We all said no, but he was being persistent. \\n\\nSo for safety, all four of us walked back to the hotel knowing that after my older coworker got to his hotel room, that I would be able to walk back to my apartment safely. \\n\\nI got home just after midnight and cried for about 30 mins before going to bed. \\n\\nThis older coworker of mine has been with my company for 15+ years, and I\\u2019ve only worked here for 5 months. My direct manager is also an older male, and isn\\u2019t the type to understand the severity of sexual harassment in the workplace. \\n\\nIn 5 months, I\\u2019ve had to complete two separate work harassment training modules, but I still feel as if if this incident was reported to HR that my side would not be taken, even with two witnesses. \\n\\nDo I just let the situation go and going forward avoid interactions with this coworker (who I do not see on a daily basis) or do I report it to HR? \\n\\nI want to choose whichever option has a neutral impact on my job and position within the company. I want to report it, but I feel as if all of my coworkers would hate me since my older coworker is loved by so many. \\n\\nHas anyone faced this same or a similar situation and has advice? I would be greatly appreciated!!\\n\\n*friend edit*: This is a response to the minority of people blaming my friend and trying to excuse the man\\u2019s behavior by saying \\u201cwell she thought it was her friend first and thought it was ok!\\u201d When she felt herself get hit, she originally thought it was the female coworker or an accident. In both of those instances, no one would have malicious or sexual intent. The person who does the act MATTERS. A friend vs a stranger touching you MATTERS. If you disagree, then keep your thoughts to yourself. She\\u2019s reading these and needs only positivity, and I can\\u2019t keep coming on here flaming the incels (even tho it is fun).\"", "title": "Need advice: my coworker sexually harassed me", "upvote_ratio": 0.86, "url": "https://www.reddit.com/r/careeradvice/comments/1457742/need_advice_my_coworker_sexually_harassed_me/"}, {"author": "MassiveAbrocoma9251", "created_utc": 1690921775.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 187, "post_id": "15fnttu", "score": 822, "subreddit": "careeradvice", "text": "\"Had an impromptu meeting with my manager where he (unexpectedly) laid into me, accusing me of poor performance among other things. The feedback was resoundingly bad; it felt like a pretext for firing me. This comes after he went around me to torpedo one of my biggest projects (which I initiated on my own). He\\u2019s made it clear that he doesn\\u2019t want me working on it because I \\u2018don\\u2019t know what I\\u2019m talking about\\u2019. But now, other people higher than him are going around my manager to explicitly ask that I continue working on the project. What\\u2019s the move here?\"", "title": "Manager wants me gone; the company doesn’t", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/careeradvice/comments/15fnttu/manager_wants_me_gone_the_company_doesnt/"}, {"author": "Waltgrace83", "created_utc": 1681559510.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 281, "post_id": "12mzsk9", "score": 790, "subreddit": "careeradvice", "text": "\"I continually hear that you don\\u2019t get significant raises (tens of thousands of dollars) unless you change companies. Why would companies do this? Here is how I understand it.\\n\\n- you work at company X in job Y\\n- you have been working in this job for 2-3 years and it is time for you to move up with your experience and success\\n- you go to boss of X and ask for a raise\\n- boss says that they can only do a 10% raise \\n- you apply for other jobs and find out the market rate for you is a 40% raise\\n- you get a job at company A and get your 40% raise, resigning from X\\n- company X needs to replace you, realizes the market rate is 40% higher; and ends up paying the person a lot more money than you made\\n\\n\\n\\u2026why not retain employees who know your company?\"", "title": "Why don’t you get significant raises unless you move companies?", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/careeradvice/comments/12mzsk9/why_dont_you_get_significant_raises_unless_you/"}, {"author": "Davie_dave1001", "created_utc": 1679996112.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 394, "post_id": "124j9lc", "score": 790, "subreddit": "careeradvice", "text": "\"I am the assistant manager at my work and have applied for my manager's role, as they have retired. I have been told that I may or may not be promoted, the promotion comes with a significant pay raise, however, no decision has been made. My wife has just found out she is pregnant with our second child and has said that if I do not get the promotion then she wants to move closer to family, which I am in agreement with her.\\n\\nI do not know how to approach my superiors and tell them that I will be leaving if I am not chosen, without making it sound like I am throwing out my toys.\\n\\nThe other issue, is if I am not promoted and I leave, my work will lose their only management in my worksite, and will be up shit creek without a paddle. I am cognisant of how this conversation will look, however if my career is not progressing, and they hire someone else, my growth within this company will be significantly delayed, to the point where I will have to move or become stagnant.\\n\\n&#x200B;\\n\\nEdit: thank you for your advices and guidance and decided to see how the situation played out without showing my hand, I will be taking over from the out going manager on the 1st of July.\"", "title": "How to say in a professional way, if I do not get the promotion, I will be resigning?", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/careeradvice/comments/124j9lc/how_to_say_in_a_professional_way_if_i_do_not_get/"}, {"author": "threat_cake1", "created_utc": 1688993929.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 634, "post_id": "14vtcpf", "score": 787, "subreddit": "careeradvice", "text": "\"I work as an IT project manager for a large global company. I have always loved my current boss and have a great relationship with her. I have been taking on more responsibilities as I am a more senior member on the team, so I asked my boss for an increase in compensation. She immediately escalated this to her boss who approved a huge raise. Now, our HR is saying that it is company policy that they will only do mid-year pay raises as counteroffers.\\n\\nMy options are now to stay in my current role at my current salary or go looking for other jobs just to get an offer so that HR can counter off of it. This seems like a backward system, is this a standard HR business standard or are they just blowing smoke? \\n\\nI don\\u2019t want to go searching for another job, go through their entire hiring practice just to turn down their offer. There are not that many opportunities in my area in this field and I don\\u2019t want to burn any unnecessary bridges.\\n\\nWhat is my best course of action here?\"", "title": "HR says I need a counter offer to approve a raise", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/careeradvice/comments/14vtcpf/hr_says_i_need_a_counter_offer_to_approve_a_raise/"}, {"author": "sunshine_chaser99", "created_utc": 1684164004.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 429, "post_id": "13iba4x", "score": 783, "subreddit": "careeradvice", "text": "\"\"", "title": "Why the fuck I am rejected by over 50 companies even when I tailor my cover letter specially every time and even for the roles my cv is good or near perfect?", "upvote_ratio": 0.9, "url": "https://www.reddit.com/r/careeradvice/comments/13iba4x/why_the_fuck_i_am_rejected_by_over_50_companies/"}, {"author": "AnxiousAndWorried_", "created_utc": 1691136343.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 285, "post_id": "15htt4k", "score": 781, "subreddit": "careeradvice", "text": "\"The salary suggested by the HR of a company at the interview is many times lower than the salary given in its job posting, and much lower than the market salary for the job nature. The salary of their job posting is already lower than the market salary but the salary that HR suggested is much lower than that.\\n\\nThe HR questioned my expected salary because to her it is too high, even though the salary I gave was what was stated in the posting. I did not give her an explanation because I'm a newbie for job interviews and didn't know what explanation to give.\"", "title": "Salary given in the interview is different from what's posted on the website. How should you respond when faced with this situation?", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/careeradvice/comments/15htt4k/salary_given_in_the_interview_is_different_from/"}, {"author": "hakunamatada2244", "created_utc": 1683006215.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 258, "post_id": "135chmt", "score": 769, "subreddit": "careeradvice", "text": "\"I hate everything about it. I\\u2019m only 5 months in and I\\u2019ve never hated anything more. It\\u2019s not even the job itself it\\u2019s the micromanaging the drama and the judgement. They expect you to be available 24/7 I\\u2019ve never not gotten a text on my day off regarding something at work. The manager constantly wants to \\u201ctalk to you about something\\u201d the co workers gossip and the clients are demanding everyone expects you to be perfect but I keep reminding myself this is what I went to school and paid thousands for.\\n\\nI\\u2019m beyond burnt out I cry every weekend dreading going back to work today I broke down and drove to my grandmothers grave and just sobbed about it for hours. I make more than the average person out of school in my field and I feel like I shouldn\\u2019t hate it as much as I do. I can\\u2019t quit cause I\\u2019m saving up for a house and just do not want to stay with my parents anymore so I can\\u2019t take the pay cut or the possibility that it will take months to find employment which would drain my savings. Being an adult is so depressing\"", "title": "I hate my job", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/careeradvice/comments/135chmt/i_hate_my_job/"}, {"author": "Realistic-Battle-870", "created_utc": 1704588585.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 1707, "post_id": "190f985", "score": 761, "subreddit": "careeradvice", "text": "\"More in depth:\\nHow long did it take you to get there?\\nWhat were the prerequisites required?\\nWhat other extenuating circumstances are important to note?\"", "title": "People who make 250k+ what do you do?", "upvote_ratio": 0.93, "url": "https://www.reddit.com/r/careeradvice/comments/190f985/people_who_make_250k_what_do_you_do/"}, {"author": "Gridman1", "created_utc": 1690777551.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 751, "post_id": "15e5z2x", "score": 757, "subreddit": "careeradvice", "text": "\"A co-worker of mine just left our group for a competitor and substantially more money and everyone is aware of this fact. Before he left, we shared notes on salary and it came to light that he was being paid the same as me despite me having a much longer tenure at the company and a higher title.\\n\\nWhen I brought this up to my superior he seemed genuinely surprised by the information and he immediately went to the head of HR to discuss the issue. The two of them decided that it would be appropriate for me to get a promotion to a new title and significantly more money (approximately $40K more than I currently make). My superior will be seeking sign-off for this from the CEO when he returns from vacation.\\n\\nHere is the catch... my superior has suggested that the request should be for the promotion to be made effective in April which is generally the month when most promotion announcements are done (although there are some that happen in September). Due to my co-worker leaving, our team is particularly vulnerable and my value has increased. My superior thinks if I demand a promotion/raise effective now, it may look like I am trying to strong-arm them at a time that they are most vulnerable.\\n\\nI'm not sure I can wait 9 months for this raise, particularly given that they will likely look to replace the co-worker who just left and will pay him more than I am making right now.\\n\\nHow can I present my request for the promotion to happen immediately without coming off as someone who is taking advantage of their moment of weakness?\\n\\n&#x200B;\\n\\n&#x200B;\\n\\n&#x200B;\"", "title": "Found out I was underpaid and now promised a promotion in 9 months. What should I do?", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/careeradvice/comments/15e5z2x/found_out_i_was_underpaid_and_now_promised_a/"}, {"author": "hjensen1017", "created_utc": 1683222732.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 1045, "post_id": "137unmg", "score": 742, "subreddit": "careeradvice", "text": "\"UPDATE at the bottom of the post!\\n\\nI (24F) live with my fianc\\u00e9 (25M) in a major city in Texas. We are both engineers - I work at a so-so job that I used to enjoy but no longer do and he works at a large, highly respected company in a role he likes. The situation with my current company is complicated - I was a victim of sexual harassment in which the perpetrator was fired, but things haven\\u2019t been the same since that. \\n\\nI haven\\u2019t been actively job searching, but the job market for my industry is hot right now and I talk to a lot of recruiters. One role in particular caught my eye - working with a large company on software that I have a lot of experience with and genuinely enjoy working on. I wanted to see where the opportunity led and I now have a job offer in hand for a higher salary with comparable benefits to my current role.\\n\\nThe problem is that this role is in another major city in Texas, about a 4 hour drive from where we currently live. My fianc\\u00e9 is open to moving as it would be closer to his family, but he can\\u2019t leave his job until November due to a contract. He has discussed remote work and transferring offices with his company now that I have the official offer, but didn\\u2019t have any luck unfortunately.\\n\\nHe wants me to be happy, so he wants me to take the job offer and have a job that I really enjoy. But neither of us particularly want to live apart for 6 months.\\n\\nThe way I see it, we have a couple of options:\\n\\n1. I refuse the job offer and keep working at my current job. I will keep looking for a job I genuinely enjoy in our current city.\\n2. I accept the job offer and live 4 hours away from my fianc\\u00e9 for about 6 months. I would come home on weekends and days that I can work from home. He would quit a job he likes after 6 months to move to the new city with me.\\n3. I accept the job offer, my fianc\\u00e9 quits his job to move and we owe ~$20k to his company for him leaving early (not really an option for us)\\n\\nWhat would you do in this situation? Any advice on the 3 options would be helpful, or suggestions for a 4th option that I am not seeing. I am happy to provide clarifying details as needed.\\n\\nEdit: seeing lots of \\u201coption 2 duh\\u201d or something to that effect. We are newly engaged and genuinely love living together, so living apart isn\\u2019t sounding super ideal. Yes, I agree 6 months is a drop in the bucket compared to spending our lives together. The question is more how can I ask him to sacrifice his career for mine? It doesn\\u2019t seem fair for him to have to leave a job he likes. But I think I will regret passing up this opportunity.\\n\\nUPDATE: I have accepted the new job and plan to move into a furnished apartment with a 6 month lease until we can find a house together in the new city. I sincerely appreciate everyone who offered advice and shared their stories - I read as many comments as possible but the response has been overwhelming. Thank you to those who offered actionable advice and genuine empathy for the situation. I\\u2019m hopeful that this move and new job will work out!\"", "title": "I just got the job offer of my dreams, but it requires relocation.", "upvote_ratio": 0.88, "url": "https://www.reddit.com/r/careeradvice/comments/137unmg/i_just_got_the_job_offer_of_my_dreams_but_it/"}, {"author": "CockyRepublican", "created_utc": 1684449898.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 280, "post_id": "13ldco2", "score": 732, "subreddit": "careeradvice", "text": "\"19 months clean from meth and starting school for dental hygiene fall 2024. I already have a bachelor's degree in computer technology from Kent state with a 3.875 gpa. I don't want to do computers any more as it's soul sucking. How long does it take for brain chemistry to return to normal after meth? Would I be able to handle hygiene school? I'm determined to live a better life and reach my goals.\"", "title": "Can I still turn life around at 30 after a brutal meth addiction? Who turned there life around after addiction?", "upvote_ratio": 0.93, "url": "https://www.reddit.com/r/careeradvice/comments/13ldco2/can_i_still_turn_life_around_at_30_after_a_brutal/"}, {"author": "Basicallymaybe", "created_utc": 1686668128.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 737, "post_id": "148halw", "score": 736, "subreddit": "careeradvice", "text": "\"I (31, f) am getting married in my soon-to-be in laws backyard Saturday, July 15th. The entire thing is DIY, meaning my fiance, myself, and a handful of others in the bridal party will be orchestrating the whole thing - let's be honest, I'm doing 90% of it as the bride lol. I scheduled the wedding to be on a weekend I have off from work (I work every other weekend consistently) so that I didn't have to book time off for the exact wedding dates. \\n\\nI work in a longterm care home as a recreation therapist. About a week ago, I put in a request to have the day prior to my wedding off. I typically would work 10am-6pm, but we have so much to do to prep for the wedding the next day (ie, picking up all the tables and chairs, putting up tents, putting up lights and other decorations, making food, etc), as well as we have the rehearsal dinner scheduled for that evening that we have to set up for. Anyways, I was called to my supervisors office after putting in the request and they said realistically it doesn't look like they will be able to give me the day off as it's only myself and 2 others scheduled that day. Typically, 1 recreation therapist covers 2 units, and if I were to not be at work then the other two would have to cover 3 units each. This isn't ideal, however this does happen often as people call in sick on weekends when we are low staffed. My supervisors best offer was that she can allow me to work just a half day, but she can't give me the full day off.\\n\\nSo my question is, should I insist that I get this 1 requested day off? Or should I just take what I can get and take the half day and suck it up? This supervisor is a stand-in as my real supervisor is off due to an injury - I know my actual supervisor wouldve given me the day off. I do know if I went to the owner of the facility, they would likely tell me to take the day off as well, but I don't want to go over my interim supervisors head necessarily. I'm not a confrontational person so my instinct is to work the half day and deal with the stress, however many people in my life are saying it's ridiculous that they can't give me one day off to prep for my wedding.\\n\\nTldr; should I insist that I won't be able to work the day prior to my wedding due to wedding prep, or should I simply accept that the request was denied?\"", "title": "Day off request denied for day before wedding, should I insist I have the day off?", "upvote_ratio": 0.93, "url": "https://www.reddit.com/r/careeradvice/comments/148halw/day_off_request_denied_for_day_before_wedding/"}, {"author": "ThrowItAwayNow0031", "created_utc": 1703480119.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 374, "post_id": "18qbp8e", "score": 713, "subreddit": "careeradvice", "text": "\"I was recently promoted to a new position and I oversee a team within my company. Locally, I report to one person.  On Friday, our President called me and told me that he will be letting my boss go in a few weeks and he is only telling me because it will impact me the most and he will need me to help minimize fallout with our team and with our clients.  It is uncommon and a big deal for someone at his level to be fired.\\n\\nThey are not replacing him and it sounds like the plan will be for me to train up to his position over the next year or so.  Although it is daunting, I am up for the challenge.  I am still transitioning into my new role and now it seems that it is going to grow significantly to fill my boss\\u2019s role as well.  What questions should I be asking when the President is in town in a few weeks to make this change?  \\n\\nMy main concern is that I am already spread too thin and now will be taking on more responsibility and under even more scrutiny as my office\\u2019s performance will be a direct reflection of how well I am growing into this role.\\n\\nA little more background - I was very dissatisfied with my recent raise. Although it was a somewhat significant promotion, the raise was minimal due to \\u201ccurrent economic conditions.\\u201d  It did not get me to the range that I understand to be average for similar roles in my field.  Is now the time to push the president for more?\\n\\nSorry for rambling but this was dropped on me the Friday before the holidays and has me stressing about the impending changes that I\\u2019m not allowed to share with anyone.  I thought maybe y\\u2019all could offer some insight.\"", "title": "My boss is about to be fired", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/careeradvice/comments/18qbp8e/my_boss_is_about_to_be_fired/"}, {"author": "ProfessionalKitty23", "created_utc": 1686790547.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 242, "post_id": "149ofa4", "score": 710, "subreddit": "careeradvice", "text": "\"Last week three staff engineers resigned from my department. All of them resigned with very little notice. This week, another three senior engineers suddenly resigned too, with very little notice. I talked to them, and they didn\\u2019t have any jobs lined up\\u2026\\n\\nEdit: My coworkers (the ones who I think may have been in the know) seems uncomfortable when I brought the topic up said these people were 1) \\u201cunhappy and wanted to leave\\u201d or 2) \\u201cneeded a break\\u201d. \\n\\nIt\\u2019s weird that 6 people left in the span of one week. This is certainly a red flag for me - either the department is fucked, or there are layoffs, or this department is horribly managed and people hate it here.\\n\\nWhat do you make of this? I don\\u2019t think anyone would quit with one days notice unless they were very angry or forced to resign.\"", "title": "Lots of people have been resigning very suddenly from my department: time to jump ship?", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/careeradvice/comments/149ofa4/lots_of_people_have_been_resigning_very_suddenly/"}, {"author": "bluescluus", "created_utc": 1705189179.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 1791, "post_id": "1961luz", "score": 703, "subreddit": "careeradvice", "text": "\"I\\u2019m struggling to pick a career path, I am turning 26 soon and recently started a job as an Assistant Property Manager making 50k. I\\u2019m about 9 months away from graduating with my Computer Science bachelors degree. I\\u2019m also in the process of getting my real estate license (job requirement) but I have no current plans to go the route of selling houses. I\\u2019m partial to remote work but open to suggestions in any field.\\n\\nThose of you under 30 who make 6 figures or more \\u2014 what do you do and how long did it take you to reach that salary? Do you enjoy your work?\\n\\nAnything you recommend for me?\"", "title": "Those of you under 30 who make six figures, what do you do?", "upvote_ratio": 0.92, "url": "https://www.reddit.com/r/careeradvice/comments/1961luz/those_of_you_under_30_who_make_six_figures_what/"}, {"author": "AirframeTapper", "created_utc": 1688426079.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 306, "post_id": "14py58v", "score": 685, "subreddit": "careeradvice", "text": "\"Hello there - looking for feedback and advice on a recurring issue with my manager. I\\u2019ve been at my role over 5 years and am currently pursuing an MBA in a relevant field (halfway done!). I\\u2019m very focused and loved what I do at my current company. \\n\\nLast year, a new manager for my team was hired and within 3 months of her being there she put me on a PIP for very vague reasons (availability, response time, priorities). I beat the PIP, but six months later she put me on another one for very similar reasons, despite the fact that she had changed my role significantly to pivot away from customer service to basically sales support. I beat this PIP again.\\n\\nLast week, I went on vacation and she again put me on another PIP for reasons similar to the first two. She constantly interrupts me for \\u201cquick check-ins,\\u201d requests last-minute reports about my work, and has a tendency to do something I am already working for. She\\u2019s micromanaging me excessive over a job I was doing for years before she came onboard.\\n\\nI hate the fact that she is making me leave this company because I truly enjoy the work and my peers. How can I combat what I know is unfair treatment? Thanks in advance!\"", "title": "Third PIP in a year, manager clueless", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/careeradvice/comments/14py58v/third_pip_in_a_year_manager_clueless/"}, {"author": "THICC_ANIME_TITTIES", "created_utc": 1691686091.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 659, "post_id": "15nhmz1", "score": 681, "subreddit": "careeradvice", "text": "\"I work as a programmer at a company that does health technology and my role was just eliminated thanks to cost cuts. They told me I have 8 weeks to look for a new role within the same company, and if I'm unable or unwilling to find a new role then they'll just terminate me with about 7 months of total severance.\\n\\n\\nPersonally, I'm kind of relieved. I can *already* feel the stress of deadlines lifted from my shoulders. The pay and benefits at this job are very good, but I've been feeling pretty burnt out and unfulfilled in this career. The work isn't interesting and I haven't \\\"excelled enough\\\" in my performance reviews to be considered for promotion, despite having several years of experience in this field (I've been working for several years straight since right after I graduated college). I see this as a rare opportunity to take some time to just travel and work on personal projects. An extended paid vacation, basically. So I'm leaning towards just taking the severance and chilling out for some months, and then looking for a new job towards the end of the severance period. \\n\\n\\nI had a conversation with my aunt about this. She's a very smart and successful career woman, but she's also pretty conservative. She said that I should immediately start looking for a new position, and kind of half-joked about how I'd never be able to find a girlfriend/wife while I'm unemployed. I didn't really take it to heart, but at the same time I am pretty worried about how tight the economy is right now in the tech sector. In the worst case, if I have trouble finding a new job towards the end of the severance period I'd have to move back in with my parents so as to not drain my hard-earned savings. And living with my parents would really suck since my dad is kind of an old cantankerous authoritarian. \\n\\n\\nAny thoughts or similar past experiences? My main concern is the economy in the tech sector right now.\"", "title": "Just got laid off. Do I immediately look for a new job or just take the severance and take a break?", "upvote_ratio": 0.93, "url": "https://www.reddit.com/r/careeradvice/comments/15nhmz1/just_got_laid_off_do_i_immediately_look_for_a_new/"}, {"author": "Lively-sage", "created_utc": 1691268135.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 179, "post_id": "15j65j2", "score": 681, "subreddit": "careeradvice", "text": "\"I\\u2019d had car trouble going to the interview out of state, so I got in late and had no time to prepare. Then the address she gave me for the parking garage didn\\u2019t exist on Apple Maps, so I had to walk a ways and was a few minutes late. This, along with not being fully prepared, had me so flustered I couldn\\u2019t think straight during the interview. At the end, they asked if I had any questions, and I said I had a lot, but they just weren\\u2019t coming to me. \\n\\nSo does anyone have any ideas what the email should say? I really think I can redeem myself with a good one.\"", "title": "I bombed an interview. But the manager told me twice to email him my questions as he walked me out. So I need to figure out what to say to redeem myself", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/careeradvice/comments/15j65j2/i_bombed_an_interview_but_the_manager_told_me/"}, {"author": "BusyMakingCupcakes", "created_utc": 1683652378.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 252, "post_id": "13cznn4", "score": 662, "subreddit": "careeradvice", "text": "\"I work at a hybrid job but some of my co-workers are fully remote. There is one I don't get along with, she makes snide comments about me in meetings, complains about my work to my boss, etc. She just sent me a Slack message about wanting to \\\"catch up, no specific agenda,\\\" and asked me if that was okay. \\n\\nI'm unbelievably busy this week and next, but on top of that, I decline ACTUAL MEETINGS when there's no agenda. I don't think I need to spend work time meeting with this person to \\\"catch up\\\" when we've never spent time speaking before. I've been cordial with her on group calls, but I'm not comfortable having this superficial zoom call. \\n\\nIs this something I can politely decline and how do I go about doing that?\"", "title": "Am I required to interact with a co-worker with \"no agenda?\"", "upvote_ratio": 0.94, "url": "https://www.reddit.com/r/careeradvice/comments/13cznn4/am_i_required_to_interact_with_a_coworker_with_no/"}, {"author": "Addysellout", "created_utc": 1686414442.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 270, "post_id": "1464i7b", "score": 655, "subreddit": "careeradvice", "text": "\"My boss is someone whom I dearly respect and care about, he hired me on 3 years ago as a junior and trained me. Over the years he\\u2019s advocated for me and my promotions. We\\u2019ve always have had a great relationship and stuck around when things were extremely tough consistently.\\n\\nAfter receiving a better job opportunity, I had to take it no brainer for my career. Although a big part of me wanted to stay. \\n\\nI gave a month notice knowing fully well that we are severely understaffed. But instead was told by my manager that my boss suggested I just wfh till my last day and do 2 weeks or until admin tasks are done.\\n\\nGreat, so he\\u2019s been ignoring me, obviously avoiding seeing me at all despite my attempts asking if we could grab a coffee next week. Definitely got the message, so I told my manager I\\u2019ll be out and done 5 days after notice.  \\n\\nMy boss continues to ignore  me all week up until Friday and finally called. His voice sounds wounded and begins telling me how he\\u2019s so disappointed\\u2026 *but ultimately happy for me*. He then starts asking obvious questions while being very short. He just sounded so off and out of character, clearly he was a forcing himself small talk. His voice got progressively more unstable to which I can hear him choking up on words. Of course I start getting all emotional just from hearing the pain in his voice. And now I\\u2019m struggling to explain how hard this decision was feeling guilty and about to burst into tears. The call lasted only 3 mins before getting awkward at the end as neither of us could properly speak while trying to keep our composure. \\n\\nHe was so callous and short. Normally he\\u2019s very calm, kind, rational and soft spoken. I expected irritation, anger, maybe a little manipulation or even being cold and scripted. But this caught me off guard and just seems way too sad..\\n\\nSad disappointments hurt way more than angry disappointments. \\n\\nUltimately he shouldn\\u2019t have taken this personally and I shouldn\\u2019t be either. I knew this was going to be tough, but not hurt like this wtf. \\n\\nWe work in a tight knit industry so we\\u2019ll cross paths sooner or later.. I just don\\u2019t want to end on a sour note or like making people sad\\n\\nAm I better off doing nothing and dipping early? Should I send heartfelt appreciation email my last day?\"", "title": "Boss has been ignoring me after resignation and took it poorly", "upvote_ratio": 0.92, "url": "https://www.reddit.com/r/careeradvice/comments/1464i7b/boss_has_been_ignoring_me_after_resignation_and/"}, {"author": "Ben5544477", "created_utc": 1683828748.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 291, "post_id": "13ev6bs", "score": 644, "subreddit": "careeradvice", "text": "\"Where I work, pretty much everyone in my department is 20+ years older than me. Is that strange? I'm in my 20's and all of my coworkers are in their 40's or older. \\n\\nThe company I work for is about the 20th largest in the U.S. and my job is in a technical field.\\n\\nWhy when I worked for my other companies were there a lot more people in their 20's and 30's? The other companies I've worked for were both less than a 10th of the size of my current company if that matters.\"", "title": "I'm confused at work because all of my coworkers are 20+ years older than me. Why is that?", "upvote_ratio": 0.85, "url": "https://www.reddit.com/r/careeradvice/comments/13ev6bs/im_confused_at_work_because_all_of_my_coworkers/"}, {"author": "Blair_Bubbles", "created_utc": 1686689797.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 526, "post_id": "148pf5i", "score": 644, "subreddit": "careeradvice", "text": "\"Ive been a designer for 11 years, her for 4. I have been with my company 6 years and I am making 55k. My co worker who was just hired had a paystub question and I genuinely didn't want to look at her pay and I saw it. She's making 75k for the same job and only being here three week. \\n\\n\\nComparing apples to apples my portfolio and resume is genuinely stronger than hers so this isn't a skills issue. I also know seven Adobe programs along with photo and video shooting and editing. I do animation as well. I've done designs for major companies across the usa, hers have been mom and pop type stores (I'm not dragging on her everyone starts somewhere and she's talented!!) \\n\\n\\nMy heart is still racing knowing this. I kept a poker face around her but I went home crying. \\n\\n\\nWhat should my next steps be? I genuinely enjoy my job so so much and I don't want to leave but I feel absolutely gut punched. I wanted to move up through the company but knowing I'm being paid 20k less for the same job I feel punched in the gut.\\n\\n\\nEdit : thank you to all who have replied!!! I feel a lot better and I'm glad I went home to simmer instead of breaking down my manager's door and saying something I regret (joking!). I have a lot more ideas on how to approach this issue and why this situation may have occurred in the first place :)\"", "title": "Co worker is being paid 20k more than me", "upvote_ratio": 0.94, "url": "https://www.reddit.com/r/careeradvice/comments/148pf5i/co_worker_is_being_paid_20k_more_than_me/"}, {"author": "BadFriend1234567", "created_utc": 1683892167.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 520, "post_id": "13fiw1e", "score": 643, "subreddit": "careeradvice", "text": "\"The TLDR of the situation (I go into more detail on another post) is I am a bank teller at a small bank. I accidentally gave out $1000 to a customer, who despite evidence pinpointing her to having it, denied having it. There was an investigation internally, and a few days ago I was given a final warning.\\n\\nPrior to the meeting I had gone and shotgun applied to different positions in a panic just in case I was fired I would have my hand in the door already. One company interviewed me, and yesterday offered me the job.\\n\\nMy job:\\n$20 an hour\\nBanking\\n20 minute commute \\n15 vacation days, no sick days\\n401k with 5% matching\\nHealth, vision, dental, mental health coverage\\n8 hours with every other Saturday, all Sundays off + Federal Holidays Off\\n\\nThis Job:\\n$22 an hour\\nCustomer Service Line for Casino\\n45 minute commute\\n32 Vacation says, 5 sick days\\n401k (no matching)\\nHealth, Vision, dental paid for by company does not come out of my pocket.\\nGarenteed 2 days off during the week, + 4 in a row at the end of the month. Work Federal Holidays but paid DOUBLE on them.\\n\\nThe commute is what bothers me, when I applied for positions usually I try to stay within 30 minutes, but I got so scared I applied outside my radios. I didn't think I would actually get this job, be cause so many people applied for it. I would have to travel a major highway back and forth, and I don't know if I would be ok with that, especially since I don't think the extra 2 dollars would cover increased gas and vehicle expenditure.\\n\\nI also wanted to stay in banking but I fear I may be fired if I make one more mistake. I'm scared. I've always been in the customer service industry, so I think it would be ok? Mostly I am looking towards survival. I don't think they would fire me out of the blue but I know until the next year, I have a huge difference that one more mistake could put me over the threshold of acceptable differences. \\n\\n I love the benefits, and I get 10 weeks training! \\n\\nPlease, I need advice, I talk to the guy tommorow to give him my answer. Any help is appreciated? Should I take it?\\n\\nEdit: It is not an actual casino. I just said that so that way it would be less obvious with the job was. Is an online betting casino like app for sports, would be the online help basically.\\n\\nEdit 2: people seem to think that I'm on a PIP. Have confirmed with my manager that I am not. She didn't even know what it was when I mentioned it to her. The only thing that she said was if I make another huge difference over $300 I would be fired automatically. No pips or anything like that and me and her came up with a strategy that wouldn't happen again. \\n\\nAlso want to mention that I haven't given up on actually taking the job. I'm just extremely nervous. I told the guy that I would talk to him on Thursday because that's the only time that he would have. I wanted to do Monday. There is another job that I'm looking at in fraud that I am incredibly interested in, so I'm hoping to hear back from that. But if by Thursday I don't I will take the job.\"", "title": "I Fucked Up At my Job and Given a Last Warning. Interviewed with Another Company Who Wants to Hire me. Should I Take It?", "upvote_ratio": 0.92, "url": "https://www.reddit.com/r/careeradvice/comments/13fiw1e/i_fucked_up_at_my_job_and_given_a_last_warning/"}, {"author": "None", "created_utc": 1703992784.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 594, "post_id": "18uxzva", "score": 644, "subreddit": "careeradvice", "text": "\"\"", "title": "When getting laid off abruptly, what sentence can you say to live rent free in your boss/employer's head?", "upvote_ratio": 0.9, "url": "https://www.reddit.com/r/careeradvice/comments/18uxzva/when_getting_laid_off_abruptly_what_sentence_can/"}, {"author": "pumper911", "created_utc": 1680701310.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 324, "post_id": "12cke6a", "score": 639, "subreddit": "careeradvice", "text": "\"In the past, I never placed emphasis on cover letters. However, I'm hiring right now and I've been flooded with applications because of how crazy the job market is.\\n\\n90% of applications I received aren't relevant to the role. There were a handful that, on paper, didn't seem relevant to the role either but they included a cover letter and specifically highlighted parts of their day to day that were in line with what we're looking for and also went into detail about why they're interested in the role. Without the cover letter, they wouldn't have made it to the interview stage.\\n\\nJust my opinion, but some advice based on how I'm moving candidates to interview stage:\\n\\n* Make sure your resume for your most recent job includes bullets that line up with the day to day responsibility and requirements in the job description.\\n* If you feel like your resume isn't screaming \\\"I'm a great fit for this role\\\", include a cover letter. Make sure to talk about your experience and how you're doing what the role requires, but also include a blurb on why you're interested in the role.\\n* If a resume is great and checks off most of the boxes, a cover letter isn't necessary, but it doesn't hurt to include one\\n* Reach out to the hiring manager on LinkedIn. I feel more inclined to respond directly to a message on LinkedIn and it's also a great way to show your interest in the role. A candidate is now moving onto the 3rd and final interview because she did this (based on her resume, she probably wouldn't have received an interview at all).\\n* With the above, just remember that hiring managers and recruiters are receiving hundreds, if not thousands, of applications, so this is just advice on increasing your odds in moving to the next round of interviews.\"", "title": "As a hiring manager in this crazy job market, I recommend you include a cover letter (and some other advice included)", "upvote_ratio": 0.81, "url": "https://www.reddit.com/r/careeradvice/comments/12cke6a/as_a_hiring_manager_in_this_crazy_job_market_i/"}, {"author": "J0hntheSavage", "created_utc": 1689429797.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 546, "post_id": "150cvgd", "score": 622, "subreddit": "careeradvice", "text": "\"I always hear of these boring jobs/careers that are relatively low effort and stress but pay over 6 figures. I make right at 6 figures but I'm pulling my hair out due to the stress and anxiety due to workload and constant \\\"surprises\\\"... looking to change direction, but what are these careers?\"", "title": "Do you have a boring job but it pays over 6 figures? What is it you do and what's your title?", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/careeradvice/comments/150cvgd/do_you_have_a_boring_job_but_it_pays_over_6/"}, {"author": "toffeepudding1", "created_utc": 1686858712.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 630, "post_id": "14abjlq", "score": 620, "subreddit": "careeradvice", "text": "\"I\\u2019m 24 years old and recently got fired from my job as a nurse in an outpatient surgical setting. I\\u2019m devastated and don\\u2019t know how to tell my parents about it and the guy I\\u2019m seeing about it. \\n\\nI have been seeing this guy exclusively for a about 2 months now and might pursue a relationship with him. He likes me because he thinks I\\u2019m attractive, have a good heart and personality, and have my sh*t together, but unfortunately I got fired from nursing job and I don\\u2019t want him to think I\\u2019m a loser and that it could be a deal breaker for a relationship. I don\\u2019t feel comfortable sharing about how I got fired from my job to him.\\n\\nAs for my parents, my parents are traditional and very strict. I still live at home do help supplement the bills for my parents sometimes. My parents are the type to talk sh*t about me behind my back while they\\u2019re in their room or whenever they feel like it when I\\u2019m not presently in the room with them but just in the house in another room and they will hold this failure against me for my entire life so I\\u2019m really scared to tell them. I feel like a pathetic loser, worthless and helpless.\"", "title": "How to tell parents and guy I’m seeing that I got fired from my nursing job?", "upvote_ratio": 0.86, "url": "https://www.reddit.com/r/careeradvice/comments/14abjlq/how_to_tell_parents_and_guy_im_seeing_that_i_got/"}, {"author": "phobia78", "created_utc": 1706465386.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 570, "post_id": "1ad8v73", "score": 617, "subreddit": "careeradvice", "text": "\"i\\u2019ve had a 9-5 job since the end of last august. i enjoyed it at first, it was a new environment, new people, id never done it before so my brain and body were not used to the cycle, it was too preoccupied with experiencing all these new things. \\n\\nalmost 6 months later, i feel as if it\\u2019s literally killing me. i\\u2019m always so tired and miserable. i come home, maybe play video games or listen to music for a few hours and then go to sleep or doomscroll. it\\u2019s been that way for 5 months, and will continue to be this way for at least 4 more years because of a contract. \\n\\ni\\u2019ve tried to change things. i\\u2019ve started working out or reading when i get home, but it hasn\\u2019t changed the way i feel. i feel like i\\u2019m stuck in an endless cycle that i can\\u2019t escape from. i feel so lost, i don\\u2019t know what to do. \\n\\ni thought it was be easy to just sit in an office all day and type shit on a computer. it\\u2019s not physically or mentally difficult, so why is it so hard?\\n\\none of my coworkers is the complete opposite of me. he\\u2019s motivated, wants to be rich, have tons of cars, live in a big house, etc. he does lots of research in certain fields that he\\u2019d like to change to in his free time at work. i\\u2019ve tried doing the same, but i just don\\u2019t have the energy.\\n\\nbut when i do have the energy, i just stop halfway through and think to myself, \\u201cwhat\\u2019s the point of doing all this work and creating all this stress for myself to help create someone else\\u2019s dream?\\u201d it makes me feel like a cuck. \\n\\ni\\u2019m starting to think this job, or any job in general, just isn\\u2019t fit for me. i think that my brain is just broken and isn\\u2019t wired to cope with work. \\n\\ndoes anyone else feel this way? what do i do?\"", "title": "Are some people just not cut out to work 9-5?", "upvote_ratio": 0.91, "url": "https://www.reddit.com/r/careeradvice/comments/1ad8v73/are_some_people_just_not_cut_out_to_work_95/"}, {"author": "Professional-Song526", "created_utc": 1683128262.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 280, "post_id": "136qsr8", "score": 603, "subreddit": "careeradvice", "text": "\"I\\u2019m graduating college in two weeks, and back in November I secured a great job with a reputable company. However, I just got word that my start date is not until January 2024. I\\u2019d been applying for temp jobs to fill the gap between my graduation and my start date (which I thought would be early Fall), but now I\\u2019m considering applying for full-time, permanent roles.\\n\\nI\\u2019m having a hard time with the idea of withholding vital information from organizations: \\u201cI\\u2019m going to quit early next year.\\u201d Lots of friends have told me that I\\u2019m just a number to a company, and that there is no shame in misleading them, but I\\u2019m having a hard time with that. Should I look for full-time, permanent jobs without disclosing that I\\u2019ve already accepted an offer with another company?\"", "title": "Ethics of applying to a Job that I am going to leave", "upvote_ratio": 0.94, "url": "https://www.reddit.com/r/careeradvice/comments/136qsr8/ethics_of_applying_to_a_job_that_i_am_going_to/"}, {"author": "PierceCL99", "created_utc": 1681653951.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 286, "post_id": "12o9it2", "score": 600, "subreddit": "careeradvice", "text": "\"Based off the header, seems like the answer is an obvious yes, but I am early in my career. I graduated less than a year ago and got this sales job in February. I had been applying for months before that and had no luck finding a job. It\\u2019s one of the top workplaces in the US but I\\u2019m getting tired of working there, having to work 50 hours a week including working on Saturdays. \\n\\nSalary increase would be from $40k to $55k\\n\\nThe new job is a claims analyst position for a large insurance company and has slightly fewer hours (45/wk) and has a hybrid schedule allowing me to work from home 2 days a week and has significantly more PTO and paid holidays. \\n\\nNeither job is really what I want to do with my career but the new job has a lot more growth opportunities whereas the first job has zero growth opportunities, just commission growth. The main concern I have is leaving my first job too quickly after being hired. Is that a valid concern? Thoughts on this?\"", "title": "Should I take a job paying $15k more?", "upvote_ratio": 0.91, "url": "https://www.reddit.com/r/careeradvice/comments/12o9it2/should_i_take_a_job_paying_15k_more/"}, {"author": "LBAIGL", "created_utc": 1611179235.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 49, "post_id": "l1jen3", "score": 592, "subreddit": "careeradvice", "text": "\"Hello all,\\n\\nI wanted to give some tidbits of advice that I have learned about over the years. I've spent 20+ years in a variety of industries, and have learned the following:\\n\\n1. No matter how stuck you may feel at your current job, there is ALWAYS a light at the end of the tunnel\\n2. Always ask the hard questions in a job interview (how much you expect to make, training period, what is the culture like, why has  this position opened up). Remember, you are interviewing that company just as much as they are interviewing you.\\n3. Don't like your job? Instead of complaining, DO something. Work on your resume. Send out 1-2 applications a night. Look at the many free resources online for a new skill. You are the only person responsible for where you're at in life and you have the power to change it\\n4. Applying to jobs is time consuming. It is difficult. It can be demotivating. Allow yourself to feel those negative feelings about that process, but keep going! The right opportunity will present itself\\n5. Be professional and polite to everyone, even if they're the biggest jerk. Why? You could be standing next to the person who will open some of the biggest doors you'll ever walk through\\n6. Learn to recognize the signs of burnout or increased stress within yourself. It may be time to start looking for a new job when you start to dread waking up in the morning, or are having panic attacks\\n7. At each job you have, learn to recognize where you excel and where you need to improve. Any employer no matter what industry will highly value someone who can self-evaluate their own capabilities\\n8. Learn to say **I do not know how to do that, but I can learn or research it**. Why? No one knows everything and the worst thing you can do is put yourself in boiling water due to overestimating  or lying your abilities or skills\\n9. Do not live for your job. Your job is there to support the lifestyle you want to create for yourself; it should not be the center of your universe; it may not be there tomorrow\\n10. You work 30 or more hours a week at your job; make sure it is one that you feel proud of\"", "title": "Tips from someone with 20+ years in various industries", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/careeradvice/comments/l1jen3/tips_from_someone_with_20_years_in_various/"}, {"author": "Aggressive-Scene2940", "created_utc": 1684698205.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 616, "post_id": "13o4a6h", "score": 584, "subreddit": "careeradvice", "text": "\"Hi everyone! Seeking advice on how to handle this situation.\\n\\nI received an offer letter about 2 weeks ago and accepted two days later. Start date is tomorrow. This past week received a called from HR on Tuesday about the drug test and went in Friday for it.\\n\\nThis is honestly my first \\u201cbig girl job\\u201d so I\\u2019ve never had to undergo a drug screening so please spare me the weed isn\\u2019t worth ruining your future career. I know that now (I\\u2019m in Texas). I honestly did not anticipate failing or a drug test.\\n\\nI dabbled on and off with weed for a bit over the course of a few months (mixture of thc pens\\u2014the legal delta 8 ones sold at vape shops so maybe that\\u2019s it?) but last smoked April 13th. Not sure how it\\u2019s still in my system because I\\u2019ve read dozens of threads of people passing after a few days or weeks.\\n\\nMy question is this: when I go in Monday morning should I take the moral high road and approach HR first explaining the situation or wait until they receive the confirmation results? The place said it could take 2-3 days so they should receive it Monday or Tuesday. A part of me hopes it\\u2019s a fluke since the woman looked confused looking at the lines for marijuana but went to another woman who was like no no that\\u2019s definitely positive, but I also did an at home test and failed that. It was odd to me though because they handed me the papers.\\n\\nI just don\\u2019t want to waste my time or theirs because I\\u2019m supposed to start training and am getting there early to start preemployment paperwork. Should I offer to comply with random drug testing throughout my employment, especially during my probationary period? Or start and wait for the confirmation results even though I have the results? They really like me and I like them too. Just seeking advice on how to approach this. Just an overall odd situation since I\\u2019m starting without them not having the official results.\\n\\nEdit after reading comments because I\\u2019m an idiot: I guess I haven\\u2019t officially failed\\u2014the results I received upon leaving said confirm for \\u201cmarijuana/thc\\u201d \\u2014 can\\u2019t change title\"", "title": "Failed Drug Test and Start Job Tomorrow", "upvote_ratio": 0.88, "url": "https://www.reddit.com/r/careeradvice/comments/13o4a6h/failed_drug_test_and_start_job_tomorrow/"}, {"author": "MeatTornadoGold", "created_utc": 1675900662.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 337, "post_id": "10xf8kl", "score": 580, "subreddit": "careeradvice", "text": "\"Been with the place for 3 years and for the first 2ish years, i thought I found my forever place. We had a meeting today and at the end of it, they mention that despite a lot of other measures, they're going to have to make a small number of staff cuts, and it turns out that after asking my boss, I was one of the people they were letting go. It's really frustrating. I was great at my job. The first year I had a 10% raise and the second year I dealt with a lot of the extra work that I did to finance and beyond my job description.  But they gave me a standard raise because of financials and now I'm being let go. I'm absolutely devastated. \\n\\nI don't even know where to begin besides updating my resume. I'm so gutted.\"", "title": "Just found out I'm being let go from my job today. What the fuck do i do?", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/careeradvice/comments/10xf8kl/just_found_out_im_being_let_go_from_my_job_today/"}, {"author": "captainstinkypenis", "created_utc": 1690825096.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 419, "post_id": "15emn96", "score": 583, "subreddit": "careeradvice", "text": "\"I've applied to roughly 50 jobs in the past two months and would estimate that of those 50, maybe 7 actually responded with a rejection email.\\n\\nI did manage to land one interview, and was ghosted after that as well.\\n\\nI was laid off from a job I worked at for 2 years in May, so I haven't been on the hunt for work since 2021. I don't remember it being like this back then. Usually you would at least get an automated rejection email.\\n\\nDo companies just not even bother to tell you that they've moved on to other candidates anymore?  \\n\\n\\nEdit: Wanted to note that I've had my resume reviewed by several people already and nobody has noted anything egregious.\\n\\nEdit 2.0: Holy crap, was not expecting this to blow up so much. Thanks for the tips, everyone! Looks like I've got a resume to rewrite (again).\"", "title": "Why am I not receiving ANY response after I apply for a job?", "upvote_ratio": 0.94, "url": "https://www.reddit.com/r/careeradvice/comments/15emn96/why_am_i_not_receiving_any_response_after_i_apply/"}, {"author": "gymboy89", "created_utc": 1691398396.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 641, "post_id": "15kf065", "score": 572, "subreddit": "careeradvice", "text": "\"I'm very certain the role I'm currently doing is zapping the life out of me. I transitioned into a new industry and have ended up doing something I don't care about. I've been tantalisingly close to getting other roles but still not been able to secure anything.\\n\\nI'm now considering just handing in my notice (3 month notice period) hoping that this actually gives me the challenge to find something I'm better suited to\"", "title": "Did you ever quit your job with no new job to go to?", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/careeradvice/comments/15kf065/did_you_ever_quit_your_job_with_no_new_job_to_go/"}, {"author": "Chiaseedmess", "created_utc": 1690226418.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 247, "post_id": "158k5oe", "score": 566, "subreddit": "careeradvice", "text": "\"To preface this, I work at a small company. I started here as an intern when they were a startup and were expanding. They hired me right out of college. There's about 20 people here now. I make about market rate for my job, the benifits are cheap with good coverage, and I enjoy the work I do and the people I work with. \\n\\nLast week, a rather large global company reached out to me out of no where and talked to me on the hone for over an hour. I never applied there, so I don't know how they heard about me or got my info. During the call, they passed me around to a few people in the department, then asked me to come in the next day for an interview. It went well, their global campus just so happens to be about 10 minutes from my home. It's over the top beautiful, 300 acres, gyms, gardens, food, etc. It's the nicest workplace I've ever been to. \\n\\nToday, they made an offer. $20k more than I make now. Good healthcare coverage, but a slightly higher price. \\n\\nSo, how should I handle this? Do I tell my current employer about the offer and ask them to do better? Or, should I jump ship and start at this huge new place?\"", "title": "A large company blindly reached out for an interview and offered me a job for $20k more than my current role. Do I take it, or tell my current employer and see if they can beat it?", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/careeradvice/comments/158k5oe/a_large_company_blindly_reached_out_for_an/"}, {"author": "None", "created_utc": 1679491067.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 64, "post_id": "11yivrz", "score": 563, "subreddit": "careeradvice", "text": "\"Ok\\n\\nSo like many people I have been having issues getting interviews. I apply to a lot of jobs and haven't been getting responses.\\n\\nSo I thought about my problem, my problem is people in the position to make a decision on if they are going interview me or not...are deciding not to interview me...pretty straight forward. So how do I fix that?\\n\\nI thought of hiring a resume writing service...but I've done in the past and it was crap.\\n\\nSo, I then took a lesson I learned from my sales days...people like to help people. Espesically if it doesn't cost them anything significant. Think about the last time you helped someone, did it make you feel good? Yea same concept.\\n\\nSo I joined a community in my choosen career field, and I networked I asked around and I figured out which users where recruiters/hiring managers/HR/etc\\n\\nI then reached out to those people and told them my problem \\\"100+ job applications, not a lot of results, can you look at my resume and tell me what I'm doing wrong\\\"\\n\\nUnfortunately a few of them I feel where being far too polite...but then I found an asshole...he looked at my resume and his response was \\\"I'm going sound like a dick, but I mean the best\\\" and I smiled and told him to rip away.\\n\\nHe tore my resume apart from top to bottom, he was harsh, he was direct and I completely rewrote my ENTIRE resume. I completely changed almost everything. Some of his advice was really good, like he said \\\"Your really good at XYZ but can you do X?\\\" I go \\\"no not that good\\\" and he said \\\"ok then change it from really good to decent\\\" \\n\\nThen I sent it back to him and he said it was way better and he'd actually read my resume instead of deleting it. \\n\\nThat was a week ago, got several interviews out of this resume already.\\n\\nAnd that same guy that just had me rewrite my resume also messaged me with a link and said \\\"We just opened this position, based upon your resume I think your a good fit go ahead and apply...no promises\\\"\"", "title": "Found a way to get my resume fine-tuned without spending a penny, it takes work here's how", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/careeradvice/comments/11yivrz/found_a_way_to_get_my_resume_finetuned_without/"}, {"author": "GordonRammstein", "created_utc": 1683311656.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 437, "post_id": "138xawd", "score": 560, "subreddit": "careeradvice", "text": "\"I've been loving my current job for the last year and a half. Started as an intern making $30k and quickly moved up to one of the top operators of my facility and am making $87k. I wasnt looking to leave really, but I got an offer for a government run facility doing similar work for $80k. The gov position offers CalPERS healthcare, pension, a 457 retirement plan, better holiday and overtime rates(2.5x hourly instead of 1.8xhourly).\\n\\nIt's a little bit of a step down pay-wise, but they have a set pay scale that increases regularly, both performance based and COL increases to match inflation rate. I'm also being hired as a \\\"Grade 1\\\", even though I'm Grade 3 certified. To me, that's a perk as I have a lot more potential growth down the road and don't have the same pressure to know how everything works right off the bat if I were hired in a Grade 3 position. Even though it's an initial $7k pay cut, it's a similar pay rate to my current pay, but at the bottom, which means it could/should be even higher once I'm up to speed. They also have an \\\"employee association\\\", which im not too familiar with, but from what I hear it's a very mild headache with the perk of having more job security, whereas the private company can fire you at any time(not that they would).\\n\\n&#x200B;\\n\\nNow, I gave my notice last week and ever since, my current job has been hitting me with counter offers to sweeten the pot. First offer was $106k for a transfer to another facility, which I turned down due to an awful commute. Latest offer is basically $100k on the dot($48.08 hourly) to stay in my current position with a promotion to grade 3 in the near future, which would bring me into the ballpark of $115k. Current job likes me, wants to keep me, and has big plans for my future. BUT, the benefits are not flexible in any way. They can't offer the same healthcare, they have a standard 401k with a 2% match plus $0.25 for every dollar above that. On the plus side, they're making waves in the industry and are expanding fast into new areas, which could mean better pay and benefits further down the line(just speculating at this point). \\n\\n&#x200B;\\n\\nUltimately, the tradeoff seems to be:\\n\\na) slightly less money now, but better benefits/retirement and comparable pay in the 6 figure range later down the line\\n\\n&#x200B;\\n\\nor\\n\\n&#x200B;\\n\\nb) 6 figures now and probably a higher salary cap, but slightly worse in terms of benefits and job security.\\n\\n&#x200B;\\n\\nI'm still young and have a long career ahead of me. I'm trying to potentially find a \\\"forever\\\" facility that could take me to an early retirement. The private company offering more money means I could have more personal savings to do with what I please, but the government option means I'm guaranteed a pension for life. Both options have their ups and downs in different areas and it's killing me to make a decision lol. I should also note that since the ball is already rolling on accepting at the new  place, I need to make a final decision quick, and if I do back out and stay where I am, I'll likely burn that bridge(although there are other gov options nearby)\"", "title": "New job for $80k and government benefits, vs current job counteroffering for $100k, what to do?!", "upvote_ratio": 0.92, "url": "https://www.reddit.com/r/careeradvice/comments/138xawd/new_job_for_80k_and_government_benefits_vs/"}, {"author": "Zayercain", "created_utc": 1683452432.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 673, "post_id": "13aiwwl", "score": 564, "subreddit": "careeradvice", "text": "\"You know they say choose a career where there\\u2019s demand but less supply. So what are some careers/fields which ppl often overlook while looking for career options. Rarely chosen but good, High paying, prosperous future career.\"", "title": "What fields are in demand now?", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/careeradvice/comments/13aiwwl/what_fields_are_in_demand_now/"}, {"author": "Rabbit04201996", "created_utc": 1688659923.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 567, "post_id": "14sdshj", "score": 558, "subreddit": "careeradvice", "text": "\"I'm the only income of our household, P+C insurance agent, about $63,000 salary. However, its draining me with no end in sight. My husband  has offered to switch roles, they work and I stay home with our kiddo. They don't have a degree, have been out of work for almost 2 years, and no clear career in mind. He would need around $25 a hour at a normal 40 hr job to keep our heads above water financially. Is this realistic? If not what could he do in a shortish timeframe to make it possible?\"", "title": "What is typically required to start a job at $30 an hour?", "upvote_ratio": 0.89, "url": "https://www.reddit.com/r/careeradvice/comments/14sdshj/what_is_typically_required_to_start_a_job_at_30/"}, {"author": "Due-Excitement-6814", "created_utc": 1693124998.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 292, "post_id": "162krzo", "score": 559, "subreddit": "careeradvice", "text": "\"My job is tough. It's so undesirable that despite $23-29 an hour with weekly direct deposits, no one wants it.\\n\\nBetween being under pressure for 8 hours every day, constantly being denied time off because \\\"they don't have anyone to cover\\\", sometimes not being able to take a break or use the restroom to the point I developed a UTI, getting home at 12am or even later and not being able to fall asleep because I'm so revved up, and toxic coworkers/managers who yell at you, call you names, play mind games and abandon you in stressful situations... I've had it. \\n\\nIt has taken a serious toll on my mental and physical health. The only two people who have stayed 10+ years --- one just had a stroke and the other one is developing heart problems from 'overworking her heart', according to the doctor. \\n\\nWhen I was new to the company and realized the time/energy requirement, I put off my last semester of school (Associate program) to prioritize this job. It was not the first time I did that. I started the program when I was 21 and I'm 26. I recently decided to finish school. I was going to quit and work as a waitress, get my Associate, then take out loans to become an Ultrasound tech. I just found out I'm not eligible to have the last few classes paid for by FAFSA because I took too long to get my degree. It's 2k+.\\n\\nI don't have a degree. I don't have a car. I have 5k in a checking account but 3,000 left of medical debt. I paid most of it (around 10k) over the last year so I've been thinking I should just push through the job for 6 more months to pay off medical and strengthen my savings. My pay is also based on the season so all summer I was making close to $23 and it's just gone back up to $27-29 (another reason to stay).\\n\\nI was an A student, I have a 702 credit score and a glowing recommendation from one of the good managers at my current place of employment. I work in hospitality, for the most prestigious hotel in my state. My position is somewhat of a receptionist on steroids, and I'm very good at it. I've received multiple awards and I've been there 10 months. Managers have asked me to get into management but I fear it will be more hell. Before this, I sold furniture in a store (2.5 years, commission only).\\n\\n I know I have potential but I'm lost. I feel like I've messed up so badly that there is no coming back. There is no one who can help me while I try to dig myself out of this, no family home, no free rent. It's up to me. I'm willing to do whatever it takes but I have no idea what that is.\\n\\nEdit: I'm overwhelmed by the amount of people that took the time to give me advice. Thank you. I am processing all of this.\"", "title": "Can I un-fuck my life?", "upvote_ratio": 0.93, "url": "https://www.reddit.com/r/careeradvice/comments/162krzo/can_i_unfuck_my_life/"}, {"author": "None", "created_utc": 1690895724.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 233, "post_id": "15fcbel", "score": 542, "subreddit": "careeradvice", "text": "\"Hey, guys. I started a new job in HR a few months ago. Our director is doing 1 on 1's and wants to talk to me about what I'm doing to advance my knowledge such as trainings or reading books, and about my career development at the company. Only thing is...I don't really want to develop my career. I've been down that path before of the whole hustle and grind, and I'm no longer interested. I just want to do my job and go home, and that's it. The people above me all work overtime and have a poor work-life balance, so I don't want to be promoted.\\n\\nSo is there a professional way of saying what I did above? I don't just want to lie and then end up getting more work and assignments.\"", "title": "What is a professional way to say I don't want to grow my career?", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/careeradvice/comments/15fcbel/what_is_a_professional_way_to_say_i_dont_want_to/"}, {"author": "Ben5544477", "created_utc": 1691779807.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 566, "post_id": "15oh69z", "score": 545, "subreddit": "careeradvice", "text": "\"Say you work at a job and your manager truly is a bad manager and did things during your employment that were bad. Then HR wants you to do an exit interview and tell them why you're leaving. In the exit interview would you mention how it's because of your manager? Or would  you lie and mention a reason that's vague and wouldn't  blame anyone?\\n\\nWould it depend mostly on the kind of bad things your manager was doing?\"", "title": "If you truly left a job mostly because of your manager and in an exit interview HR wanted to know why you're leaving, would you mention how it's because of you're manager?", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/careeradvice/comments/15oh69z/if_you_truly_left_a_job_mostly_because_of_your/"}, {"author": "FewAbbreviations5783", "created_utc": 1691632847.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 224, "post_id": "15myuv2", "score": 542, "subreddit": "careeradvice", "text": "\"Long story short, I have known her for 15 years, and through me she was able to get a job at the company I work for. I will leave the company in 2 months and believe my relationship with her might improve afterward, but now I feel emotionally drained, and I have a strong repulsion feeling towards her. It is weird, but I am always nice in her presence even though I do not want her around me. At work, I became her emotional dumpster, and she is extremely negative, always complaining about someone and being the victim.\\n\\nThe issue is that now I am super busy at work, and I already told her many times that she should not stop by to talk to me. PERIOD. I say it nicely, but she still does it. Yesterday, a senior was rude to her as he wanted to speak with me while she was at my desk talking. Today she waited for him to be at closed doors to come to my desk. She still stopped to talk to me 3 times, and every time she did it, she interrupts something important that I am doing. She also mentioned today that she is emotionally dependent on me, and I feel suffocated. My feelings about her are mixed and I just want to go to work and finish what I have to do without being interrupted. I do not want her to stop talking to me completely, but I want her invasive behavior to cease. How do I say it in a way that she can understand when I had said it so many times already and she does not seem to get it? Or she does understand but she does not care (?).\\n\\n&#x200B;\\n\\nEDIT:\\n\\nWOW. Thank you, guys, for all your comments on this, I was not expecting so many responses. Today I made two signs \\\"PLEASE DO NOT DISTURB\\\" and put them on each side of my desk. She did not speak to me, not even good morning. Other people made fun of my signs because they kind of knew to whom they were directed, and they liked them. Other people were also annoyed about this situation because they were distracted by the constant chit-chatting. I felt bad doing it, but I had a WONDERFUL day at work today with A LOT OF work done. \\n\\n&#x200B;\"", "title": "Burned out at a friend at work, how to tell her to really stop coming to my desk to talk about her life?", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/careeradvice/comments/15myuv2/burned_out_at_a_friend_at_work_how_to_tell_her_to/"}, {"author": "Dariel2711", "created_utc": 1681716413.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 361, "post_id": "12p6klo", "score": 544, "subreddit": "careeradvice", "text": "\"I'm struggling and looking for some neutral advice.  I am 43, no college degree, and after finding what I thought was a great career for me, interest rates went up, market went down, and the job/career was no longer a viable option in February.  Cue some depression as I finally thought I had things figured out and wasted a year training at 40k, a significant salary reduction for me.\\n\\nNow to the issue.  I've applied a lot, but companies are slow to hire.  I applied for a county job in a field I was interested in, knowing the pay range.  After about 7 weeks, I finally got the offer....at $19.25/hr.  Great benefits as it's a government job and a pension for the future.  I accepted the job as I had no other offers and figure I'm a hard worker, I can move up and the pension will be nice. Start date is tomorrow. \\n\\nLast week, I had an interview for a job with a large insurance company.  I did it for practice and because $19.25/hr...at 43 with a strong resume. Starting salary for this role was $50K.  I then met with HR who informed me if selected, it will actually start at $59k with a $2k sign on bonus, and a bonus every year that could be from 3-8k approximately. It's a big enough company that benefits are OK, and while no pension, very generous 401k match increasing yearly.  \\n\\nI expect an offer for the other job in the next day or two.  Both jobs are 75% work from home, the county job has a little more flexibility with hours. I know long term, my options with the County will be plentiful, but at 43, long term is not my only concern.  A 50% difference is pay plus bonuses just feels like I can't pass it up.  My wife also works and makes about 100k with bonuses, so it's not like we can't survive on the lower job,  it just means putting off things we've been wanting to do.   \\n\\nI would feel bad leaving a job 3 days into training abd likely would never be eligible for government roles again, but its just such a big difference in compensation.  Any thoughts? Am I horrible if I leave the job?\"", "title": "Can I quit a job after 3 days for a better one?", "upvote_ratio": 0.94, "url": "https://www.reddit.com/r/careeradvice/comments/12p6klo/can_i_quit_a_job_after_3_days_for_a_better_one/"}, {"author": "cartycinema", "created_utc": 1709124398.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 472, "post_id": "1b2592w", "score": 537, "subreddit": "careeradvice", "text": "\"I work for a very small video company. It\\u2019s me, my boss, and our accountant. It\\u2019s a very lonely environment. I sit at a desk on discord most days just so I have someone to talk to.\\n\\nI recently got a job offer at a bigger video company in a city that\\u2019s 90 mins away from me, but it\\u2019s a place I\\u2019m looking to move to by the end of this year. \\n\\nThey are going to let me do a hybrid situation \\u2014 do most of my work from home, go into the office for more hands on work. 90 mins commute. I told them I\\u2019d love to work with them.\\n\\nSo I put in my two weeks with  my boss, and he offered me a $7,000 raise to stay at the company\\u2026 which is more money than I\\u2019ve ever made before\\u2026 and it\\u2019s weekly pay. $45K to $52K.\\n\\nMy new job could only match my current pay (pre-raise), and has a MUCH better environment. It\\u2019s people my age and it\\u2019s not so isolating. But, it\\u2019s monthly pay. Yuck.\\n\\nI either take the better environment and lesser pay with greater flexibilty, or I keep this current \\u201cisolating\\u201d job and make more money?\\n\\nWhat do?\"", "title": "Boss offered a $7K raise after I put in my two weeks.", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/careeradvice/comments/1b2592w/boss_offered_a_7k_raise_after_i_put_in_my_two/"}, {"author": "Rismu", "created_utc": 1685985301.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 155, "post_id": "141le7i", "score": 539, "subreddit": "careeradvice", "text": "\"I submitted my resignation at my current job on 01June, because the standard in my country is to give 1 months notice. I am starting my new job in July and my boss is aware of this. She asked if I would consider a counteroffer and I was honest with her and said I wouldn't. Her boss also tried to persuade me not to leave but my resignation is still in effect.\\nMy issue is that she asked not to tell anyone that I work with that I resigned, and this worries me because I received a new project from one of our clients and I would have thought she would let them know asap so that they can make another plan. I am worried that this is going to damage my  reputation because she might imply to everyone that I left without giving proper notice. Any advice would be helpful!\"", "title": "Boss says I should not tell anyone that I resigned.", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/careeradvice/comments/141le7i/boss_says_i_should_not_tell_anyone_that_i_resigned/"}, {"author": "Expert-Ad2084", "created_utc": 1689258912.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 210, "post_id": "14ymjew", "score": 514, "subreddit": "careeradvice", "text": "\"Manger didn't do any 1:1 with me for the past year and half. \\n\\nManager didn't give me recognition in the team for work I did to other teams while always pushing and promoting the other team members. \\n\\nManager says now I will start to see your work, as if I haven't worked for the past year. \\n\\nManager says that those team members OWNED a certain project so thats why they got promoted.  while I was the one who build the whole framework for them to operate on and all the creative work that came from our team on this topic was me! She said creative work is different than execution...\\n\\nManager said that those co-workers owned their own projects ( they kept taking my work and naming themselves on it) I didn't even have any chance to own any project except for one where they were on leave and I did great in it. \\n\\nI am senior and today she asks me if I am senior or not! She was about to introduce me as general employee.  \\n\\nShe said we will start marketing you! As she was only marketing the others and I heared from someone higher that she doesn't mention my name in anything.\\n\\n\\nShe is like we will wait till JAN till we promote you and I will watch your progress ( like nothing I done was enough and I really don't want to proof my self to anyone who sees me like that)\\n\\n\\nAfter this call. I am thinking of quitting my job in the next few days.. it's not about promotion it's about being treated unfairly and all the work I did being unrecognized. Let me know your opinion on the comments above\\n\\n----------------\\n----------------\\n.\\n.\\n\\nUPDATE: first of all thank you so much for all the comments ( negative and positive) I really appreciate it. \\n\\nI haven't quit my job yet as I am planning my way out soon. \\n\\nThe funny thing happened today is I just found out that I wasn't included in a request that asked to gather data of the \\\"owned project they got promoted for\\\"  to promote it for an  AWARD in our industry in  which I actually was the one responsible for that part  from our team and actually I have  countless email proofs sending to client the reports on it. They assigned it to the ones who just got promoted. I actually BCC'd the bigger boss and forwarded the work and emails that I had with the client  client that I sent regarding this topic saying I can help since i worked on it the most and please add Me and introduce me to the email chain that is working on submitting this work for awards. \\n\\n\\nWhat she did was copying the email text that I am not included in and paste the text saying this is their request let's talk about on Monday (  ignored to introduce me!!) \\n\\nIt's so fucking rude!\"", "title": "Everyone in my team being promoted to my level and no promotion for me , why??", "upvote_ratio": 0.92, "url": "https://www.reddit.com/r/careeradvice/comments/14ymjew/everyone_in_my_team_being_promoted_to_my_level/"}, {"author": "Upstairs-Course3026", "created_utc": 1689577910.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 170, "post_id": "151umhl", "score": 507, "subreddit": "careeradvice", "text": "\"My boss took us to what she called a mentor, and told us we could do some team building, meditating for an hour or so to help us gel as a team. We were all like sure, all of our jobs are extremely stressful and our boss puts a lot of pressure on us so we all were like what the hell. \\n\\nUpon arrival this guys was a Chakra loving spiritual, mindfulness can fix physical injury kind of guy. Personally, I don't believe in the Chakra thing or that if you think hard enough the slipped disc in your back will go away (yes he said that). But meditation and mindfulness does have its place. \\n\\n5 minutes in, he's asking about our mental health, whether or not we've been depressed what makes us depressed or anxious, keeping in mind this is INFRONT OF MY BOSS and my other colleagues and it made us all really uncomfortable. ESPECIALLY because my boss wasn't even contributing to the conversation. She sat in silence the whole time. It got really personal.\\n\\nIt kind of felt like she'd found a third party willing to grill us on our personal lives so she isn't liable in any way. Though I'm not even sure why she'd want to do that.\\n\\nIs this whole situation unprofessional? Or am I over reacting. She's going to ask us tomorrow if we want to go back and I'm struggling to come up with how to say no without offending her. She can be very defensive and judgemental at times and I know if I say it wrong she'll react badly.\\n\\nNot sure what to do.\"", "title": "Boss took my colleagues and I to her spirituality therapist... it went as well as you'd expect", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/careeradvice/comments/151umhl/boss_took_my_colleagues_and_i_to_her_spirituality/"}]