[{"author": "SometimeTaken", "created_utc": 1683823303.0, "link_flair_template_id": "682e2d40-78e2-11ea-b9b2-0e4e69ee6911", "link_flair_text": "Advice", "num_comments": 8325, "post_id": "13eslk9", "score": 10354, "subreddit": "careerguidance", "text": "\"Hi everyone, I have my bachelors and have graduate credits under my belt, yet I make less than 60K in a HCOL and I am being killed from the stress of my job. I continually stay til 7-8pm in the office and the stress and paycheck is killing me. \\n\\nFor context, I\\u2019m a learning and development specialist at a nonprofit. \\n\\nSo what\\u2019s the secret sauce, Reddit? Who has a six figure job whose related stress and responsibilities isn\\u2019t giving them a stomach ulcer? I can\\u2019t do this much longer. Thank you to everyone in advance for reading this.\\n\\n**ETA: oh my gosh, thank you all so much. Thank you for reading this, thank you for your replies, and thank you for taking the time out of your day to help me. It really means a lot to me. I\\u2019ve been in a very dark place with my career and stress, and you guys have given me a lot of hope (and even more options\\u2014 wow!). \\n\\nI\\u2019m going to do my best to read every comment, just currently tending to some life things at the moment. Again, thank you guys. I really appreciate it. The internet is cool sometimes!!**\"", "title": "Redditors who make +$100K and aren’t being killed by stressed, what do you do for a living?", "upvote_ratio": 0.89, "url": "https://www.reddit.com/r/careerguidance/comments/13eslk9/redditors_who_make_100k_and_arent_being_killed_by/"}, {"author": "Bripaticus", "created_utc": 1692498881.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 2082, "post_id": "15vz3un", "score": 9958, "subreddit": "careerguidance", "text": "\"Best job becomes toxic\\n\\nI have been working for the same company for over 8 years as a lead developer.  I loved my job and I really enjoy working with most of my coworkers.  I was directly and indirectly responsible for a lot of significant website development and streamlining various processes for them.  Overall, this was a role that I had enjoyed, despite having to commute a total of 3 hours each day.\\n\\nTwo years ago, my daughter required surgery and the following day I fell and broke my arm.  I was late for an important meeting the next day.  I was issued a written warning and placed on a probationary period.  That should have been enough of a warning to me, but I put it behind me.\\n\\nFast forward to a Thursday night a few months ago.  My wife suffered a major heart attack.  I took her to the hospital, where she was placed in a medically induced coma, connected to a ventilator and had a pump inserted into a major artery to help relieve the workload on her heart, and had an angioplasty performed with 2 stents inserted.  I called my boss that night and told him what was happening and I would not be back in to work for the foreseeable future. I sent our entire group an update on Sunday.  Her condition was still critical and she was still comatose in the icu.  She remained that way in the ICU for a solid week.\\n\\nI emailed them again later that week with another update.  After the 8th day of missed work (sick and vacation days were used), my boss calls me and tells me that we need to have a meeting with HR that afternoon.  I was placed on another probationary period and written up yet again.  He told me that there comes a time where I just have to decide what is more important, my job or my wife.  I was to come back in the office, 5 days per week or I would be fired.\\n\\nThe HR lady suggested that I take FMLA leave, which I did.  I have heard that the manager talks about how projects will move forward once I am back in the office.  I intend to use every last PTO day I have left, then I will return my development laptop and quit.\\n\\nIn the interim, I was contacted by a recruiting agent that told me of a job opportunity only minutes away from where I live.  I interviewed with them a couple of times and they offered me the job.  The new company was more than willing to wait a couple of months for my wife to get through the bulk of her medical appointments before I started working there.  I will start there in just over a week from now.\\n\\nAm I wrong to not extend the professional courtesy of a two week notice here?  I feel that my employer did not care about my situation, so why should I care about a notice?\\n\\nPS: My wife is recovering and doing very well thus far.  Her outlook is good!\"", "title": "Quitting after 8 years without notice. Am I wrong?", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/careerguidance/comments/15vz3un/quitting_after_8_years_without_notice_am_i_wrong/"}, {"author": "Ok_Knowledge6577", "created_utc": 1705310389.0, "link_flair_template_id": "6901c214-78e1-11ea-96dd-0ebad3a8edc3", "link_flair_text": "Coworkers", "num_comments": 2163, "post_id": "1974ngu", "score": 7980, "subreddit": "careerguidance", "text": "\"Recently started my first internship as a finance major... On my first day I went over to my manger's manager (a director at said firm) and introduced myself. He said something like \\\"you must be the new intern\\\" and I replied \\\"that's right and I am the best decision this organization has ever made\\\" (just what tom brady told the team owner before winning 6 super bowls) but instead of being impressed he just replied something like \\\"yeah... I can tell... anyway I need to take a call see you around\\\".\\n\\nLater that day I saw the HR Manager who hired me walk into his office, not sure if that's out of the ordinary. Also, the first year analyst came over to me and told me \\\"You're a legend mate, want to grab a coffee\\\"? Not sure why he talks like that, he's not even british.\\n\\nDid I screw up or did I make a good impression? I am really not sure how to read the situation.\"", "title": "Told my boss \"I am the best decision this organization has ever made\" on my first day as an intern, did I screw up?", "upvote_ratio": 0.88, "url": "https://www.reddit.com/r/careerguidance/comments/1974ngu/told_my_boss_i_am_the_best_decision_this/"}, {"author": "GarmeerGirl", "created_utc": 1690383737.0, "link_flair_template_id": "682e2d40-78e2-11ea-b9b2-0e4e69ee6911", "link_flair_text": "Advice", "num_comments": 2388, "post_id": "15a87y7", "score": 6488, "subreddit": "careerguidance", "text": "\"After I gave my 2 week notice resigning, he called and asked where I\\u2019m going to. I said I was told not to say (I meant I read it\\u2019s not good to disclose). \\n\\nHe then followed up with an email in all caps asking again saying he wants to make sure there\\u2019s no conflict of interest and even though he could find out with a google search after I left (I told him this) he would prefer telling him now to make sure they don\\u2019t handle our cases (they don\\u2019t). \\n\\nHe also said he\\u2019d appreciate it if I told him my pay so they can better formulate the company pay. \\n\\nThis is only the second day into my 2 week notice so I feel it\\u2019s going to be a long 2 weeks. I don\\u2019t want to leave on bad terms. What\\u2019s the best way to handle this? Withhold the info or spill it out?\\n\\nEdit: I also told him I wasn\\u2019t going to tell my co-workers thinking employers would appreciate that so there isn\\u2019t an air of uncertainty, as I myself wanted privacy. He responded by saying he was going to announce it at the weekly meeting (in an hour) where over 60 people attend. My phone is going to ring off the hook.\\n\\nEdit2: I love all of you 3,000 and counting (group hug). Thanks for the support and advice!!!!\"", "title": "My boss is pressuring to tell him where my new job is and the pay. Do I have to tell him?", "upvote_ratio": 0.92, "url": "https://www.reddit.com/r/careerguidance/comments/15a87y7/my_boss_is_pressuring_to_tell_him_where_my_new/"}, {"author": "dennisoa", "created_utc": 1693943263.0, "link_flair_template_id": "682e2d40-78e2-11ea-b9b2-0e4e69ee6911", "link_flair_text": "Advice", "num_comments": 3126, "post_id": "16ay1o1", "score": 6291, "subreddit": "careerguidance", "text": "\"So the best case scenario has happened, I find myself on the end of a job offer that will almost double my salary and it would change my life. \\n\\nI spent the last 2 weeks doing interviews for a job I applied to off a whim. The job itself wasn\\u2019t even the one I applied for, but the senior role above it is what the recruiter called me for. \\n\\nWhen we discussed salary, I thought I was being aggressive by saying my range was $115K-$135K/yr (I currently make $88K) only for the recruiter to say $135K is on the lowest end for this job.\\n\\nI was surprised, and encouraged by that to move forward. As I continued through multiple rounds of interviews I started to realize this job was a very advanced marketing position in an area I only have theoretical experience in or very little practical experience. \\n\\nSomehow, I was offered $160K plus a moving package (I\\u2019d move my whole family across the country) for a job that was basically asking me to build their marketing team and I really don\\u2019t think I can pull it off. \\n\\nMy wife fully believes in me, but taking on areas like paid ads, email marketing campaigns, SEO and more, when I\\u2019ve never done any of that seems daunting and that it\\u2019ll ultimately end up with me being fired at some point. \\n\\nThe job I currently have is fairly laidback with a hybrid schedule whereas this new one would require long hours and fulltime on-site. My current employer has been doing buyouts for over a year as we\\u2019re struggling in this economy so that\\u2019s why my random searches began a few months back. \\n\\nIs it crazy if I only try to use this offer for a raise? Or take a massive risk and move because it\\u2019s money I never thought I\\u2019d earn in my life? Even staying seems risky because of buyouts but I\\u2019m currently in talks with moving to a new role with my company for a good pay bump because there are so many open roles now that they need people in. \\n\\nTLDR: Tricked my way into a $160K job offer improving on my $88K job, current company is struggling with buyouts but will offer me a pay bump in a new position. I have little to no experience for the job offer, should I accept anyway?\"", "title": "BS’ed my way into a 160K job offer, am I crazy to turn it down?", "upvote_ratio": 0.91, "url": "https://www.reddit.com/r/careerguidance/comments/16ay1o1/bsed_my_way_into_a_160k_job_offer_am_i_crazy_to/"}, {"author": "ifuckinguess", "created_utc": 1696817790.0, "link_flair_template_id": "682e2d40-78e2-11ea-b9b2-0e4e69ee6911", "link_flair_text": "Advice", "num_comments": 1457, "post_id": "173gngl", "score": 5894, "subreddit": "careerguidance", "text": "\"I work at a childcare facility and have been there since July. When I was interviewed for the job I told them I needed October 9th-October 13th off. I was assured that I would have the days off. \\n\\nI just got a message from my manager telling me that they canceled my time off and I needed to be there tomorrow. I've already paid for the vacation and the tickets are not refundable. \\n\\nI'm extremely torn, this is my dream job. I've wanted to work in this field since I was young. But I asked for this off months ago. I have no idea what to do and I'm panicking.\"", "title": "My boss just canceled my vacation when I leave tomorrow. Should I quit?", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/careerguidance/comments/173gngl/my_boss_just_canceled_my_vacation_when_i_leave/"}, {"author": "johnsonjohnsonafc", "created_utc": 1693259810.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 3289, "post_id": "163zf2z", "score": 5696, "subreddit": "careerguidance", "text": "\"\\nHey all,\\nToday, my boss called me into his office and confronted me about the fact that I take a 45 minute lunch when I should only be taking 30 minutes. I work in an engineering office and we can take as long a lunch as we want whenever we want, as long as we are working 8 hours a day. I get in at about 7:30 and leave at 4 everyday, which totals 8 hours and 30 minutes, and each day I take around 45 minutes to eat lunch. So technically I come 15 minutes short everyday. Some ask why I don\\u2019t just take an hour lunch like most of my coworkers, but I don\\u2019t need a full hour, so why would I want to leave later? I get all my work done on time or early, and I often find myself with no work to do. The whistleblower that told my boss about this is an older lady that can\\u2019t get her work done in 8 hours because she\\u2019s bad with computers. She was upset that I get to work after her and leave before her. My boss said we would discuss this tomorrow, and I don\\u2019t know what to say. Fact is, this whole situation is about office politics. I\\u2019m a salaried employee and if I don\\u2019t get paid to work overtime, I\\u2019m not gonna waste my time when I finish early. How can I tell my boss this without coming off as arrogant or entitled?\"", "title": "My boss confronted me about only working 7 hours and 45 minutes a day, what do I do?", "upvote_ratio": 0.9, "url": "https://www.reddit.com/r/careerguidance/comments/163zf2z/my_boss_confronted_me_about_only_working_7_hours/"}, {"author": "Dull_Cartographer220", "created_utc": 1659556528.0, "link_flair_template_id": "682e2d40-78e2-11ea-b9b2-0e4e69ee6911", "link_flair_text": "Advice", "num_comments": 1449, "post_id": "wfgayf", "score": 5241, "subreddit": "careerguidance", "text": "\"I\\u2019m 16, on the spectrum, ocd, former druggie, fathers in jail, mom works all day and night to keep our heads above poverty. We live in some inner city shithole. Everybody around me is insane, and I was just like them too until the amazing people at the church set me on the right path. My dream is too become a doctor. I\\u2019m going to junior year next month and I have mediocre grades so far. Is it too late to get a scholarship? Should I join the military and use the GI bill to go to community, then to college? I got no idea what to do\"", "title": "I’m 16, black, how tf do I get out of the hood?", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/careerguidance/comments/wfgayf/im_16_black_how_tf_do_i_get_out_of_the_hood/"}, {"author": "No-Sprinkles-9059", "created_utc": 1684150768.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 988, "post_id": "13i5qt1", "score": 3945, "subreddit": "careerguidance", "text": "\"I work a variable shift and start between 5 and 8 am depending on the work (work for 8 hours from that time). The second I log into my laptop, my manager (usually on by 4 am) calls me everyday without fail and mentions something like \\\"I saw you come online and want to talk about blah blah\\\".\\n\\nI makes me dread opening my laptop because I don't even get a chance to review my emails and he'll often reference emails sent over the weekend when he calls Monday and ask if I read them. I'm salaried, but I put my foot down when it comes to weekend and night work. If it's an emergency, I get a call.\\n\\nSo how do I politely ask for 30 minutes to an hour before he calls each morning (or frankly to call less)?\\n\\nEdit 1: Oh my goodness. I'm a very inactive reddit user and just hopped back onto a ton of notifications. Allow me to review now.\\n\\nEdit 2: After reading some comments, here's a little more info. My manager has been with the company 19 years, is divorced, and adult children out of the house. I don't think he's a bad guy, but I think he's using his personal time more for work than hobbies.\\n\\nWe have a scheduled weekly 1 on 1 in addition to these daily calls.\\n\\nI think the time block on my calendar would work better if I started at the same time daily, which I might still utilize, but it will require some manual intervention with my shifts.\\n\\nI liked the suggestions to let him know I need time to catch up and reply to emails before touching base with him.\\n\\nI'll read through some more comments later, thank you!\"", "title": "How do I politely tell my manager not to call me every morning the second he sees my teams status change?", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/careerguidance/comments/13i5qt1/how_do_i_politely_tell_my_manager_not_to_call_me/"}, {"author": "theLOLisMine", "created_utc": 1688478374.0, "link_flair_template_id": "6e8b8c06-7882-11ea-8424-0e543b010d57", "link_flair_text": "Germany", "num_comments": 875, "post_id": "14qfo80", "score": 3471, "subreddit": "careerguidance", "text": "\"In November last year, a woman dev in my team accused a man coworker that he flashed his privates to her during a meeting. The guy had no such past incident and was also known as a pretty passionate worker. The investigation conducted by HR concluded to nothing, and also the woman was not able to bring up any evidence. The HR still ended up getting the guy fired, because in their words \\\"they take sexual harassment seriously whether or not the victim is able to provide any evidence\\\", and they don't want the company to get any wrong press if the issue get posted online. \\n\\nFast forward to last week and the same woman bosted to another woman coworker that how she got a man fired a few months ago because he stole credit during a meeting for work that she did.\\n\\nThe management is now also aware of the matter but has chosen to remain silent so far. My question is what can be done now? Should I inform the fired guy about the development so he can make a legal claim?\"", "title": "Should I contact a past colleague about a fake sexual harassment complaint?", "upvote_ratio": 0.92, "url": "https://www.reddit.com/r/careerguidance/comments/14qfo80/should_i_contact_a_past_colleague_about_a_fake/"}, {"author": "PBandJews", "created_utc": 1687110397.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 946, "post_id": "14cqfmd", "score": 3403, "subreddit": "careerguidance", "text": "\"Context:\\n\\nI was a psych major and a preschool teacher prior to getting this gig for a small (300 employees) aerospace/defense contractor. It's an administrative role doing the boring, tedious stuff that the subcontract managers don't have time for. Knew it wouldn't be fun, but I figured it would be a solid springboard job to open up more avenues (plus full remote).\\n\\nSo, I've been here for almost 6 months. Things have gone fine, I got a raise very early on and my immediate colleagues have been pleased given that I came in with no knowledge or experience in *any* of this. Don't particularly like the role or the contract/subcontracts field but I planned to stick around for at least a year.... Until now. \\n\\nThe Incident:\\n\\nThe other day, I got an email from the CFO. Immediately, I notice that a TON of people are CCd. Every member of the contracts, subcontracts and accounting department, as well as several other high ranking figures. \\n\\nI start reading and... Oh god... It's really aggressive. And it's talking about things I'm responsible for. Specifically, it was about delays in the processing of certain invoices and how it's severely hurting cash flow. He goes on and on with words like \\\"unacceptable\\\" and \\\"ridiculous\\\" and how serious discussions need to be had about responsible parties. I get to the bottom...\\n\\nThere I see an email screenshot with my name circled in red to make it clear that this email was a targeted call-out. I was stunned and I still am. The freaking *CFO* just bypassed at least two links in the chain of command to personally put me, one of the lowest level employees in the company, on blast in front of every person I ever have or ever will interact with. I've never even met/spoken to the guy. There's gotta be some kind of achievement for that.\\n\\nObviously, this was humiliating and a huge blow to my ego. There was a lot of crying, self-pity and \\\"Oh God, I'm a failure, I'm an idiot\\\" and all that. I'm not gonna act like I'm some top-shelf, above-and-beyond employee, but the delays I was being targeted for were mostly out of my control (I can go into detail about this if anyone cares to know). Basically, tiny bit my fault, but mostly not. \\n\\nMy manager was absolutely FURIOUS at the CFO.  He immediately jumped to my defense and helped drag my catatonic corpse through the process of proving that my performance was, indeed, satisfactory. \\n\\nMy manager then proceeded with an absolute baller move; He wrote an email laying out info and evidence in my favor and commending me, making sure to copy EVERY person the CFO had copied. Very grateful for that.\\n\\nDespite my manager's defense, I feel I have an extremely unwanted spotlight on me now along with irreparable damage to my virtually non-existent reputation. The bridge is sufficiently burned and I don't feel comfortable working somewhere I'm seen as an idiot or a liability. To make matters worse, this experience which should hypothetically light a fire under my ass has left me feeling completely apathetic. I just want to bow out and leave with the lessons and surface-level business experience I came for. Admit to myself that I'm not cut out for it. \\n\\nIt's certainly not the end of the world but it really sucks. No one wants to feel like a failure. \\n\\nIf anyone has thoughts on next steps or similar experiences they'd like to share, I'd love to hear them.\"", "title": "I'm an entry level employee and was very publically reprimanded by the CFO. How would you handle this?", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/careerguidance/comments/14cqfmd/im_an_entry_level_employee_and_was_very/"}, {"author": "Christianpilgrim84", "created_utc": 1688043421.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 581, "post_id": "14m4ciy", "score": 3354, "subreddit": "careerguidance", "text": "\"I posted a few weeks back about being a teacher and resigning because my principal and superintendent reprimanded me for directly emailing the superintendent when I had an issue.\\n\\nI resigned the position and the principal declined my resignation and asked to speak with me.\\n\\nI responded that I would meet with him if and only if it\\u2019s with him and the superintendent.\\n\\nI was actually granted that meeting.\\n\\nI walked into it with a copy of my resignation to hand directly to the superintendent and I had something predetermined to tell him\\u2026\\n\\nSomething in the ballpark of: \\u201cIf you\\u2019re too good or important to answer an email from me, then find someone else to teach the classes I teach and coach the sports I coach.\\u201d\\n\\nI walk in and the superintendent asks me to sit and I refuse.\\n\\nHe then stands up and says: \\u201cI was under a lot of pressure with that situation. I was wrong and I want to formally apologize to you. What can I do to make this right?\\u201d\\n\\nMy mouth almost hit the floor.\\n\\nThey maxed my coaching salaries to the district cap because teaching pay is based on a scale for teaching and I\\u2019m at the pay grade for my scale.\\n\\nI\\u2019d also receive extra pay for being part of a new task force as a liaison between teachers and the superintendent.\\n\\nThe Principal also apologized.\\n\\nIm not doing this for money. Im doing it to help kids.\\n\\nThoughts?\\n\\n***Update***\\n\\nI pulled the resignation and insisted that the write up stay on my record. If they can meet me where they did, I can certainly admit my shortcomings as well.\\n\\nThe Superintendent was elated and the principal seems to be happy with the outcome as well.\\n\\nI have everything documented and signed off on.\"", "title": "Should I accept the apology and withdraw my resignation?", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/careerguidance/comments/14m4ciy/should_i_accept_the_apology_and_withdraw_my/"}, {"author": "Top_Parsnip_6167", "created_utc": 1709909840.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 1701, "post_id": "1b9py2u", "score": 3296, "subreddit": "careerguidance", "text": "\"Okay, so, there was a very narrow window in which I could get married and have my mother there. I spoke with my manager and told her I\\u2019d be getting married soon and she said to let he know when we had decided on dates. \\n\\nThe photographer we wanted offered us \\u00a3500 off if we booked a particular date and that happened to be the date my mother could be in the UK to attend. I sent this info to my manager but got an automated reply saying that she was on leave for a week. So, feeling sure that it would be okay, we booked the date and my mother booked (and paid for) our accommodation for that week. \\n\\nMy manager returned and said nope, you can\\u2019t have those dates because I\\u2019m on annual leave that week and we can\\u2019t have a team leader off at the same time as a manager. So, I said I\\u2019ve already booked the dates and she went to confirm with her manager. I quickly received a \\u201cline in the sand\\u201d letter saying that I can\\u2019t have the time off and if I try to take the time off despite this, I will be met with disciplinary process. I was shocked and spoke to my direct manager who explained that she\\u2019s off that week and that she can\\u2019t move her leave as it\\u2019s her anniversary so I\\u2019ll need to change my wedding date. \\nShe then said that after speaking to her manager, it transpired that I can\\u2019t have time off if my manager is off, if the other team leader of a different team is off or if anyone in my team is off - this is 12 people. None of this has ever been said or implemented before, I\\u2019ve often had time off when other team members are off. \\n\\nMy manager asked that i put my \\u201cconcerns\\u201d in writing and send to her manager, which I did and received an email saying essentially policy is policy and I shouldn\\u2019t have booked anything without checking. \\n\\nGranted, I should have checked first but I never imagined it to be this difficult and since there will be 8 managers, 16 team leaders working on those dates company wide, I assumed they could find cover for 5 days. \\n\\nThey have said it\\u2019s non negotiable. Of course, my instinct is to quit but I\\u2019m hoping to have a baby sometimes soon and having worked here for 5 years, I don\\u2019t want to lose my benefits. I don\\u2019t know what else to do or if I have a leg to stand on? \\n\\nAll advice would be greatly appreciated. \\n\\nEdit to add - I put in the request for these dates off with 11 months notice. The wedding is now 7 months away and I *will* be getting married on that date\\u2026 just not sure how. \"", "title": "I’ve been denied time off for my wedding, what do I do now? ", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/careerguidance/comments/1b9py2u/ive_been_denied_time_off_for_my_wedding_what_do_i/"}, {"author": "grocery1185", "created_utc": 1692411280.0, "link_flair_template_id": "682e2d40-78e2-11ea-b9b2-0e4e69ee6911", "link_flair_text": "Advice", "num_comments": 1696, "post_id": "15v3j76", "score": 3075, "subreddit": "careerguidance", "text": "\"Thanks for everyone's input. I told my boss on Thursday. I waited an hour for him to get settled and then went in to talk to him and said \\\"I am mortified, I sent the factory pricing to client AB by mistake. Are we able to offer her a discount as an apology?\\\"\\n\\nMy boss called the client and told her I sent them the wrong pricing and we need to update the order. The client said they already calculated their pricing based on what I gave them and in turn sent a purchase order with that info to ***their*** client. Our client is refusing to go back on this, won't accept a discount, and they are not happy.\\n\\nMy boss is furious with me and said he has never seen this kind of mistake in all his years in the industry. He is \\\"speechless\\\". We gave the client an order for free and lost money. The loss is actually around $2,400. He also said now he has to go back and check all the pricing I ever sent to clients because those could be wrong, too.\\n\\nToday (Friday), my boss was originally going to be out of office but he ended up coming in to give me a performance improvement plan and he stayed the whole day, until 6:30 p.m. It was another horrible day. I know he is going to fire me and the PIP is only to protect himself so I cannot claim unemployment benefits. He fired someone last month for less because they were asking him too many questions. They were only there 3 weeks. My boss says he always wants us to ask him questions but then if he doesn't like the questions you are asking you are doomed. So if he will fire someone for asking a lot of questions no doubt he will fire someone who lost money for his company.My boss was originally going to be out of office on Friday but he ended up coming in to give me the PIP and he stayed the whole day, until 6:30 p.m. It was another horrible day.\\n\\nSo yeah, I ripped the band aid off, got it over with and came clean but as expected it has been an unpleasant working environment and it is never going to get better. My boss isn't wrong with the things he is saying to me though. I feel awful I made that mistake. I suck and am a horrible employee. I am dreading Monday.\\n\\nEDIT: Wow, was not expecting so many responses. Thank you so much everyone for your input, advice and kind words. I keep coming back here to read for support because I am trying not to feel so awful.\\n\\nMy boss is mad about the $$ loss but even more mad that I sent our internal costs to the customer. He thinks I am a moron. He doesn't have to say that exact word but the way he has been talking and treating me says it all. He again said this is a mistake he has never seen someone make before. The past two days have been awful and as soon as I come home I start crying. I want to quit. I know you shouldn't do that without another job lined up but I don't know how much more I can take.\"", "title": "Update to my giant mistake at work: I told my boss and it went as bad as I expected, how do I survive the rest of my tenure here?", "upvote_ratio": 0.93, "url": "https://www.reddit.com/r/careerguidance/comments/15v3j76/update_to_my_giant_mistake_at_work_i_told_my_boss/"}, {"author": "None", "created_utc": 1703040202.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 1144, "post_id": "18mjto9", "score": 2983, "subreddit": "careerguidance", "text": "\"I'm 23 years old and live in Virginia. My senior year of highschool when I just turned 18 I got pulled over by a cop for speeding which escalated into my car being searched and 2 grams of personal marijuana was found. \\n\\nAt the time, I decided to plead guilty to avoid probation which was the worst mistake of my life. Fast forward 5 years later, I have a Bachelor's Degree in Cybersecurity and have lost countless job opportunities because I am viewed as a criminal. My first offer out of college was a remote job paying $105,000 a year and when it was time for the background check, It went to another candidate. It kills me inside knowing that a small mistake has ruined my future.\\n\\nThe funny thing is, marijuana is now fully legal in Virginia and you can even grow it! I have talked to lawyers and it cannot be removed off my record despite it becoming legal. My question is, what the fuck do I do? Keep it pushing until I find a company that doesn't care? How did my life get ruined over a plant?\\n\\n  \\nI am not a bad person, or a drug addict. I graduated with a 3.7 GPA. I am just lost and feel very defeated because no one will give me a chance. \"", "title": "My Possession Of Marijuana Charge Is Ruining My Life, wtf do I do?", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/careerguidance/comments/18mjto9/my_possession_of_marijuana_charge_is_ruining_my/"}, {"author": "BrodieSzn0", "created_utc": 1610067526.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 549, "post_id": "ksrez7", "score": 2891, "subreddit": "careerguidance", "text": "\"How do you overcome this, this can\\u2019t be life\\n\\n\\n\\nEdit 1 : The fact this post blew up shows me that  I\\u2019m not alone feeling like this. I hope every one can overcome this obstacle. If you want , can you mention what did you do to solve this problem for yourself\\n\\n\\nEdit 2 :Thanks  U/stardustwhale for the hug award this is my first one , I\\u2019m going to to reply to as many as I can because I genuinely would love to know the different experiences everyone has had jus need some time\\n\\nEdit 3: U/Infj4w3 thank you for the gold\\n\\n\\nEDIT 4 : this really blew up so idk how but I\\u2019m going to reply to everyone in this thread and for those giving me awards  I appreciate you!!!!! but jus keep it no need to waste your money for that\"", "title": "How do you guys deal with working a 9-5 and coming home and once you eat you go to sleep from the exhaustion? Feels like dying a slow death because of repetitiveness of it all", "upvote_ratio": 0.99, "url": "https://www.reddit.com/r/careerguidance/comments/ksrez7/how_do_you_guys_deal_with_working_a_95_and_coming/"}, {"author": "littlemisssniff", "created_utc": 1701881575.0, "link_flair_template_id": "682e2d40-78e2-11ea-b9b2-0e4e69ee6911", "link_flair_text": "Advice", "num_comments": 1229, "post_id": "18c8asn", "score": 2834, "subreddit": "careerguidance", "text": "\"This is my first job out of college. Before this, I was an intern and I largely did nothing all day and I kinda figured it was because I was just an intern.\\n\\nNow, they pay me a nicer salary, I have my own office and a $2000 laptop, and they give me all sorts of benefits and most days I\\u2019m still not doing much. They gave me a multiple month long project when I was first hired on that I completed faster than my bosses expected and they told me they were really happy with my work. Since then it\\u2019s been mostly crickets. \\n\\nMy only task for today is to order stuff online that the office needs. That\\u2019s it. Im a mechanical design engineer. They are paying me for my brain and I\\u2019m sitting here watching South Park and scrolling through my phone all day. I would pull a George Castanza and sleep under my desk if my boss didn\\u2019t have to walk past my office to the coffee machine 5 times a day.\\n\\nIs this normal??? Do other people do this? Whenever my boss gets overwhelmed with work, he will finally drop a bunch of work on my desk and I\\u2019ll complete it in a timely manner and then it\\u2019s back to crickets for a couple weeks. He\\u2019ll always complain about all the work he has to do and it\\u2019s like damn maybe they should\\u2019ve hired someone to help you, eh? \\n\\nI\\u2019ve literally begged to be apart of projects and sometimes he\\u2019ll cave, but how can I establish a more active role at my job?\\n\\nUPDATE:\\n\\nAbout a week after I posted this, my boss and my boss\\u2019s boss called me into a impromptu meeting. I was worried I was getting fired/laid off like some of the commenters here suggested might be coming, but they actually gave me a raise.\\n\\nI have no idea what I\\u2019m doing right. I wish I was trolling.  \"", "title": "Does anyone else do mostly nothing all day at their job?", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/careerguidance/comments/18c8asn/does_anyone_else_do_mostly_nothing_all_day_at/"}, {"author": "James-Hawker", "created_utc": 1687883509.0, "link_flair_template_id": "682e2d40-78e2-11ea-b9b2-0e4e69ee6911", "link_flair_text": "Advice", "num_comments": 782, "post_id": "14kieen", "score": 2820, "subreddit": "careerguidance", "text": "\"Started work at an market as a meat stocker this last weekend. Sunday was my first day, I get to the store, am handed my shirt to put on, and head back to the meat department. The person there was not who I was told would be training me. He tells me that he's left a lot of work for me to do, so I can get used to the process. I tell him that's fine, but that I'd be a little slow getting used to everything.\\n\\nLess than two hours later and I'm being yelled at because there's still too much work to do, and I'm not moving fast enough. He kicks me out of the department a few minutes later, which has me going to sit in the corner like a child because there's no designated break room that I was informed of. I end up crying a bit, but manage to get it back under control and head back to try and help with the rest of the workload.\\n\\nI only get yelled at -again- for not properly stacking ground beef in the display, and then again when he assumes I put old product in the back, and misplaced where I had put it... Which was up front, as it should be done.\\n\\nAt the end of the day, he tries to act apologetic, insisting that he didn't mean to \\\"be a dick\\\", suddenly concerned that I'm acting like I would rather be anywhere else. And frankly, that's the truth. I never want to put that shirt on again, I don't want to set foot near the meat department. The dude knew I was coming in to train, shoveled a workload on my shoulders that I couldn't handle, and then got pissed at me for his mistakes. On top of that, he left early, leaving me to work out how to restock the freezers on my own, and with no guidance, after yelling at me for most of the day for being too slow.\\n\\nTo clarify a little, he never used abusive language. But the way he spoke to me was very passive-aggressive, and it just left me feeling put off. \\\"Come on, man, do I really have to show you again?\\\", and so on. It got worse towards the end of the day, during cleanup, when he repeatedly 'accidentally' sprayed me down with the cleaning water after ridiculing me for not standing closer.\\n\\nI'm supposed to go in later this week to work regular store stocking, and then go back to the meat department the day after. But I've been suffering a constant migraine since I started crying on Sunday, and every time I think about having to go back in, it gets worse. Is it okay to just quit, even though I said I'd be back in on Thursday? Is this a normal experience? I feel like I'm just being too sensitive, even though I've never had any issues like this with any other job I've had in the past.\\n\\nEdit: I'm no longer employed as of 1:20 PM EST today. I feel the headache lifting already... Thanks to the people who gave me that push, even if it was a simple one-word \\\"quit\\\".\"", "title": "Is it okay to quit a job after a horrible first day?", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/careerguidance/comments/14kieen/is_it_okay_to_quit_a_job_after_a_horrible_first/"}, {"author": "realityboundwanderer", "created_utc": 1691329559.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 496, "post_id": "15jq1j6", "score": 2813, "subreddit": "careerguidance", "text": "\"I got a call last week, had the usual chat and then asked about the salary, which I tried to get to know what they're offering but HR lady just insisted on know my expectations. When I told her, she said something along the lines of \\\"if I'm open to negotiate for less\\\" to which I replied that this is my minimum and after few more questions the conversation ended.\\n\\nI got a call from the same lady and her first question was again whats my expectations and again I told her that this is the minimum I can go.\\n\\nHmm.. what is this exactly? Why are companies being cheap and btw I'm not even asking for much. And even if I'm, they can just decline and move to the next person, insist, she wants me to stick to my current salary, like lady whats the point then??\\n\\nI think this is a red flag. This doesnt encourage me to even go on the interview.  IF she calls again that is.\\n\\n\\nUPDATE: Thank you all for the support and advice, this is all so new to me and your inputs fellow strangers were really helptful. \\nSomeone from this company spoke with my previous manager. They were asking about me and they even asked about how much someone in my position makes!!\\nThankfully, my manager was smart enough to give a reasonable answer which aligned with was I asked for.\\n\\nSmall note, I understand that its HR is trying to negotiate, I'm not saying she's at fault, but again, I'm not asking for an outrageous number and it is within reason, so if they feel like im asking for much, they can just look for someone else. I guess.\"", "title": "Some company asked me for the second time if I can lower my expected salary. Red flag?", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/careerguidance/comments/15jq1j6/some_company_asked_me_for_the_second_time_if_i/"}, {"author": "confuzeddeer", "created_utc": 1688989255.0, "link_flair_template_id": "682e2d40-78e2-11ea-b9b2-0e4e69ee6911", "link_flair_text": "Advice", "num_comments": 1060, "post_id": "14vrmmj", "score": 2633, "subreddit": "careerguidance", "text": "\"I am 25 years old and I make a little over $100k a year. While my job is commission based it is not difficult for me to hit the $100k mark. I work 10 hours a day 5 days a week and every 3rd Saturday. I am offered a hour lunch but I usually only take 30~ minutes to eat and most days I work while eating. My job offers very little sick leave/PTO and the benefits are generally terrible. I do have a good manager who is pretty lenient on asking for days off which is nice. The job is highly stressful (mentally) and most days I come home I\\u2019m completely drained. I need to work closely with coworkers in order to effectively do my job but to put it nicely the majority are \\u201cdifficult\\u201d to deal with. Due to the line of work I\\u2019m in the customer base is also highly negative in emotion. There is not a single easy aspect I\\u2019ve been able to find about what I do. It\\u2019s gotten to the point where even though I respect my boss and a few of my peers I want to walk in and tell them I can\\u2019t do it anymore. I\\u2019m very grateful for the fact I earn a proper living especially with the way the economy is. While I\\u2019m not opposed to it I do not have any schooling. I feel trapped and unsure. Do I walk away from something like this and continue my search for a better life or suck it up/tough it out for the sake of being comfortable at home?\"", "title": "Do I walk away from a high paying job because I’m miserable?", "upvote_ratio": 0.92, "url": "https://www.reddit.com/r/careerguidance/comments/14vrmmj/do_i_walk_away_from_a_high_paying_job_because_im/"}, {"author": "IamDefAnonymous", "created_utc": 1700167721.0, "link_flair_template_id": "682e2d40-78e2-11ea-b9b2-0e4e69ee6911", "link_flair_text": "Advice", "num_comments": 769, "post_id": "17wx1ki", "score": 2565, "subreddit": "careerguidance", "text": "\"\\nI\\u2019ve been stuck for a while. I have made post ab it. I\\u2019ve whined about it for so long but at the end of the day it\\u2019s my fault. The only thing I want to accomplish is to live financially free and take care of my family. Should I move to a big city spontaneously? As I am from a small town, it never changes. Most small cities stay the same keep the same people, but these big cities are always improving people come and go and that\\u2019s where you money is. I\\u2019m 21 have no idea what I want to do. I\\u2019m the current assistant manager at a pizza place on nights and just got a banking job that pays better for the days.(  I start next week.) I have working two jobs before and it does suck but right now I need the money. I also need a plan I\\u2019m stuck where I\\u2019m at idk what I want to do but I think it\\u2019s because I tried a lot. I\\u2019ve considered going back to school fixing my grades and finding something in tech but the job market is so competitive. I don\\u2019t wanna follow my passion because I don\\u2019t believe that is the way to money. Any tips would be helpful\\u2026 thank you\"", "title": "What’s a career path for someone who’s stuck?", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/careerguidance/comments/17wx1ki/whats_a_career_path_for_someone_whos_stuck/"}, {"author": "blacksilverglass", "created_utc": 1692184382.0, "link_flair_template_id": "682e2d40-78e2-11ea-b9b2-0e4e69ee6911", "link_flair_text": "Advice", "num_comments": 671, "post_id": "15smx7j", "score": 2526, "subreddit": "careerguidance", "text": "\"I\\u2019m a designer at a small company with total of 5 people. I work 9-6, earning around 1800dollars. I don\\u2019t make alot. And we don\\u2019t get paid to work more. Normally I have worked late once every three months, and if busy 2 times a month. \\n\\nNormally I go home exactly at 6. And I always finish the job on time.\\n\\nBut past 3 weeks, my boss is getting pissed when I leave work. When I say See u, she normally replies back. But these days she barely responds. Just a \\u201cmhm\\u201d in a really pissed off tone.\\n\\nLast time at the meeting, she told us to re-do my work based of some references. She said if you think its not enough, you should stay late and work on it. I didn\\u2019t work late, but I finished it right on time and showed her today. \\n\\nShe told me I don\\u2019t put my best effort into my work these days. And she was quite mad at me for not thinking. So she told me to re-do it. \\nI did it again, finished it and I was leaving work today. I told her see you. And She completely ignored me and walked passed me.\\n\\nI\\u2019m very confused. She is mad at me for what? Fyi this is my first time working, its been 8-9 months.\"", "title": "Why is my boss mad at me leaving the work at the right time?", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/careerguidance/comments/15smx7j/why_is_my_boss_mad_at_me_leaving_the_work_at_the/"}, {"author": "birdsbikingrunning", "created_utc": 1694014667.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 1663, "post_id": "16bngd2", "score": 2344, "subreddit": "careerguidance", "text": "\"I know this will seem insane to some, but I've decided to quit my job in tech. I make 175k, but can't do it anymore. If any of you have worked in tech before, you know the type of people that run it. Insecure, greedy, self-deceived, arrogant, and downright stupid a lot of the time. I've put up with it for like 8 years now, but just can't do it anymore. Extremely depressed and it's made me so cynical of the entire world and hateful of people. \\n\\nGoing to pursue some meaningful career avenues. May try do some athlete coaching, teaching, start a few charity programs, and may try to do some consulting/contracting on the side just to keep the salary in an okay place. \\n\\nAny of you done something similar? Advice? Thoughts? \\n\\n&#x200B;\"", "title": "Walking away from 175k in tech. Can't do it anymore. Tech pays, but it sucks. Any of you gone down a similar path?", "upvote_ratio": 0.91, "url": "https://www.reddit.com/r/careerguidance/comments/16bngd2/walking_away_from_175k_in_tech_cant_do_it_anymore/"}, {"author": "nitsed004", "created_utc": 1688115247.0, "link_flair_template_id": "682e2d40-78e2-11ea-b9b2-0e4e69ee6911", "link_flair_text": "Advice", "num_comments": 436, "post_id": "14mv0e5", "score": 2335, "subreddit": "careerguidance", "text": "\"Hey! So recently got passed over for a technical position in my office that involves about a 50/50 split of admin to advance excel and database skills. The person who got the role has almost no excel skills and received a specialized training only offered to them on an in-house software\\u2026\\n\\n(This training was used as rational for why they were the better candidate)\\n\\nThat being said my boss mentioned that she would still \\u201clove\\u201d to allow me to grow by using my excel and database skills (50 percent of this job). Any advice on professionally making it clear that I\\u2019m not interested in training the person technically or doing duties consistent with the job since I didn\\u2019t receive an offer. Everything I learned was self taught. I plan on getting my masters in business analytics and leaving as soon as that is complete if not sooner if I can secure a role outside of my current industry.\"", "title": "How do I avoid doing the job when I didn’t get an offer?", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/careerguidance/comments/14mv0e5/how_do_i_avoid_doing_the_job_when_i_didnt_get_an/"}, {"author": "disco_roller", "created_utc": 1692288951.0, "link_flair_template_id": "682e2d40-78e2-11ea-b9b2-0e4e69ee6911", "link_flair_text": "Advice", "num_comments": 904, "post_id": "15ts1cb", "score": 2211, "subreddit": "careerguidance", "text": "\"I\\u2019ve been at my current job for nearly two years. My team is understaffed by 40% and as such I finally received a 70% raise recently, which I am extremely grateful for.\\n\\n*However*, I just received a job offer that pays an additional ~15% base pay plus a yearly ~10% bonus for a total of $~110k/year. It\\u2019s also overtime exempt, whereas my current position is OT eligible and I get a fair amount of it throughout the year.\\n\\nI\\u2019m nervous about taking this risk, as my current supervisor is very lax, let\\u2019s us get projects done on our own time, let\\u2019s us take time off whenever, and isn\\u2019t a stickler for being on-time, leaving early, etc. Basically, I can do whatever I want here (within reason) and I feel like that flexibility may be worth more than the extra pay.\\n\\nI know money isn\\u2019t everything, but with how expensive everything is now (especially in my area) I\\u2019m tempted to take it. I just would hate to leave for ~20% more money and potentially 40% more workload and less work/life balance.\\n\\nThoughts or suggestions on this?\\n\\nThanks in advance (:\\n\\nEDIT: My pay increase was partially due to me receiving a previous offer from another company. I should\\u2019ve been more specific about that in my post.\\n\\nEDIT 2: Thank you all for your responses! I have decided to decline the offer with the new employer and will be staying in my current position. Yes, it sucks that it took getting a new job offer for me to get a raise but it\\u2019s worked in my favor and my employer\\u2019s. If nothing else, they\\u2019ve bought me for another year or two.\\n\\nThanks again, everyone!\"", "title": "Recently got a 70% pay increase, but just received a better offer from another employer. Do I stay or should I go?", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/careerguidance/comments/15ts1cb/recently_got_a_70_pay_increase_but_just_received/"}, {"author": "tirinix", "created_utc": 1689852505.0, "link_flair_template_id": "682e2d40-78e2-11ea-b9b2-0e4e69ee6911", "link_flair_text": "Advice", "num_comments": 362, "post_id": "154ob1z", "score": 2209, "subreddit": "careerguidance", "text": "\"During the interviews they said I can work fully remote and we agreed on a certain start date.\\n\\nAfter signing the contract offer, the future boss called me and heavily pressured me to talk to my current boss and negotiate a shorter notice period so I can start in ideally two weeks. We initially agreed that my start date would be in a few months. I said this likely won't be possible but future boss pushed back and said something along the lines of \\\"we already have plenty of work for you now, and if you don't start now, it will pile up for you\\\".\\n\\nDuring interviews, future boss also said that it doesn't matter where I work and I can be fully remote. But during our post contract offer call, future boss told me that it is heavily preferred if I was in the office three times a week, which would mean that I move.\\n\\nSo now I want to rescind my signature, but I'm not sure the legality of it. This isn't a contract, but a contract offer. It has only basic information like salary, insurance, and their benefits. It doesn't contain information about probation period or contract termination.\\n\\nProbably best to check with a lawyer, but just curious if anyone here has any experience with this.\"", "title": "I signed a contract offer for a new job, then future boss called me with \"new information\". Can I rescind?", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/careerguidance/comments/154ob1z/i_signed_a_contract_offer_for_a_new_job_then/"}, {"author": "ashley6777", "created_utc": 1663671095.0, "link_flair_template_id": "682e2d40-78e2-11ea-b9b2-0e4e69ee6911", "link_flair_text": "Advice", "num_comments": 488, "post_id": "xj5im0", "score": 2160, "subreddit": "careerguidance", "text": "\"I am in a team of 3 with two older other women. Every Thursday, we have to stay late for r my job because of our potential meetings from our clients. These meetings can be cancelled if we want to reschedule. We do not get paid for it since we are salaried. Anyway, my 1st coworker's dog died so I covered for her. Then she had to go watch her daughter's soccer game, so my boss made me cover for her as well. Last Thursday, my 1st coworker fell at work, and I saw it. I feel bad for all the events that happened to her recently. Anyway, my 2nd coworker refused to cover because she said that her kids are young and she needs to cook dinner for them. My boss asked me to cover for my 1st coworker. I have been covering for her for her past 3 weeks. I also made plans with my friends just to hang out and have dinner. I told my boss I have plans and he asked what I was doing. I responded that I was hanging with my friends. He proceeded and asked me to cancel my plan. He questioned me why couldn't I cover when I have no kids. I told him that I did not like canceling plans, and he told me that I was not being a team player. I straight up told him that I couldn't cancel my plans, so I didn't cover for her. Her night was uncovered. Anyway, since Friday and Monday, my boss hasn't talked to me. I just applied for 2 jobs last night. I feel discriminated. \\n\\n\\nF*ck  my boss for telling me this.\"", "title": "Why couldn't you cover for your coworker when you don't have kids?", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/careerguidance/comments/xj5im0/why_couldnt_you_cover_for_your_coworker_when_you/"}, {"author": "Sea-Run-9476", "created_utc": 1689620045.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 717, "post_id": "152aigt", "score": 2160, "subreddit": "careerguidance", "text": "\"Last week I was laid off from my job. I haven't even accepted my severance package yet, and today I received an email from a competitor asking to meet with me about \\\"potential opportunities.\\\"  \\nI've checked my original employment agreement and from what I understand, I was only banned from working with a competitor during my time at the company (I'll work on double checking this.)  \\nThe major reason I'm questioning has more to do with bridges being potentially burned and I'm also not sure that this is an industry I want to stay in long-term.  \\nOverall my question is, would you be open to the conversation if you were in my shoes? Could I use the opportunity to negotiate a better severance package? Thoughts?\\n\\n&#x200B;\"", "title": "I was laid off last week and a competitor is wanting to meet with me. Should I take the opportunity?", "upvote_ratio": 0.93, "url": "https://www.reddit.com/r/careerguidance/comments/152aigt/i_was_laid_off_last_week_and_a_competitor_is/"}, {"author": "throwaway9954675", "created_utc": 1687163247.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 276, "post_id": "14d8n6n", "score": 2119, "subreddit": "careerguidance", "text": "\"His mother and father died in a car accident last month. He went home for a few weeks, and he\\u2019s clearly struggling.\\n\\nI would never fire him (unless he kills someone, idk) and just want to be there for him. He was always the happiest, friendliest, nicest kid, and now he\\u2019s a shell.\\n\\nFrom a human being perspective and not career, I need to help. I don\\u2019t think he\\u2019s in therapy or otherwise taking care care of himself, and I\\u2019m heartbroken. Is there anything I can/should do?\"", "title": "One of my employees had a devastating personal loss recently, and he’s understandably not doing well. I don’t care about his work performance, just as a person - how can I help?", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/careerguidance/comments/14d8n6n/one_of_my_employees_had_a_devastating_personal/"}, {"author": "BakedAvocado3", "created_utc": 1682515234.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 575, "post_id": "12zhdbq", "score": 2076, "subreddit": "careerguidance", "text": "\"I look on indeed, LinkedIn, glassdoor, company sites and feel like there's mininal jobs out there and if there is a listing that fits me, the pay/benefits is terrible. Sometimes I think I'm going to be stuck at my current crappy job forever. I feel stagnant, like I'm wasting my time, I should be advancing, learning, growing. Maybe it's a good time to go back to school for that MBA I've been considering?\"", "title": "Anyone else feel so defeated in this job market?", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/careerguidance/comments/12zhdbq/anyone_else_feel_so_defeated_in_this_job_market/"}, {"author": "Main-Reference-4389", "created_utc": 1653726545.0, "link_flair_template_id": "6e8b8c06-7882-11ea-8424-0e543b010d57", "link_flair_text": "Detroit,Michigan", "num_comments": 617, "post_id": "uzj0tz", "score": 2052, "subreddit": "careerguidance", "text": "\"I\\u2019m 23m and I live with my mother, who takes care of my grandma. Gonna be 24 in a couple months and honestly, I am so tired of living in a shit lifestyle. My mother surviving off of the government for years, I been threw 1 shit retail job to another. And I just got done working at cvs because they reduced my hours to 8 hours a month (you read it right) man\\u2026 I just want to break the cycle. I just want to be able to hand my mother some money without it being dirty money and I never want it to begin like that.  I just want to move out and have my own place because I feel so trapped to just \\u201cbe myself\\u201d living with my mother and grandmother. \\n\\nI don\\u2019t want to be some rich billionaire private yacht owner or any of that. I just want to find something\\u2026 anything, a path that can help me financially and not keep me on paycheck to paycheck. I don\\u2019t know the answers, im just a young black man wanting to do better with his life. And most importantly I don\\u2019t even have anyone for guidance. I cut ties with my friends because most of them wanted to run the streets and do stupid stuff that could get them locked up\\u2026hell, some of them already are. When I started talking to them about my interest in doing sales or just bettering my life, they looked at me like I was tryna do better then them.\\n\\nLong story short. I\\u2019m a decent guy with a crappy upbringing. And I need financial help, I don\\u2019t want any free handouts. I just want some real guidance, something that I never really had ya know. For whoever read this, I appreciate you. Feel free to private message me on this app. Thanks yo.\\n\\nEdit: I do have a high school diploma. I will read everyone\\u2019s replies in about 2 hours from now. I didn\\u2019t even think this would be seen to be honest. I will make sure to respond and reply also. And I\\u2019ll have a notepad and pen ready.\\n\\nEdit#2: Wow... I don't even have any words. you all... THANK YOU so much. I am ready to read, reply and jot down everything now. I will read every single comment because if you guys are gonna take the time out of your day to help me through my shit, then I want you all to know I'm here for it, To give my best run at life from here on out.\"", "title": "How do I get out of the hood/poverty?", "upvote_ratio": 0.99, "url": "https://www.reddit.com/r/careerguidance/comments/uzj0tz/how_do_i_get_out_of_the_hoodpoverty/"}, {"author": "netsurfer79", "created_utc": 1686006691.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 771, "post_id": "141viid", "score": 2037, "subreddit": "careerguidance", "text": "\"I was supposed to do my FINAL zoom Interview for a company today...This was the deciding factor for whether the company I was going for would hire me. l had gotten dressed into suit and tie and all. Sat in front of my laptop and logged into the meeting room. \\n\\nThe host hadnt attended. I thought no biggie, last time they were running a bit late too..I ended up having this in mind, waited another 15 minutes and at this point I was like What the F? What kind of Hiring Manager is 15 minutes late for an interview? Called the HR number, no answer. Ok its already 20 minutes past the schedules start time. I write an email to HR and log out. \\n\\nIve had similar experiences where companies would not even get back to me after the interview to update me if i scored or lost, but this situation just blew it. I dont even know how to move forward anymore. I cant get a single job with my college degree that pays even a decent $20/hr. Not to sound dark but people are going to start jumping off of bridges at this rate. Why are employers being SO INCONSIDERATE? I understand we are in the midst of a recession but seriously, COME ON. \\n\\nI cant even get a suggestion for a job because literally everyone is swarming to get a job right now, any opening is immediately going to have 100 applicants in the first day its posted\\n\\nEdit*\\nDidn't think I would get so many likes and comments on this post. Thank you all for your humble support\"", "title": "Is anyone else lost faith in this absurd job market?", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/careerguidance/comments/141viid/is_anyone_else_lost_faith_in_this_absurd_job/"}, {"author": "wallywizard55", "created_utc": 1683650498.0, "link_flair_template_id": "682e2d40-78e2-11ea-b9b2-0e4e69ee6911", "link_flair_text": "Advice", "num_comments": 613, "post_id": "13cyrvq", "score": 2021, "subreddit": "careerguidance", "text": "\"embarrassed to ask, anyone else (40+), still asking themselves, \\\"what the hell do I want to do when I grow up?\\\". \\n\\nAt this point. I am grown up and I still dont know what I want to do. I feel like that disney \\\"soul\\\" trying to find my purpose. Feel lost and not sure what direction I want to go in. ... yikes!\\n\\nI see younger folks in there 20's asking this question and I think to myself, I am in my 40's and still have that question. Kinda depressing.\"", "title": "anyone here 40+ not knowing what the heck to do with their career?", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/careerguidance/comments/13cyrvq/anyone_here_40_not_knowing_what_the_heck_to_do/"}, {"author": "wilzog", "created_utc": 1692231600.0, "link_flair_template_id": "682e2d40-78e2-11ea-b9b2-0e4e69ee6911", "link_flair_text": "Advice", "num_comments": 1779, "post_id": "15t736u", "score": 1929, "subreddit": "careerguidance", "text": "\"I thoroughly enjoy my job right now. I am an individual contributor that makes 140k yearly. I\\n\\n\\u2019ve been offered a job at another company for 210k plus 20% bonus, but the culture isn\\u2019t great and I would be in a management position? \\n\\nI\\u2019m in my early 30\\u2019s.\"", "title": "Do I leave a job that I love where I make 140K for a soul sucking management job that pays 210k and a 20% bonus?", "upvote_ratio": 0.89, "url": "https://www.reddit.com/r/careerguidance/comments/15t736u/do_i_leave_a_job_that_i_love_where_i_make_140k/"}, {"author": "Everina52", "created_utc": 1681832916.0, "link_flair_template_id": "682e2d40-78e2-11ea-b9b2-0e4e69ee6911", "link_flair_text": "Advice", "num_comments": 2447, "post_id": "12qsrn0", "score": 1905, "subreddit": "careerguidance", "text": "\"I\\u2019m genuinely curious! And if so, what industry/role are you in? \\n\\nI\\u2019m in an Executive Assistant/PA role in a very corporate environment and I hate it. I want to start applying for new jobs but I\\u2019m keen to try something new and don\\u2019t know where to start.\\n\\n For background this is my first office job after graduating university (UK) and I\\u2019ve been in the role for 18 months (including a promotion to my current role) \\n\\nI don\\u2019t have a \\u201cdream job\\u201d and never have; but I would like to do something that gives me a  little bit of job satisfaction and still has a good work/life balance \\n\\nCurious if anyone has found a good in between; a job they like, even with its ups and downs, and that pays the bills?\"", "title": "Does anyone actually like their job?", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/careerguidance/comments/12qsrn0/does_anyone_actually_like_their_job/"}, {"author": "None", "created_utc": 1690310953.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 444, "post_id": "159h85c", "score": 1880, "subreddit": "careerguidance", "text": "\"Genuine question here. I\\u2019ve been at my company for over 3 years now. Have taken 2 promotions and have been in the lower ranks of leadership for the last year. \\n\\nI firmly believe I am one of the smartest people at the company and it\\u2019s not something I enjoy. I am not even that smart, just hardworking. As I move up, the conversations have become somehow more unintelligent. Everyone in our \\u201cc suite\\u201d and executive team simply got their promotion because they started the company with our CEO and they\\u2019re friends. None of them have the right experience or education to be in the roles they are in. \\n\\nI am honestly just curious if other companies like this exist. I\\u2019m shocked daily that we are even functioning. Do any of you feel like your whole company is unintelligent?\"", "title": "Does anyone else feel like their whole company is stupid?", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/careerguidance/comments/159h85c/does_anyone_else_feel_like_their_whole_company_is/"}, {"author": "None", "created_utc": 1684723038.0, "link_flair_template_id": "682e2d40-78e2-11ea-b9b2-0e4e69ee6911", "link_flair_text": "Advice", "num_comments": 533, "post_id": "13oe0rt", "score": 1849, "subreddit": "careerguidance", "text": "\"I liked studying accounting in school. I was so proud of myself as a first generation grad. \\n\\nBut man I struggle in the real world. I tried, i really tried. Pomodoro, priority matrix, daily calendars, post-it notes galore, carrying a notebook around so often it seemed like its glued to my hand. \\n\\nBut I still couldnt hack it. I try my very best to prioritize, to stay focused, to follow my notes exactly. But theres always some small misstep I end up taking. Theres always a deadline i miss because i got excited about solving a very difficult problem from a different task and lost track of time. Theres always moments when im internally screaming at myself to start a task but just cant, so I end up behind. Im always struggling to juggle multiple projects. \\n\\nAnd im not sociable. I go to happy hours, but im awkward as fuck, no matter how pleasant i try to be. I cant \\u2018click\\u2019 with a lot of people. I really want to connect with people, but i just have a hard time getting out of my head and engaging fully with the other person/people. Explaining things verbally is rough. I have no problems typing, but theres a road block in-between my brain and my mouth. \\n\\nIm just in a dark place after failing. I got crushed, absolutely demolished by my public internship. And now im in an easy industry gig, and still fucking failed.\\n\\nIf you read any of this, thank you kind internet stranger. So enough self pity, what are some other fields I could go into with my Bachelor\\u2019s in Accounting? Could I do something non-corporate? I don\\u2019t think i\\u2019m cut out for that life\"", "title": "Recent grad, getting fired from my 2nd Accounting job in a row. Where can I go from here?", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/careerguidance/comments/13oe0rt/recent_grad_getting_fired_from_my_2nd_accounting/"}, {"author": "Significant_Till_718", "created_utc": 1692639964.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 1177, "post_id": "15xelnz", "score": 1827, "subreddit": "careerguidance", "text": "\"Girlfriend wants me to quit my weekend gigs\\n\\nI currently have two jobs. \\n\\nFirst, I have been working for a male stripper company for 13 Years (I'm currently 37 yo). I started as a dancer, but now I am on a salary where I make about $1100 per week consistently just working Friday and Saturday nights as the manager and MC for this male stripper show. \\n\\nSecond, I am a mechanical engineer, I just graduated in Dec of 2021, and am making about $72k before taxes at the job I was hired at straight out of school.\\n\\nThe weekend job is EASY, and after taxes, the two jobs pay just about the same, which means the weekend job DOUBLES MY INCOME. \\n\\nI met my girlfriend at the weekend job where she asked me to come out with her after the show and I declined since I always go home after those shows. We met up later that week for a date. I say this because she knows I don't get into any nonsense trouble at the weekend job, faithfulness is not the issue, the time is the issue. \\n\\nWe have weekday nights together and we have all day Sunday together. She even comes to some of the shows with me. It's fun, it's not gross like some would assume a stripper job is. I'm the manager, not one of the dancers anymore. \\n\\nShe wants me to give up that 2nd income so we can have more time together. I'd like to keep the job a few more years until my mechanical engineering career pays more. \\n\\nIf I quit the weekend job, I can never get it back, and I know I will never find another gig that pays so much so consistently once I give it up. \\n\\nDo I risk losing her to keep the income, or give up the income and then if things go south with the girlfriend I'm now on my own with half the income I could be making?\"", "title": "Should i quit my weekend job for my gf?", "upvote_ratio": 0.93, "url": "https://www.reddit.com/r/careerguidance/comments/15xelnz/should_i_quit_my_weekend_job_for_my_gf/"}, {"author": "Icy_Mathematician749", "created_utc": 1672927412.0, "link_flair_template_id": "682e2d40-78e2-11ea-b9b2-0e4e69ee6911", "link_flair_text": "Advice", "num_comments": 1273, "post_id": "103zoxh", "score": 1770, "subreddit": "careerguidance", "text": "\"When I was 22 I earned extra cash by doing porn with older men. It was also because it was a fun side thing. I didn't have any money issues. The videos became somewhat popular. \\n\\nNow, I work in management consulting and recently I was promoted to manager. I am afraid my colleagues, supervisor, partners and clients discover that I am in some videos online. How can I prevent these videos from destroying my career? I started feeling anxious about this when a friend asked me if I was ever afraid of everyone knowing it. I'm feeling super anxious now. I like my current job a lot.\"", "title": "I did porn when I was 22. How can I prevent from being fired now?", "upvote_ratio": 0.89, "url": "https://www.reddit.com/r/careerguidance/comments/103zoxh/i_did_porn_when_i_was_22_how_can_i_prevent_from/"}, {"author": "None", "created_utc": 1621099082.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 203, "post_id": "nd3r9i", "score": 1739, "subreddit": "careerguidance", "text": "\"There is nothing wrong with not working for 3 months. Stop pressuring people to divulge irrelevant personal information or craft a palatable excuse for existing outside of a corporate environment for a few months.\\n\\nIn the grand scheme of things, a few months or even a year is an incredibly short amount of time when compared to the average 40 year life-span of a career.\\n\\nWhat\\u2019s everyone\\u2019s thoughts on resume gaps? Stay at home parents, how do you address the gap on your resume?\\n\\n\\u2014\\n\\nUpdate: Thank you all for contributing your perspectives. I\\u2019m relieved to see that the majority of you agree with the sentiment of this post. Your comments make me hopeful for a more empathetic and balanced workplace in the future. Big thank you to whoever gave me the awards!\"", "title": "Can we all agree to normalize gaps on resumes?", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/careerguidance/comments/nd3r9i/can_we_all_agree_to_normalize_gaps_on_resumes/"}, {"author": "ashleymichellem2", "created_utc": 1691625644.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 828, "post_id": "15mw2j2", "score": 1732, "subreddit": "careerguidance", "text": "\"Hey Y\\u2019all. I don\\u2019t know what to do anymore. My supervisor just told me staff feel I\\u2019m \\u201creally hard to work with\\u201d. He was unable to provide specific examples but told me each discipline I work with had this blanket view. For context I\\u2019m 28(F) and work as a group therapist in inpatient psych. I\\u2019ve been in the role now for 10 months. My supervisor only told me that because I said, \\u201cI feel like you only ever call me into your office for constructive feedback do you have any positive feedback for me\\u201d and their response was \\u201cWell, your coworkers find you really hard to work with\\u201d. I was crushed and still am. I actually began to cry in his office which I hate because then, I lose all focus on being able to ask questions. I asked for bi-weekly supervision with my supervisor to help me address the concerns to show I\\u2019m serious about changing my coworkers views of me, but I\\u2019m honestly defeated. I\\u2019ve been told my whole life people don\\u2019t like working with strong women who think logically before emotionally and here I am at another job facing the same issues that people don\\u2019t like me. When I look back on all past jobs I\\u2019ve had, I\\u2019m obviously the common denominator. I\\u2019m quick to think of my feet, am always observing, paying attention, and recognizing patterns of behavior. Coworkers come to me for advice and if they have a question about something when the charge nurse is unavailable but now I feel like I can\\u2019t do any of that. I feel like I\\u2019m going to have to change my whole personality to fit into a job where people don\\u2019t like me. The more advice you can give me will be helpful. Thank you all so much for reading and responding to my post.\\n\\n\\nEdit: \\nThank you all for responding. Some of you posed some very helpful feedback which gave me time to reflect on the following: my co-therapist does her job to the job description and does it well. With that staff don\\u2019t complain about her. I extend myself beyond my role to provide additional support. I believe it comes across as stepping on people\\u2019s toes. I need to work on staying in my lane and just defer things to the correct department if the staff is unable to come to a conclusion themself. I have a habit when staff come to me of just making decisions and going with them. That\\u2019s not a leader. That\\u2019s someone who\\u2019s pushy and hard to work with. Additionally, many of you have commented on it\\u2019s how I say things I believe that to be true as well. I want to pay close attention to my tone and body language. I would also like to improve on being less direct as that is not a preferred communication style. Also, if anyone has tips on how to fix RBF that\\u2019d be great too. Some of you mentioned books to read and I\\u2019ll be ordering those! Lastly, about my manager. It\\u2019s his managerial style to not provide examples even when asked for them. It\\u2019s actually a consistent theme I\\u2019ve heard most staff say about their managers where I work. But I\\u2019m hoping the supervision allows me to get his thoughts on my barriers to improving so people find me easier to work with. I don\\u2019t need to be liked by the people I work with but what is important is they need to be able to tolerate working with me. If people are really saying I\\u2019m that hard to work with then, I need to adjust. It will take time but I want to do it.\\n\\nEDIT 8/12: Well y\\u2019all. I wanted to give you an update as I talked to a trusted coworker of mine about my interaction. My coworker has seen many other staff quit under my boss after being treated similarly to me. What didn\\u2019t occur to me is prior to the meeting with my boss is he had met with his boss about his own performance review which I was honest on and as he only supervises around 10 employees it\\u2019s easy to see who says what based on feedback. Additionally, he knew I had talked to his boss already about not feeling like I had a future at the company under his supervision. Even though I see where I need to change, I\\u2019m now concerned I need to find a new job as it seems he has his sights set on getting me to quit.\"", "title": "28F was told I’m “really difficult to work with” by my supervisor… how do I recover from this?", "upvote_ratio": 0.9, "url": "https://www.reddit.com/r/careerguidance/comments/15mw2j2/28f_was_told_im_really_difficult_to_work_with_by/"}, {"author": "None", "created_utc": 1684204584.0, "link_flair_template_id": "682e2d40-78e2-11ea-b9b2-0e4e69ee6911", "link_flair_text": "Advice", "num_comments": 1089, "post_id": "13iskpq", "score": 1716, "subreddit": "careerguidance", "text": "\"Hello! Hopefully my question isn't too broad for this sub. Basically I pulled the \\\"play video games in your parents' basement\\\" special until I was 28 years old. I have literally never had a job. I was never schooled as a child, so recently I studied on my own to get my GED. I'm now wanting to find a solid career.\\n\\n**TL;DR**: I've no money, no resume, and live in the middle of nowhere. I do have free housing and food from my family, so I can live off of smaller jobs, but at the same time, I'm only interested in doing things that I can trust will lead to a good career down the line. What's your recommended path for me to get to a reasonable paying job at some point in the future (it doesn't need to be now, I'm fine working my way up and don't have immediate financial duress)? Please keep in mind, I know practically nothing of \\\"the outside world\\\", I'm basically a child in this regard (sad, I know). I'm seeking advice on what direction I should take my life.\\n\\nMore specific details:\\n\\n**My situation**: I still live with my parents. I have $0 in the bank, but my parents will let me stay here as long as I like (I'm very helpful). I'm in a small town in Oregon (removed specific town on suggestion), 600ish people. Nearest town of 15k+ is 45 minutes from here, nearest city of 100k+ (in Washington) is like an hour 20 minutes. Portland is 2 hours. I have no friends, no connections, nothing.\\n\\n**Me as a person**: I'm physically strong and tall, but have terrible balance (I have a vertigo-like thing where I will randomly nearly fall over from dizziness/light-headedness, ladders/heights are a complete no-go until I resolve this). I'm reasonably intelligent, but I'm bad at memorizing things (especially just being shown or told, if I do something I remember it more effectively). I'm a mild introvert, but not so much that I'm unwilling to do a job that has heavy personal interaction (I just might be bad at it lol). I'm articulate, but I'm not charismatic at all.\\n\\n**My goals:** My only goal in life is to have a family. Don't even have a girlfriend (don't even know if there are any single women near my age in town lol), so I've got a ways to go. I want to be able to support them and give them a good life. I have no particular desire to make 6 figures or make it big. I just want decent income and a job that's either secure or in demand so I don't have to stress too much about everything falling out from underneath us (I understand, starting this late in life, I may not have this luxury, but it's still my desire).\\n\\n**My ideas**: I've considered Web Development (self taught from home, following The Odin Project, which I'm already a fair ways into), trying to find a way to go to college to become a Dental Hygienist (the nearest college for me would be 1 hour 40 mins away, and I think there'd be lots of pre reqs which means it might be a 5 year process for me, but honestly I don't know how colleges work and I doubt that career is worth that much money/time), or just getting a job and spamming applications constantly at better places to try to work my way into a good job (e.g. starting at Walmart and trying to get into Costco, both of which are an hour away from me lol).\\n\\nAnyways, rambling post, sorry. I really, really need help and no one in my family can help me with plans for the future, so I'm hoping one of you can help someone who is completely lost. Thank you for reading (if anyone does lol, I'm sure you guys get these posts 24/7).\"", "title": "28, never had a job, live in a rural area. What's a path for me to a career that can support a family?", "upvote_ratio": 0.93, "url": "https://www.reddit.com/r/careerguidance/comments/13iskpq/28_never_had_a_job_live_in_a_rural_area_whats_a/"}, {"author": "cangsenpai", "created_utc": 1659980164.0, "link_flair_template_id": "682e2d40-78e2-11ea-b9b2-0e4e69ee6911", "link_flair_text": "Advice", "num_comments": 556, "post_id": "wjexgq", "score": 1698, "subreddit": "careerguidance", "text": "\"The most privileged post in the world, but I feel crazy. I get paid very well to do a job that shouldn't exist (data analyst) because there was no need for it. I have no projects. No emails. No meetings. I talk to the same 2 people each week. I might get one email a day if I'm lucky, and usually I'm cc'd for reference.\\n\\nDo I need to learn to accept it? Am I crazy for wanting the normal stress of a job? I'm so bored that my mind feels rotten.\\n\\n\\nUpdate: I found a new job. Been working nearly two months now and it is objectively better. I earn slightly more, but my job is significantly more fulfilling. I'm busy but not stressed. Since moving on, I have almost forgotten how horrible it was to do nothing. Thank you for those who understood or tried to understand. The solution seemed to be making the change myself.\"", "title": "I get paid well to do nothing. Am I crazy?", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/careerguidance/comments/wjexgq/i_get_paid_well_to_do_nothing_am_i_crazy/"}, {"author": "None", "created_utc": 1682019978.0, "link_flair_template_id": "682e2d40-78e2-11ea-b9b2-0e4e69ee6911", "link_flair_text": "Advice", "num_comments": 470, "post_id": "12tcwhx", "score": 1692, "subreddit": "careerguidance", "text": "\"Hello, I'm a sixteen year old sophomore currently in high school, well, not anymore, but my parents at the beginning of this year sporadically took me out of high school and put me into homeschooling because they were set on having our 6 family members plus two cats and a dog live in an RV and travel around the country, while my dad does an online job and my mom does nothing. I bet most of you can agree this is a very stupid decision. The plan was for my parents to sell our house for around 150,000 USD and then use that money to purchase a high-end RV or trailer and get a truck to move said trailer.\\n\\nThis definitely wouldn't be enough money at all and I told them this, but they continued to deny this. I also had all A's at my public school, and I was continuing to join around 3 or 4 clubs and gather more promising electives like Speech and Debate and Weight Training to put those on a college resume and either get a job for music, photography, or film. I was starting to plan out my life more and more, but because of this decision to move with an RV everything was falling apart for me, I didn't know what to do, as every time I brought this up to them they would scream at me or tell me I'm brainwashed by my school. A giant reason for them taking my siblings out of public school and eventually me is because the school had students wear masks for a month due to the government's COVID-19 regulation.\\n\\nThis was only for a month so I had no problem, and I went on through my school year like normal, expecting to come back next year, yet they had ripped my accounts out of the school system and my parents instead signed me up for an education course on Khan Academy. No textbook supplements, no tutoring, no online OR in-person teaching. Just them handing me this website and telling me \\\"Do what you were going to do last year. \\\"I am enraged, and I've tried to make the best of this as my school will not take me back until maybe next year, and even then I'll be held back. I am known as a \\\"gifted kid\\\" so what they have done is set my motivation, progress, and everything back a lot. I've expressed this and have been met with internet restrictions, being told I'm brainwashed and a follower, had my phone taken away and messages searched through, and been forced to do and say things to people I love outside of my family without my control. Anyways, back to the main point, I just don't know what to do anymore. Right now my dad has me working on an essay on Mao Zedong (has no relevance to the history I am learning or my English at all, simply based on what HE finds interesting), and working on Khan Academy Geometry and Physics. (I have barely learned up to Congruence and haven't even done gravitational equations for physics)\\n\\nI'm fearful I might have to go to an alternative school or be held back a grade, which would look awful on a college resume and might screw up my motivation to go to college altogether.\\n\\nI'm just asking if anyone here has had a similar situation, if this is not the right place I apologize, but I am in need of urgent help on how to get myself out of this and find a good career path. Thank you. :)\\n\\nEdit: I am ecstatic, thank you all for the support and comments and holy shit I've never gotten this many comments or anything. I'm gonna try a lot of these and maybe I can get out of these hellhole. THANK YOU ALL SO MUCH AGAIN!!! :D  \\n\\n\\n Edit 2: Hey everyone! (thanks for the platinum and ALL OF THE AWESOME COMMENTS!) I'd like to say me and my girlfriend have read most of the comments here and have come up with a sort-of plan (in the works currently) but yeah  \\n To ease your minds, here it is:   \\n I'm going to continue through this, ignoring my parents' schooling and work towards studying the ACT/SAT, improving the knowledge I need to get a GED, which after I turn 18 I will get my GED, then go into Community College, and then State College   \\n My girlfriend is a year older than I, so once she graduates high school and is 18, she will have her license and enough money for a studio apartment. I'm going to get one or two jobs through programs like Goodwill Connects and maybe just earning money on the side (I have a few ways to do this.)  \\n With these jobs we can split the rent of the studio apartment and then we can try to get me emancipated at 17, and then I can move on with my life and continue as planned! :)\"", "title": "I'm 16, my parents took me out of public school because of masking, what should I do to further my education?", "upvote_ratio": 0.9, "url": "https://www.reddit.com/r/careerguidance/comments/12tcwhx/im_16_my_parents_took_me_out_of_public_school/"}, {"author": "LeaveElectrical8766", "created_utc": 1689728944.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 938, "post_id": "153gctt", "score": 1682, "subreddit": "careerguidance", "text": "\"TLDR: CEO gave me a minor talking to for NOT bringing homemade cookies when I visited the southern office.\\n\\nSo I'm in IT but I enjoy baking for fun and friends. So for holiday parties or just because I felt like it I'd randomly bring in my Great grandma's chocolate chip cookies (that I made but her recipe.) Not often, only a couple times a year, 5 on the extreme end.\\n\\nEveryone LOVES them even people who claim to not like cookies normally.  \\n\\nRandomly my job sends me to the southern office and I'd randomly bring them cookies as well when I got there. Well apparently I didn't do it the last two trips and someone in the southern office felt this warrented a complaint to the CEO since this hurt their feeling!  Now granted this is a sub 50 person company and the CEO has an open door policy. But comeon really?  \\n\\nSo the CEO tells me that people complained last time that I was down there that I didn't bring them cookies and I needed to make it right next trip.  WHAT THE BLAZES! \\n\\nI can't be the only one who thinks this is crazy petty and disappointed both in my southern coworkers and in the CEO that he didn't tell them to just be thankful when I do bring them.\\n\\nI'm not going to disobey the CEO, but you better bet that I'm going to be mixing and baking them on company time now. I was ordered to make them by the CEO so it's Buisness time now. \\n\\nThoughts on if this is crazy or not?\\n\\nEdit: For clarity it wasn't a write up or anything, but his tone was a cross between annoyance that he had to deal with this and wanting me to make it go away, and unbelief that he had to deal with this in the first place.  Not his joking/teasing tone. That tone is very distinctive.\\n\\nEdit 2: correcting autocorrect.\\n\\nUpdate: Man this blew up!  So a couple of things to clarify from the comments and an update.\\n\\n1. I'm male, for those who find that weird Gordon Ramsay would like a word with you.  Also the deer on my wall at home don't care. \\n2. The southern office is in the southern part of a northern state and we're in the northern part of the same state so we call it the southern office.  So all the true southerners are off the hook.\\n3. The CEO is technically out of both offices but primarily out of the northern office.  This was apparently caused by a southern office coworker who he won't name assuming that the northern office got the cookies all the time and this got their feeling hurt that they didn't so they decided to complain to the CEO that I wasnt being fair in my cookie distribution and that I was insulting the southern office by not bringing them.... \\n\\nI almost wish my imagination was good enough to make this up.\\n\\nUpdate: So I told my immediate supervisor about this, this morning and his response was about this, \\\"I wish I couldn't so easily believe that the southern office could be that petty but I can.  Well if the CEO wants you to make cookies you're making cookies. If he doesn't like it then he should have stood up for IT against this stupid pettiness.\\\"\\n\\n\\nFinal update:  Oh man did this blow up WAY more than I expected. I appreciate everyone's advice. Some more than others.  \\n\\nTo those who took the time to phrase things professionally, you have my thanks for ideas on how to say it.\\n\\nTo those who suggested adding extra to the cookies or intentionally messing them up.  Ya no, I'm not disrespecting Great Grandma's cookies like that.  \\n\\nMy immediate supervisor is, irritated shall we say, with the southern office but more irritated with the CEO for not cutting it off at the source.  (Apparently word of the complaints reached him after I told him from a different source.) So he's onboard with me making them on company time.  Just irritated with everyone EXCEPT me and agrees with me that this whole thing is stupid.\\n\\nThe irony is I was already planning to make a batch for the southern office for my trip next month, AND I ALREADY had finished dough in the freezer for a northern office batch. \\n\\nI'm thinking this'll be my last batch and when people ask I'll let them know that the southern office complained so I stopped baking for both so no one has anything to complain over. \\n\\nYes it'll cause some minor office drama, but it'll be against the southern office generally and not me for as others have said, \\\"ruining a good thing by complaining.\\\" \\n\\nTo those who found this hilarious, I suspect that once I have some distance from this I'll agree with you.\\n\\nThank you to everyone and I hope you all have a great rest of your week and may any discussions with your CEOS be smoother than mine and drama free!\\n\\nFinal final update!  I mean it!\\n\\nNo I'm not going to share the recipe. It's Great grandma's recipe. Not even my girlfriend gets the recipe until the I dos have been said.\"", "title": "I got a talking to by the CEO for WHAT?", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/careerguidance/comments/153gctt/i_got_a_talking_to_by_the_ceo_for_what/"}, {"author": "questionssnanswerss", "created_utc": 1601444971.0, "link_flair_template_id": "682e2d40-78e2-11ea-b9b2-0e4e69ee6911", "link_flair_text": "Advice", "num_comments": 188, "post_id": "j2ggvd", "score": 1640, "subreddit": "careerguidance", "text": "\"I\\u2019ve been so miserable at my job for the last few years but can seem to bait a new lead. I\\u2019ve been searching for a year with no luck. It\\u2019s come to this point and I feel stupid for staying but stupid for leaving.\\n\\nEdit: I thought I was the only one that felt this way. Thanks for sharing everyone.\"", "title": "Does anyone else hate their job so much that you try to stay up late just so you can avoid the next day coming?", "upvote_ratio": 0.99, "url": "https://www.reddit.com/r/careerguidance/comments/j2ggvd/does_anyone_else_hate_their_job_so_much_that_you/"}, {"author": "Final_Perspective49", "created_utc": 1688916613.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 931, "post_id": "14v1fos", "score": 1624, "subreddit": "careerguidance", "text": "\"I'm 15 and this was my first job at a food place. I wasn't really trained on anything but expected to know the menu and how to use the register. There weren't any employees to train me because there were only 3 employees there besides me. When I made a mistake on the register my manager pulled me aside and started screaming at me. I had to use the bathroom and started crying. Am I being too sensitive? Is this normal to be yelled at on the first day?\\r  \\n\\r  \\n\"", "title": "Normal to be yelled at on first day?", "upvote_ratio": 0.94, "url": "https://www.reddit.com/r/careerguidance/comments/14v1fos/normal_to_be_yelled_at_on_first_day/"}, {"author": "Fun_Budget4463", "created_utc": 1690256151.0, "link_flair_template_id": "682e2d40-78e2-11ea-b9b2-0e4e69ee6911", "link_flair_text": "Advice", "num_comments": 855, "post_id": "158wiqd", "score": 1622, "subreddit": "careerguidance", "text": "\"10 years ago I was finishing a high powered internship. I was ambitious and had built a powerful CV. My dream career was idealistic, international, exciting, and notoriously poorly paid. I was never motivated by money. I was pretty committed to social justice, but really, I sought adventure, growth, and if I\\u2019m being honest, power. Then I met, married, and started a family with a woman. Early in our relationship I convinced myself we had similar goals, but I think she was just reflecting my passions back at me. When we had our first child she became much more resistant to moving away from family to pursue career opportunities. Therefore at the end of my internship I convinced myself to take a lucrative local job. It was supposed to be a short term station.  Of course, short term stretched into the decade, as there was always something making \\u201cnow\\u201d not the right time to move. The pay has remained great, and it has made family building easy. But it isn\\u2019t what I trained to do, nor what my ambitious younger self dreamed of doing. Now, with a house full of kids, I work the same job, without any real chance for promotion, and I have lost all my passion. I feel like I gave up, sold out, and settled for less than I deserved. I have real responsibilities now. I have kids, and I have the ability to provide them with stability and a good education. I\\u2019m not just going to walk out on that role. So maybe this is just a mid-life crisis. But I feel like a complete violation of the principles and dreams I had as an idealistic and ambitious youth. Anybody else had this experience? What did you do? How did you make peace with it all?\"", "title": "I took the money and I regret it. How do I find peace with “selling out?”", "upvote_ratio": 0.88, "url": "https://www.reddit.com/r/careerguidance/comments/158wiqd/i_took_the_money_and_i_regret_it_how_do_i_find/"}, {"author": "Impossible-Cold5232", "created_utc": 1686949272.0, "link_flair_template_id": "682e2d40-78e2-11ea-b9b2-0e4e69ee6911", "link_flair_text": "Advice", "num_comments": 833, "post_id": "14b7yoy", "score": 1602, "subreddit": "careerguidance", "text": "\"Please don\\u2019t start suggesting onlyfans. This body grew two very large babies, trust me they are the only fans. \\nI\\u2019ve been a stay at home mom going on 5 years now, and my job before that was my first and only job I had for 7 years. \\nI don\\u2019t have child care so I need something I can do from home while taking care of my children.\"", "title": "I’m a stay at home mom who needs income?", "upvote_ratio": 0.91, "url": "https://www.reddit.com/r/careerguidance/comments/14b7yoy/im_a_stay_at_home_mom_who_needs_income/"}, {"author": "Mage2177", "created_utc": 1691648050.0, "link_flair_template_id": "682e2d40-78e2-11ea-b9b2-0e4e69ee6911", "link_flair_text": "Advice", "num_comments": 1228, "post_id": "15n40m0", "score": 1600, "subreddit": "careerguidance", "text": "\"I currently drive 55 minutes one way to work.  So a total daily commute of close to 2 hours.  I work night shift and only see my family maybe 20 minutes to an hour a day during school months.  I am not good at night shift, it doesn't mesh with me well.\\n\\nI got offered a position that's a promotion with another company.  \\n\\nMy current salary is 115,000.  My new salary would be 150,000 not including bonus.  \\n\\nThe drive to the new company would be around an extra one hour commute total.  So 3 hours of driving a day.\\n\\nNow I know it's a lot, but with this economy, I feel it's worth consideration to make the extra drive and literally not have to worry about money everyday.\\n\\nCurrently, money is tight, paycheck to paycheck and not being able to really save up anything.  So every year I feel like I am no closer to retirement.  Moving is not an option currently and it is a dayshift position.  That means, even though I'm giving up more of my time, I would be able to see my family for 3.5 to 4 hours a day, as opposed to 30 minutes to an hour a day on night shift.\\n\\nLastly, in my current position there is not really any upper mobility currently.  The closest move I will be able to make will be around 1 to 1.5 years away, and the pay raise would be around 15,000 to 20,000 dollars, and it is a day shift position.\\n\\nWhat should I do?  Any advice appreciated.  Thanks.\\n\\n&#x200B;\\n\\nEdit:  Just wanted to tell everyone that you are making some very good points.  And that I'm very appreciative of you taking the time to give me some advice.\\n\\nEdit 2:  I'm getting dm's asking about what I do and how much money I would actually be making if I took the job.\\n\\nI work in manufacturing.  Pretty much what I do, is manage manufacturing.  My job is to essentially take a manufacturing plant, and find ways to increase productivity, make it more efficient, and make sure it hits all of it's targets for a fiscal year.\\n\\nEdit 3:  Added salary to stave off questions due to me being vague.\\n\\nEdit 4:  Just woke up.  Can confirm that night shift sucks lol.\\n\\nAlso questions on why current salary is tight.  You make more you spend more.  Also, poor financial decisions in my 20\\u2019s.  That is almost rectified now (pretty close to paying off through debt consolidation).  This job would also allow me to finish paying that off and free up more disposable income.\\n\\nEdit 5:  I will update on this sub whenever I make a decision, or I'll update on how everything is going.\"", "title": "(38M) Is an extra $30,000 to $40,000/year worth an extra one hour commute?", "upvote_ratio": 0.91, "url": "https://www.reddit.com/r/careerguidance/comments/15n40m0/38m_is_an_extra_30000_to_40000year_worth_an_extra/"}, {"author": "Myusernameistakennn", "created_utc": 1689201432.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 681, "post_id": "14y313x", "score": 1587, "subreddit": "careerguidance", "text": "\"\\nI work in healthcare. \\ud83d\\ude44 I\\u2019ve been at my job for 11 months. We got a new manager last month, and since I do not have enough PTO in the bank \\u201cright now\\u201d she denied my 5 days off request for August. I have my ticket and whole trip paid for. Which, I told her it was already paid for. Plus, I have coverage while I will be gone. I do not have enough Pto right now because of 4th of July, had to come out of my PTO. And an unexpected funeral had to come out of my PTO since it was not \\u201cimmediate family\\u201d (was my uncle) \\n\\nWhat do I do? Just go and deal with it later. Cause of course I\\u2019m going. I just need to know what to tell her, and still have a job when I get back.  I\\u2019m Located in Texas.\\n\\nUpdate: thanks guys!!! IM GOING ON VACATION. It\\u2019s unpaid but still going \\ud83e\\udd79 Some of y\\u2019all are supportive, the rest of y\\u2019all I don\\u2019t know what happened but y\\u2019all suck and are not helpful \\ud83e\\udd23 also, I am not a nurse just fyi. I\\u2019m X-ray tech. Buttttt\\u2026.. Boss\\u2019s boss approved it , she did not like that, but made my day. Hehe \\n\\nIf you want to buy me a coffee , check on profile. I\\u2019ll definitely need it leading up to my trip \\ud83e\\udd23\"", "title": "I’ve been at my job 11 months. We got a new manager one month ago. She denied my vacation in august, trip/plane ticket is already paid for. What do I tell her?", "upvote_ratio": 0.93, "url": "https://www.reddit.com/r/careerguidance/comments/14y313x/ive_been_at_my_job_11_months_we_got_a_new_manager/"}, {"author": "Sensitive_Estate_672", "created_utc": 1689189246.0, "link_flair_template_id": "682e2d40-78e2-11ea-b9b2-0e4e69ee6911", "link_flair_text": "Advice", "num_comments": 516, "post_id": "14xxrli", "score": 1571, "subreddit": "careerguidance", "text": "\"I\\u2019ve been working at a small startup around 60 people or so, we all know each other well. Recently we expanded our teams and this added a new manager for me, this is ok, however for the past month I have been getting all my tasks taken away and given to my new manager in the last 3 weeks my work load has been mostly training my manager on my tasks and responsibilities. \\nI stopped getting replies on teams and whenever I ask about what to focus on they say to keep training my manager and to hold tight. I was also not invited to a recent in office meet up claiming it was a spur of the moment. \\n\\nI know the writing is on the wall, we missed our numbers and I am clearly not part of their plans moving forward.\\n\\nWhat I don\\u2019t understand is why not just fire me? \\nI can withstand the bad treatment for months if I am getting paid still. It\\u2019s making my weekly visit to the office much more challenging too and awkward because my old boss is there and makes sure to \\u201cbe busy\\u201d to give me the time of day but I am not a quitter.\\n\\nAny thoughts? TIA\"", "title": "Why won’t they just fire me already?", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/careerguidance/comments/14xxrli/why_wont_they_just_fire_me_already/"}, {"author": "duenebula499", "created_utc": 1685635935.0, "link_flair_template_id": "682e2d40-78e2-11ea-b9b2-0e4e69ee6911", "link_flair_text": "Advice", "num_comments": 1173, "post_id": "13xlpjr", "score": 1552, "subreddit": "careerguidance", "text": "\"\\n\\nTitle kind of says it all, but to give context I just found out after working at my current position as a in store technician that I was hired solely because the boss and her daughter thought I was easy on the eyes. Same goes for my coworkers as well, and that was also the reason I was never even interviewed despite having 0 experience when I was hired. On one hand I\\u2019m flattered, on the other this feels wildly unfair as I found out when a prospect was turned down primarily for their appearance and weight. Not sure if this is the correct sub for this, but how would you all react to this information?\\n\\n\\nEdit: Wow, I am really blown away by how common this kind of thing is. A bit depressing ngl\"", "title": "Found out I only got my position because of my appearance, how should I react to this?", "upvote_ratio": 0.9, "url": "https://www.reddit.com/r/careerguidance/comments/13xlpjr/found_out_i_only_got_my_position_because_of_my/"}, {"author": "RawSlee", "created_utc": 1696696622.0, "link_flair_template_id": "682e2d40-78e2-11ea-b9b2-0e4e69ee6911", "link_flair_text": "Advice", "num_comments": 1331, "post_id": "172al3z", "score": 1554, "subreddit": "careerguidance", "text": "\"Hey guys I would love to hear some opinions. I started working at Costco when I was 18 years old and haven\\u2019t left. I\\u2019m topped out now making 28$ an hour and next year I start to get bonus checks twice a year for $2500 (gets bigger every year). \\n\\nAlso every year Costco reviews how much we get paid and usually gives us a \\u201ccost of living\\u201d raise. Next year I\\u2019ll be at 29$.\\n\\nIt\\u2019s also almost impossible to get fired from my job unless you do something completely idiotic and I don\\u2019t see Costco going anywhere anytime soon. So I have good job security as well. I get great health insurance and 3 weeks PTO and will get more in the future. \\n\\nI honestly don\\u2019t mind my job and the people I work with. I get a good workout and get home at 1:00 pm everyday and have the rest of my day to myself. \\n\\n\\nI tried to go to school for I.T and hopefully one day go to cybersecurity to make lots of money  but honestly I didn\\u2019t enjoy it and it bored me a lot.  \\n\\nI do dream of making 6 figures or more one day but I\\u2019m thinking what if I just did something on the side and made some extra money to bring me to 100k or more. I have a lot of free time after work. Would love to hear any insight. Thank you.\"", "title": "24 years old. Making 28$ an hour at Costco and get bonuses next year. Would you guys stay or look for something else ?", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/careerguidance/comments/172al3z/24_years_old_making_28_an_hour_at_costco_and_get/"}, {"author": "JacksAgain", "created_utc": 1682605854.0, "link_flair_template_id": "682e2d40-78e2-11ea-b9b2-0e4e69ee6911", "link_flair_text": "Advice", "num_comments": 559, "post_id": "130nyo6", "score": 1545, "subreddit": "careerguidance", "text": "\"Context: I work a six figure job for a for-profit company with a monopoly in its market. As with all monopolies, this one is especially poorly run; it's mainly politics over results. Last October, I had a job offer elsewhere for a 13% raise. When I announced this to my boss, she gave me an immediate 17% raise and a verbal promise of a promotion \\\"come 2023\\\". She constantly dropped hints that I was on my way up. She was always gloating about my performance, critical thinking skills, always happy, and whenever I asked her how I could improve, she'd tell me there's nothing to improve. Now she's done a 180: she took an outside candidate over me for her old position (she was promoted, and it seemed obvious to everyone at the company that I was bound to get her old position), and no hints at any promotion anymore, nothing, and always telling me how I need to improve A, B, and C. I am outraged. I fully trusted her and she broke her promise. I have zero motivation to work and don't see why I can ever believe a word that comes out of her mouth anymore. Leaving for another job that pays better would be a challenge given my current pay. I feel like quiet quitting is the only solution here, but that is not in my DNA; I'm a self starter and constantly looking for solutions and trying to move the organization forward. What the fuck do I do?\\n\\nEdit: when I brought up the fact she had promised me a promotion, she immediately got defensive and reminded me she had accelerated my pay raise. She knows. She knows I know.\"", "title": "Boss betrayed me. What do I do?", "upvote_ratio": 0.93, "url": "https://www.reddit.com/r/careerguidance/comments/130nyo6/boss_betrayed_me_what_do_i_do/"}, {"author": "abovepeach", "created_utc": 1691765452.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 693, "post_id": "15oazvn", "score": 1543, "subreddit": "careerguidance", "text": "\"Apologies if this has already been posted, but I cannot find a thread related to this for the life of me.\\n\\nI put my two weeks in a few days ago and standard procedure is my company will ask for an exit interview. The REAL reason I\\u2019m leaving is because my boss was terrible. She micromanaged me, wasn\\u2019t supportive. and overall very condescending. I\\u2019m sure they will ask why I\\u2019m leaving and I\\u2019m unsure of a professional way to tell them the real reason why, if at all.\\n\\nMy question: do I even bring my real reason for leaving up? And if so, how do I say this in corporate speak?\"", "title": "How to handle an exit interview when your boss is the reason you’re leaving?", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/careerguidance/comments/15oazvn/how_to_handle_an_exit_interview_when_your_boss_is/"}, {"author": "Americasycho", "created_utc": 1689707842.0, "link_flair_template_id": "682e2d40-78e2-11ea-b9b2-0e4e69ee6911", "link_flair_text": "Advice", "num_comments": 588, "post_id": "1537je7", "score": 1526, "subreddit": "careerguidance", "text": "\"My wife is with a company that is all about analytics of every variety.  She's a trainer, has worlds of experience, and also doubles as a university adjunct professor in her off hours.  Everyone in her department at her corporate office look to her constantly for help. \\n\\nIn the past 3 years, she's applied for 7 promotions, with all 7 of them being solicited to her by upper management with encouragement to apply.   The most recent was thought to have been a shoe-in since other people of lesser profiles are getting promoted.  \\n\\nToday's rejection was harsh in that the feedback was 100% all positives, and qualifications, but the admin told her, \\\"I'd like to see you take one more project at work, to diversify.\\\"\\n\\nThey encourage her to apply roughly every 6 months and the same things happen.  I tell her that it might be time to tell them to stop because this is too emotionally damaging.\"", "title": "Wife is 0-7 in promotion interviews, should she bother anymore?", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/careerguidance/comments/1537je7/wife_is_07_in_promotion_interviews_should_she/"}, {"author": "None", "created_utc": 1689121203.0, "link_flair_template_id": "682e2d40-78e2-11ea-b9b2-0e4e69ee6911", "link_flair_text": "Advice", "num_comments": 627, "post_id": "14x8eqw", "score": 1508, "subreddit": "careerguidance", "text": "\"Hi everyone, I recently took a job at a local fast food chain and the general manager was the one who conducted the interview. I want to clarify that I am 17 years old, almost 18 and do not have a car yet. I came 10 minutes late and I profusely apologized for my lateness clarifying that I ride the bus and that the buses were running quite late today.\\n\\nThe interview goes- well, decent. It\\u2019s a fast food place so they are desperate for anyone. She hires me and we talk about hours. I tell her \\u201cmy main form of transportation is (the city\\u2019s bus system), however on occasion my parents can pick me up if something goes awry.\\u201d\\n\\nSo here I think its going well, but I look over at her paper and she writes \\u201ccan work night shifts\\u201d. She was really rushing the interview so I didn\\u2019t think much of it and couldn\\u2019t really get a word in to talk about it. She had an interview scheduled 30 minutes after mine and I already came in late.\\n\\n\\nA few day later I go to orientation and I try to clarify with her, that the bus will be my primary method of transportation, and as such, there is a limit to the hours I will be able to work. (The bus only runs from 6am to 9pm) I tell her my parents picking me up would only be very rarely and the exception to the rule.\\n\\n\\nShe starts talking about how I was \\u201chired under false pretenses\\u201d. She tells me that there are people years younger than me who will be working more hours and will have better availability than me. I tell her that I do not have a car and until I can afford one, the bus will be the only consistent way I can get to work. My parents are not quite as willing as others might be.\\n\\n\\nAt the end of it all I still signed all of the legal documents and paperwork but was honestly holding back tears. I don\\u2019t really know if I want to work here anymore. I know this is somewhat my fault but I feel a little mad. I have a friend who was also recently hired and she was treated much differently throughout the hiring process than me. I don\\u2019t know how to feel. How should I handle this situation?\"", "title": "Gm blew up on me for “lying” during interview. What do I do?", "upvote_ratio": 0.94, "url": "https://www.reddit.com/r/careerguidance/comments/14x8eqw/gm_blew_up_on_me_for_lying_during_interview_what/"}, {"author": "Beta_Nerdy", "created_utc": 1693507936.0, "link_flair_template_id": "682e2d40-78e2-11ea-b9b2-0e4e69ee6911", "link_flair_text": "Advice", "num_comments": 404, "post_id": "166jir0", "score": 1471, "subreddit": "careerguidance", "text": "\"My boss in Cut Throat Washington DC gave me an oral and written warning. He accuses me of doing something that I did not do. I strongly fought these attacks on me. I showed proof that these charges were false but he did not respond. Days later in frustration I put my denial in a formal grievance document which just made him angry.\\n\\n* I worked as the Company Human Resources Manager for a mid sized IT Contracting Company.  I do not have any type of civil service protection because I work for a business.\\n\\nThis is what he said after reading my formal grievance: **\\\"If you would just admit that you messed up and made these terrible mistakes we could move past this and work towards repairing our relationship and improve your performance. But instead, you keep insisting that you did nothing wrong, which I know is false. Why can't you just admit your mistakes so we can move forward?\\\"**\\n\\nI am dumfounded and don't know how to proceed. ***I did not make those mistakes***!\\n\\nOf course I am trying to move to a different job but in the mean time I need to work to pay the rent.\"", "title": "My boss demands that I admit to something that is not true to keep my job (Any Advice?)", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/careerguidance/comments/166jir0/my_boss_demands_that_i_admit_to_something_that_is/"}, {"author": "he2lium", "created_utc": 1691534686.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 531, "post_id": "15lx0m4", "score": 1459, "subreddit": "careerguidance", "text": "\"I found a dream job - the position description matched me to a T and the company is something that I am deeply passionate about (it\\u2019s a subject that launched me into my entire career). However, the posted salary is $100k more than than how much I am wanting to make ($185k vs $285k).\\n\\nI know that it \\u201cdoesn\\u2019t hurt to apply\\u201d but my hesitation is simply with the magnitude of the job. It\\u2019s a big company dealing with things at a national/global level. Most of the employees have PHD\\u2019s and Masters Degrees. The company that I am at right now is very small, but I made my company look pretty damn good. The job is a communications position.\\n\\nWhat do big companies see/think when they see an applicant doing a job at a smaller company? Should I expect to be able to do it? I feel highly competent, but I just don\\u2019t have experience at that size. If found the person who had the job previously and her resume is pretty extensive.\"", "title": "Should I bother applying to a job $100k/yr over my target salary?", "upvote_ratio": 0.89, "url": "https://www.reddit.com/r/careerguidance/comments/15lx0m4/should_i_bother_applying_to_a_job_100kyr_over_my/"}, {"author": "Golden_Daisy", "created_utc": 1704686672.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 459, "post_id": "191c0gn", "score": 1457, "subreddit": "careerguidance", "text": "\"Or am I just dramatic? I keep thinking\\u2014 I\\u2019m not even 30. How can I live like this? I get one life and I\\u2019m gonna dread 70% of it? How is that right?\\n\\nAnd I have a pretty good job that pays well. People I like, nice perks. I just hate the work but it\\u2019s almost too decent for it to make any sense to quit. \\n\\nIs this just adult life? How do more people not flee and go live in the woods?\"", "title": "Does everyone hate their job and dread it every Sunday night?", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/careerguidance/comments/191c0gn/does_everyone_hate_their_job_and_dread_it_every/"}, {"author": "Pugnastyornah", "created_utc": 1637071592.0, "link_flair_template_id": "6901c214-78e1-11ea-96dd-0ebad3a8edc3", "link_flair_text": "Coworkers", "num_comments": 367, "post_id": "qv8jc4", "score": 1450, "subreddit": "careerguidance", "text": "\"Our 3rd coworker in less than 2 months quit Friday. I asked him what\\u2019s next and he said \\u201cthe sun and the sky\\u201d. The other coworkers also didn\\u2019t have a job lined up yet. \\n\\nIt\\u2019s interesting because my boss just a couple months ago was threatening to fire me, partially citing that we were fully staffed, and now we\\u2019re short staffed and she\\u2019s changed her tune with me. I\\u2019m also a full time graduate student so if I quit, I\\u2019d be just fine between student loans and landing an assistantship/ part time gig. \\n\\nThis great resignation movement seems to be the real deal. Unemployment data is being released on Friday and I\\u2019m very curious of the results.\\n\\nThere needs to be a \\u201cGreat Resignation\\u201d flair on this sub lol\\n\\nEdit: since I\\u2019ve posted this, another coworker quit\\u2026 4 coworkers in just at 3 months now. Small office. This particular coworker started less than 2 months ago.\"", "title": "Anyone else’s coworkers suddenly quitting with no job lined up?", "upvote_ratio": 0.99, "url": "https://www.reddit.com/r/careerguidance/comments/qv8jc4/anyone_elses_coworkers_suddenly_quitting_with_no/"}, {"author": "Ijust_want_moresleep", "created_utc": 1689484537.0, "link_flair_template_id": "682e2d40-78e2-11ea-b9b2-0e4e69ee6911", "link_flair_text": "Advice", "num_comments": 353, "post_id": "150xe4b", "score": 1447, "subreddit": "careerguidance", "text": "\"They said something about a recent loss I had, I\\u2019m assuming as a joke to another associate, but it came to me instead. I became overwhelmed with grief again, cried, and left announcing I was leaving. \\n\\nSo now what.\"", "title": "I walked out of the office today and left after receiving an insensitive text from my boss, that was not meant for my eyes. Did I quit?", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/careerguidance/comments/150xe4b/i_walked_out_of_the_office_today_and_left_after/"}, {"author": "FrauDunkleSchokolade", "created_utc": 1587322675.0, "link_flair_template_id": "682e2d40-78e2-11ea-b9b2-0e4e69ee6911", "link_flair_text": "Advice", "num_comments": 198, "post_id": "g4d70n", "score": 1448, "subreddit": "careerguidance", "text": "\"This will probably be downvoted to hell. That\\u2019s okay. \\n\\nBut really, there has been an uptick in people posting about quitting their jobs. This isn\\u2019t to berate you. If you aren\\u2019t happy, you really should find a way to leave. Your mental health and professional fulfilment is much MUCH more important in the long run. \\n\\nHOWEVER, if you know that you don\\u2019t have a fat kitty saved up or a wealthy family to fall back on- please don\\u2019t make the jump just yet! The same goes for those in jobs with an easier \\u2018replacement index\\u2019 or \\u2018entry bar\\u2019 (cringe). Don\\u2019t do it!\\n\\nThink long and hard. Where I am, the depression from the lockdown retrenchments alone has led to a rise in suicides. Quitting your job and then finding yourself in the cold may put you in a worse off position.\\n\\nThis is sounding harsh but it is coming from a good place. Things are going to work out. We just don\\u2019t know when. In the meantime, hang in there. Take this global lockdown time to plan your exit meticulously, save up and start skilling up for the jump. \\n\\nGood luck!\"", "title": "Are you seriously trying to quit your job during a global pandemic and impending recession? o_O", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/careerguidance/comments/g4d70n/are_you_seriously_trying_to_quit_your_job_during/"}, {"author": "Fruitcake36", "created_utc": 1589124754.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 246, "post_id": "gh3k6s", "score": 1444, "subreddit": "careerguidance", "text": "\"It's probably the number 1 thing driving me into depression. I can't come to terms with the fact that as I'm coming to 30, never have I felt more certain that the idea of a 'career' or working for the rest of my life in some repetitive job just to support my housing, family and retirement, is just NO life.\\n\\nI'm not sure if it's bad experiences, or not knowing what exactly it is I want to do. Heck, I'm being paid 55k, but have already decided I will resign before the end of the year, leave London, and move back to my hometown (where opportunities are limited). This is simply because, after several years of slaving it out in an office, I so desperately miss feeling PURPOSE in life. Whether that's living under mum's roof and feeling the love of living with my family, being at University, and being surrounded by some of the best friends and richest experiences, being young and adventurous, traveling. Living life. \\n\\nEver since I graduated and got into the 'workforce', aka, sitting at my corporate desk all day every day, life has been a misery. Eeach and every day typically morphs into the same scenario, wake up early, feel tired, commute, spend x hours under intense stress, commute home, change, cook, wash dishes, maybe go gym, bed, repeat. Then the weekend. Even weekends are duller than they used to be because people are so busy or spend time with their other halves or whatever else.\\n\\nI came to realise through a lot of self-reflection during lockdown, that it's not the job, or the industry (I changed industry to mix it up and try something new). I realised that selling all of my time just to receive a paycheck, is nonsense. To the point where I'd rather resign and be unemployed whilst preparing for long-term travelling. It's strange because I want someone to tell me I'm barking mad, to leave a nice paid 55k job in the city for what I want - but you can't help what you feel. I'd imagine it's like a gay person and bottling up their feelings and then eventually coming out. For me, the truest thing I feel in my heart is that I just don't want to work 9-5 for the rest of my life, full stop. I want more out of life than living for the weekend, than defining my life and value by my 'work'. I can't derive value from anything else because I spend 80% of my waking time at work/commuting. No job has ever brought me any sense of purpose in life. It just draws me down further, gradually.\\n\\nI just think it's an incredble shame, that we spend our lives in the pursuit of careers, selling our health, our time, our relationships and everything else just to put money in the bank and jump on the old societal bandwagon of buying a house and settling down. I thought after going into uni and then into the exciting world of financial services, that I had life set. But suddenly, I could not want it less. Even the idea of spending 30 years paying off a mortgage disinterests me. I find it a grim and miserable idea. What's wrong with me? But scarily, there's no viable alternative. It seems though a lot of people around my age who think similarly travel, so that's what I'm considering also.\\n\\nAny others feel the same way?\"", "title": "Anyone else graduated, got in a 'career' and realise there was more to life than work?", "upvote_ratio": 0.99, "url": "https://www.reddit.com/r/careerguidance/comments/gh3k6s/anyone_else_graduated_got_in_a_career_and_realise/"}, {"author": "Guagliodorione", "created_utc": 1603167004.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 181, "post_id": "jei9il", "score": 1436, "subreddit": "careerguidance", "text": "\"I frequently go on LinkedIn to check for new job postings in order to propel my potential career change. I also find it anxiety-inducing when I see what some of these jobs want for entry-level positions. I mean, I know they probably don\\u2019t actually require all this specialized knowledge and experience they ask for but still. As someone who has only worked in one field, it\\u2019s hard to make a leap even to just get experience in another field. \\n\\nAnother thing, it really sucks when you don\\u2019t know what you wanna do in life and you see people on LinkedIn that you went to high school and college with working or studying at really prestigious places probably making or on their way to making a really nice life for themselves. I know you shouldn\\u2019t envy others, but sometimes I\\u2019d deem LinkedIn a toxic place for me. Anyone else feel this way?\"", "title": "Does anyone else get anxiety when looking at LinkedIn?", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/careerguidance/comments/jei9il/does_anyone_else_get_anxiety_when_looking_at/"}, {"author": "sadboi170", "created_utc": 1693159617.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 380, "post_id": "162xgw8", "score": 1390, "subreddit": "careerguidance", "text": "\"Backstory: Started out as an IT field tech a little over 5 years ago, when Covid started I moved into our warehouse and started working as a supervisor. Fast forward to a year ago, I was promoted to an Ops Manager managing our warehouse, field techs, and a team of project coordinators. While the pay increases have been nice and has allowed me to live a comfortable life(got my own place, new car, etc.), I absolutely despise my day to day life and dread going into work daily.\\n\\nHere is my dilemma - this was my first job out of school, I do not have any other job experience. I have an associates degree in a completely unrelated field, so I can't use that to leverage any future opportunities(I also have no interest in finding a job in that field). \\n\\nI do however, have a passion for project management. While I do not currently have any certifications, I do manage multiple projects/clients daily. My current job is a mix of people management, project management, and customer service. I absolutely despise the people management aspect of the job, I used to be compassionaite when people had issues arise, but I feel like I've grown bitter and am turning into one of those managers who just wants the work to be completed so I can go home. However, I absolutely love the project management and customer service aspect of the business. I am very process oriented and love making our business more efficient to ensure our customers are happy.\\n\\nI am sure I could spin my current job duties into project management experience to potentially get my foot in the door, but I do feel like I would need to take a step back pay wise, and potentially in my career as well. I do have some friends who want me to relocate to the west coast as well, which I am super interested in, so that just fuels my fire a bit more to get out of here.\\n\\nI do have immense guilt as well though, I feel like I am in a wonderful situation(pay/career wise, not happiness) with my current company, and they have invested tons of time, money, and effort into growing me as a leader. I would essentially be throwing away the last 5 years of progress we have made together, which makes the decision even harder. I would basically be throwing their investment in me out the window.\\n\\nAny advice?\"", "title": "Approaching $100k salary as an IT warehouse manager, started at $28k 5 years ago. Hate my job, would I be an idiot to quit?", "upvote_ratio": 0.94, "url": "https://www.reddit.com/r/careerguidance/comments/162xgw8/approaching_100k_salary_as_an_it_warehouse/"}, {"author": "anthonydp123", "created_utc": 1683063375.0, "link_flair_template_id": "682e2d40-78e2-11ea-b9b2-0e4e69ee6911", "link_flair_text": "Advice", "num_comments": 1812, "post_id": "136135f", "score": 1368, "subreddit": "careerguidance", "text": "\"So I have been applying for jobs for over the past year ( easily 1000+ apps). I\\u2019ve tried rewriting my own resume then also having a professional re do my resume and still no luck. At 31 years old and making only $41k I feel more behind than ever especially seeing everyone else is making $60k or more. Recently applied to go back to school for IT/ software development but it seems the tech industry is getting wrecked atm. I have a degree in business management and sports management. Does anyone have recommendations or advice to help get on the right track?\"", "title": "How long did it take for you to land a $80 to 100k+ salary job?", "upvote_ratio": 0.93, "url": "https://www.reddit.com/r/careerguidance/comments/136135f/how_long_did_it_take_for_you_to_land_a_80_to_100k/"}, {"author": "Technoidy", "created_utc": 1661442808.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 2052, "post_id": "wxht7d", "score": 1362, "subreddit": "careerguidance", "text": "\"Most people who say \\\"I make 100k a year doing this!\\\" When you look into the details, they're really the top 1% of earners in that career, they sacrificed literally their whole life for the job, and STILL depended on a huge amount of luck to get there.\\n\\nI don't want to waste years getting a degree for something, just to find that realistically, I'll never come close to actually earning that much.\\n\\nWhat sort of careers (anything, I've been considering everything from oil rigs to IT to finance) will reliably pay 100k, or at least 70k+ just as long as you do a good job and stick with it for a few years?\"", "title": "Careers that ACTUALLY earn 100k annually, or close to it?", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/careerguidance/comments/wxht7d/careers_that_actually_earn_100k_annually_or_close/"}, {"author": "SA1L", "created_utc": 1679014416.0, "link_flair_template_id": "6e8b8c06-7882-11ea-8424-0e543b010d57", "link_flair_text": "Edit with your location", "num_comments": 630, "post_id": "11tcepu", "score": 1368, "subreddit": "careerguidance", "text": "\"I recently relocated across the country, away from my family, and I quickly learned that the recruiter over promised the compensation package. I have continued interviewing with another company who is excited about my candidacy and would pay more than twice my current salary. If they extend an offer, I think I may take it, despite only having been at the new role for less than 2 weeks. \\n\\nAITA, or would you do the same?\"", "title": "Would you quit a job you just started to take another offer that is twice your salary?", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/careerguidance/comments/11tcepu/would_you_quit_a_job_you_just_started_to_take/"}, {"author": "pruneandpotatocake", "created_utc": 1687883952.0, "link_flair_template_id": "682e2d40-78e2-11ea-b9b2-0e4e69ee6911", "link_flair_text": "Advice", "num_comments": 1078, "post_id": "14kil3s", "score": 1351, "subreddit": "careerguidance", "text": "\"I interviewed with a company this week that said they were offering 65k a year for a full time position. I went through 4 rounds of interviews and one included a several hours long assessment. As soon as they offered the position to me they said they made some changes and it is now going to be 55k a year instead, which is a huge decrease. \\n\\nThat\\u2019s what I make at my current position, and I\\u2019m wondering if it\\u2019s even worth making the jump if I\\u2019m not going to get anything extra out of it. \\n\\nThe only perk is that it would be hybrid instead of full time in-office like my current job, but this is a huge bummer to me. Do I try to negociate my salary with them or just decline the offer?\\n\\nEdit: I never disclosed to them how much I\\u2019m making now, so not sure why they changed it so drastically\"", "title": "Initial salary offer is being reduced. What do I do?", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/careerguidance/comments/14kil3s/initial_salary_offer_is_being_reduced_what_do_i_do/"}, {"author": "fR3aK0225", "created_utc": 1617815763.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 74, "post_id": "mm6zof", "score": 1340, "subreddit": "careerguidance", "text": "\"Careers are debilitating, and clearly we are all experiencing it. That said, this is a subreddit for career guidance, and the top posts of the month are just a bunch of us feeling bad for ourselves and patting each other on the back.\\n\\nDon\\u2019t get me wrong, it is nice to know we are in the same boat as our neighbor, but we should also try to keep the ship from sinking instead of pulling each-other down in agreement that this is a nightmare\"", "title": "Can we have one big I’M DEPRESSED mega-thread instead of the 30 posts per day?", "upvote_ratio": 0.94, "url": "https://www.reddit.com/r/careerguidance/comments/mm6zof/can_we_have_one_big_im_depressed_megathread/"}, {"author": "Chasp203", "created_utc": 1680655910.0, "link_flair_template_id": "682e2d40-78e2-11ea-b9b2-0e4e69ee6911", "link_flair_text": "Advice", "num_comments": 315, "post_id": "12c2wx8", "score": 1330, "subreddit": "careerguidance", "text": "\"\\nMy boss asked me if I am searching for another job. I never told anybody but my resume is on Indeed and didn\\u2019t know if he came across it so I replied \\u201cI am always searching for new opportunities.\\u201d I then told him I don\\u2019t mean to scare him, but I was advised by family to always be searching for new opportunities. I then expressed my happiness with the job but said if a job better opportunity comes up, I cannot pass it up. I just wanted to be honest with him.\\n\\nMy boss then told me it is very difficult to find good employees like myself and discussed the potential I could achieve if u continue to work here in the future. (It\\u2019s a large commercial real estate firm). He even explained his multi-year plan with me included in it.\\n\\nI feel being honest with his question may actually benefit me in this situation. Maybe he will make greater efforts to keep me working for this company longer than I expected. What are your thoughts? Was this the correct response? Could I face any repercussions? Did this response build more trust between him and I?\"", "title": "My boss asked me if I am currently looking for another job, I replied “Always.” Was this an appropriate response?", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/careerguidance/comments/12c2wx8/my_boss_asked_me_if_i_am_currently_looking_for/"}, {"author": "the-furiosa-mystique", "created_utc": 1694300367.0, "link_flair_template_id": "6e8b8c06-7882-11ea-8424-0e543b010d57", "link_flair_text": "USA remote", "num_comments": 297, "post_id": "16ejmt4", "score": 1315, "subreddit": "careerguidance", "text": "\"I was the 'company man' for over 15 years. I told everyone how much I loved my job, how much I wanted to help grow and succeed with this company. I was on and on about how this was the best company, and I would be there til my dying breath. Not only that, I was their top performer but a mile. I was convinced I had found my place and would be here forever, allowed to grow and thrive as they did.\\n\\nCOVID hit hard, and we were at risk of losing everything. The company pivoted hard, and I put in 12-16 hr days, 7 days a week for almost a year on and off to try to keep us afloat. They were grateful and told me time and again I was instrumental in saving the company. They made me promises. For growth and specific career goals. These promises were not ever honored, in fact all were walked back completely as if they were never said. They never put anything in writing. \\n\\nMy health has been deteriorating over the last two years. In June, I had a severe health scare which landed me in the hospital for a week and a half. I expected my company would have my back the way I did all those years ago but no - I was removed from my job then essentially demoted as due to my health issues I was unable to perform a small part of the job. I went from the top where I was number 1, to the bottom due to my health, which was exacerbated by the job itself. I have very little in terms of a personal life, because of how much I gave to this job.\\n\\nSo here I am, dealing with losing a part of my identity as clients and everyone in my life see me as \\\"that guy from that company\\\". I'm trying to keep my head up and work with the demotion but it's very hard and incredibly demoralizing. I'm confused, I feel betrayed and I don't know where to go from here.\"", "title": "I was my company's biggest cheerleader - where do I go now?", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/careerguidance/comments/16ejmt4/i_was_my_companys_biggest_cheerleader_where_do_i/"}, {"author": "GarmeerGirl", "created_utc": 1691868728.0, "link_flair_template_id": "682e2d40-78e2-11ea-b9b2-0e4e69ee6911", "link_flair_text": "Advice", "num_comments": 1040, "post_id": "15pdc9k", "score": 1319, "subreddit": "careerguidance", "text": "\"Would you simply ignore all the emails sent to your personal email, respond to some or respond to all?\\n\\nHis policy is to acknowledge all emails so I feel under pressure to ignore them. But it\\u2019s Saturday early afternoon and he\\u2019s already sent two to my personal Gmail account and another last night. During business hours he only emails to my work account. I feel stressed seeing them.\\n\\nEdit to add: I\\u2019m salaried employee. So does that mean I have to work on weekends when the boss contacts me?\\n\\nEdit 2: I got more emails from him and felt too much pressure to ignore so I forwarded them to my work email and logged into the work email then replied to one from there. Maybe he\\u2019ll get the message I won\\u2019t be replying from my personal email but I don\\u2019t want him to expect me to reply on weekends either. Idk\"", "title": "My new boss emails to my personal email address after work hours and weekends. I feel on call 24/7. What would you do?", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/careerguidance/comments/15pdc9k/my_new_boss_emails_to_my_personal_email_address/"}, {"author": "None", "created_utc": 1591381060.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 349, "post_id": "gx9vcl", "score": 1305, "subreddit": "careerguidance", "text": "\"I'm so sick of these emails. I want to scream bloody murder everytime I open one up. I wish they would just be honest and tell me that I'm absolute trash and that's why I was rejected instead of beating around the bush. I don't know why I'm even bothering. I'm stuck in my dead end job forever and that'll be my life.\\n\\nWhat are your guys' thoughts?\"", "title": "\"wE'vE dEcIdEd NoT tO mOvE fOrWaRd At ThIs TiMe.\" Is anyone else sick of reading these emails?", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/careerguidance/comments/gx9vcl/weve_decided_not_to_move_forward_at_this_time_is/"}, {"author": "InitiativeOdd3719", "created_utc": 1676991106.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 295, "post_id": "11857ht", "score": 1307, "subreddit": "careerguidance", "text": "\"Chatbot gpt is saving my career\\n\\nAnyone else have trouble writing emails? When I write emails I am wordy, I repeat myself, and often they end up being several paragraphs long. \\n\\nFor a few weeks I\\u2019ve been using chatbot gpt to help keep my emails short and sweet and on track. My boss has noticed a change and has been super positive with me which is very uncommon. They are engaging in me more and finding time out of their day to check in on my projects. \\n\\nSeriously was I that annoying to begin with? Saving my career. I wish I could write professionally like this naturally. I\\u2019m taking notes and making small steps to improving myself. But this ai chat has been incredibly helpful. \\n\\nAnyone else?\"", "title": "Chatbot gpt is saving my career?", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/careerguidance/comments/11857ht/chatbot_gpt_is_saving_my_career/"}, {"author": "WaltAlty", "created_utc": 1687998225.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 213, "post_id": "14lpxhz", "score": 1295, "subreddit": "careerguidance", "text": "\"Hi everyone, so I wanted to see if I could get some advice. My direct report has let me know today they're quitting. I'll need to tell my manager tomorrow morning. However I was also planning on quitting next week. Should I just tell my manager at the same time about myself? My one reason for waiting is I get a bonus July 1 and my company has been known to let you go immediately to save on the cost.\\n\\nAppreciate any thoughts.\\n\\nEdit\\n\\nWell thanks everyone. Seems to be a consensus that I wait. I figured as much but I appreciate the confirmation. I will be waiting until I see the bonus in my bank account.\"", "title": "My direct report is quitting tomorrow. Should I tell my boss I'm also quitting tomorrow instead of next week?", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/careerguidance/comments/14lpxhz/my_direct_report_is_quitting_tomorrow_should_i/"}, {"author": "nagol3", "created_utc": 1682279223.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 437, "post_id": "12wno23", "score": 1276, "subreddit": "careerguidance", "text": "\"I really like this company and job so if I can constructively discuss this with the company without getting fired that would be ideal.\"", "title": "On Monday my company is having a meeting about how we aren’t allowed to work from home anymore. How do I say this makes me want to look else where for a job without getting fired?", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/careerguidance/comments/12wno23/on_monday_my_company_is_having_a_meeting_about/"}, {"author": "Icy-Function-6960", "created_utc": 1689973241.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 676, "post_id": "15601uq", "score": 1273, "subreddit": "careerguidance", "text": "\"I applied for a specific role and the interview went great, 1 hr 30 min. Towards the end of it, both Execs asked me if I'd be interested in an engineering role instead. I asked if the original role was taken and they said no but that they'd rather me take the engineer role based off my experience and the pay was much higher. It was 3rd and final round.\\n\\nThe recruiter calls me to update me on their response 2 days later. She said they were going through changes with a new President but that the Execs loved my interview and would like for me to be a part of the team, but to give them next week since they have a lot going on with the changes. I go, \\\"Oh so not official, still up in the air?\\\" and the recruiter says, \\\"No, they want you but this will take until next week to have a final decision to figure out where to place you in this company since the engineering role wasn't offered until you came in.\\\" She asked me if I had other interviews and I was honest and told her I do but that I'd prefer this company over the others and she was excited and told me to not accept any offers and to hold off on the other interviews if I could until she gets a response from this company. \\n\\nI don't know how I feel about holding off potential offers when this company hasn't given me an offer letter, but is this normal during the interview process? I've never had this situation happen before. \\n\\nEDIT: I know I should continue interviewing, I was mainly wondering if this job offer sounds legit based on what the recruiter was telling me. I\\u2019ve never worked with one before but her telling me to avoid the other interviews/offers just gave me hope that I\\u2019ll actually get this job. I\\u2019m also young and just being really hopeful.\"", "title": "Recruiter says the Execs want me and to not continue other interviews. Did I even get the job?", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/careerguidance/comments/15601uq/recruiter_says_the_execs_want_me_and_to_not/"}, {"author": "MoSalty111", "created_utc": 1687508466.0, "link_flair_template_id": "682e2d40-78e2-11ea-b9b2-0e4e69ee6911", "link_flair_text": "Advice", "num_comments": 542, "post_id": "14gstg6", "score": 1268, "subreddit": "careerguidance", "text": "\"Having to manage through layoffs is the most stressful thing I\\u2019ve ever had to do. As a mid-level manager, I have zero control over what happens to my team. I\\u2019ve worked hard to build a strong team culture where people feel safe and respected, and I feel all the work I\\u2019ve put into creating this culture is being ripped away. For no other reason than the business wants their budget to look better this year. It is such a short sighted view that creates an environment of distrust. Companies want loyalty yet we can be discarded in the most ruthless of manners.\\n\\nThe things I\\u2019ve been asked to do as a manager the last couple of months have made it hard for me to even sleep at night. I\\u2019ve considered quitting several times knowing what is about to happen to my team. Knowing I\\u2019m asked to lie to them and am legally not allowed to say what\\u2019s coming, even though I know everything. I have to lie and pretend and read statements off of a script that has been provided. Even when my team asks me straight up what\\u2019s going on, HR has instructed me to gaslight and lie. \\nPeople say this is \\u201cjust business\\u201d - but why is business this way? \\n\\nI understand that there are times when layoffs need to happen for various reasons. The business needs change, competitors come onto the market, a direction shifts. I totally get it. My problem is not with having layoffs itself, it\\u2019s with the way in which companies use layoffs to their advantage when there is actually no real need. It\\u2019s also how the layoffs are handled. Why can\\u2019t companies be transparent that a layoff is coming and give people time and opportunity to find a new job. At my company, we have known it\\u2019s coming for quite some time yet we lie to our workforce. I know the exact date I\\u2019m letting someone go 2 months from now, yet I have to pretend I know nothing. All this time, they could have voluntarily left or started looking for a new job. Instead, I will have to let them go and their company access will get shutoff immediately and they are out the door. As a manager, I have to have their 1:1\\u2019s and pretend like I know nothing. As a manager who tries to lead with compassion, empathy and positivity, this eats my soul. \\n\\nSome people have said I\\u2019m just not cut out for management because of the way this has impacted me, and I feel it\\u2019s the exact opposite. More people like me NEED to be in management. In my 360 review, my team rated me with the highest scores for fostering a culture where they feel they can speak openly about difficult issues, that I lead with integrity, honor my commitments, communicate openly, have high ethical standards, that I create an environment where people feel valued and different perspectives are encouraged and respected, that I promote a culture of leaning and that I consistently apply good judgement. I belong in a management role. I am cutout to be a manager. I am not cutout to lie to my team and cut off peoples livelihoods for no good reason than to save $157k for half a year when my company makes $20+B a year. I will probably have to rehire these roles next year when the budget resets. The people we are letting go have been good performers and I\\u2019m told it\\u2019s simply a role elimination to save money for this year. \\n\\nHow do I move on from this and lead the rest of my team? How do I re-engage and find happiness in my role again? \\n\\nBefore all this happened, I was really happy with my job. I really hope the people who are losing their jobs find something else quickly and they are better off.\"", "title": "I have to lay people off. How do I move on from this?", "upvote_ratio": 0.93, "url": "https://www.reddit.com/r/careerguidance/comments/14gstg6/i_have_to_lay_people_off_how_do_i_move_on_from/"}, {"author": "mjc53509", "created_utc": 1666321652.0, "link_flair_template_id": "682e2d40-78e2-11ea-b9b2-0e4e69ee6911", "link_flair_text": "Advice", "num_comments": 639, "post_id": "y9i3j9", "score": 1259, "subreddit": "careerguidance", "text": "\"I feel like I have no idea what I want to be at 32. Zero idea. I have interests and personality traits that I can define but career wise I am at a total loss. \\n\\nIs anyone else feeling like we are living in a more purposeless generation? Not to bring negativity here.\\n\\nBy the way, I did not mean to bring doom and gloom here. I just am starting to notice more purposeless people around me, just working their job so they can go back to their escape. Not too happy just waiting to punch out that clock. \\n\\nI think, my opinion, besides a tougher job market that we fundamentally just do not know WHO we are. I\\u2019m working with career coaches and just writing down strengths and weaknesses to figure out who I am and what I envision my life being. \\n\\nIt can be done! I hope all of you, the purposeless ones like myself at the moment, find that career/entrepreneurship that will give you what you want so you can enjoy life and hobbies! \\n\\nI don\\u2019t think we need to \\u201cfollow our passions\\u201d but pick something you find you are good at or interests you, or learn a useful skill to mastery. You can always move on if that wasn\\u2019t for you. The point is take action! We got this.\"", "title": "Does anyone feel like people (millennials, etc.) are lacking a purpose?", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/careerguidance/comments/y9i3j9/does_anyone_feel_like_people_millennials_etc_are/"}, {"author": "peruviansonata", "created_utc": 1691513516.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 386, "post_id": "15lnluq", "score": 1248, "subreddit": "careerguidance", "text": "\"Title pretty much says all, was offered 85k which is the lower range for the position and I have three to four years experience in the role, and I wanted it a little more pay bump so asking for 90k. The issue is currently I am unemployed so not sure if it was smart of me too ask that increase while currently unemployed but I figured it's good to know you're worth I guess? So just waiting for them to go ahead and give me a call back before the response. But I am just worried that they might retract the whole offer, is that a common practice that might occur when negotiating salaries like this and only asking for an additional 3000 to 5000 more?\\n\\n\\nEdit: So I just wanted to update everyone once I heard back. So they offered me 85k with a 5000 sign on bonus, so in a way got what i wanted, will just in a year or two look into moving up a role rather than just wait for higher raises. I am satisfied with this offer. Thank you all for your insight, minus the few trolls that commented.\"", "title": "Received offer for 85k, countered with 90k but willing to meet in the middle. Could they retract the whole offer?", "upvote_ratio": 0.93, "url": "https://www.reddit.com/r/careerguidance/comments/15lnluq/received_offer_for_85k_countered_with_90k_but/"}, {"author": "Feisty-Departure-984", "created_utc": 1684991057.0, "link_flair_template_id": "682e2d40-78e2-11ea-b9b2-0e4e69ee6911", "link_flair_text": "Advice", "num_comments": 608, "post_id": "13r8hmy", "score": 1245, "subreddit": "careerguidance", "text": "\"I\\u2019m 35 now and I still have no idea what I want to do in terms of my career. I was a marketing graduate in my home country and a military civilian officer before moving to Canada. I had worked multiple low skilled jobs such as warehouse, cook and manufacturing and making just a tiny bit more than minimum. I am hardworking and smart and have always been praised at work but I felt that because I\\u2019m an immigrant my chances of going up the rank is very slim. Is going to school at my age gonna help me advance or land better paying jobs? Problem is I don\\u2019t talk too much at work and that\\u2019s just me being myself. I get so fixated at my work that I don\\u2019t have time to chat around or make friends with.\"", "title": "Anyone who’s 35 and above and hasn’t figured out their career path yet?", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/careerguidance/comments/13r8hmy/anyone_whos_35_and_above_and_hasnt_figured_out/"}, {"author": "Maleficent-Fault-951", "created_utc": 1697601110.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 550, "post_id": "17ahgsf", "score": 1236, "subreddit": "careerguidance", "text": "\"\\nI make the most money I\\u2019ve ever made and would have no idea how to get another job making nearly as much anywhere else. Somehow I landed this role in the banking and credit card industry and absolutely hate every second of it. I feel so uncomfortable and stupid every day. Constant anxiety. I keep trying to figure it all out and it keeps getting more chaotic and stressful after my six month mark. \\nThe opposite of my vibe.\\n I also hate how much I love the money and how accustomed I\\u2019ve become to it. I know that is what is trapping me into staying in this misery. \\nI daydream about quitting and then I think about other people just as miserable making a fraction of what I\\u2019m making and I snap out of it for awhile. \\nIs it all just rigged and I just need to tell myself to suck it up buttercup?\"", "title": "Mid 30s, 150k yearly, Miserable, Advice?", "upvote_ratio": 0.91, "url": "https://www.reddit.com/r/careerguidance/comments/17ahgsf/mid_30s_150k_yearly_miserable_advice/"}, {"author": "caliwasteland", "created_utc": 1683902916.0, "link_flair_template_id": "682e2d40-78e2-11ea-b9b2-0e4e69ee6911", "link_flair_text": "Advice", "num_comments": 522, "post_id": "13fn9l9", "score": 1241, "subreddit": "careerguidance", "text": "\"I recently accepted an offer at my current place of employment a couple of months ago due to be unhappy with my last employer. I have been job hopping every 1-2 years because of this. Same role, different industries.\\n\\nI thought that things may be different at this new company as they are highly rated by employees and are considered one of the top places work. I\\u2019m making over $100k a year, have great benefits, got a huge sign-on bonus, and I work 100% remote. I like my team and people who work here seem happy. However, I still wake up not wanting to go to work and have trouble keeping up with my work due to lack of motivation.\\n\\nI\\u2019ve been trying to figure out why and the only thing that makes sense to me is I\\u2019m not motivated because I don\\u2019t feel like the work I\\u2019m doing is meaningful. I feel like the skills I develop at work don\\u2019t have much application in my personal life and all my efforts is purely to make the company more money. I\\u2019ve thought about a career change, but not much appeals to me and the ones that do have average salaries that are 30-40% of what I\\u2019m making now.\\n\\nHave any of you been in a similar position? If so, how did you break the cycle?\\n\\nEdit: been at work and see a ton of comments. This is such an important part of my life I\\u2019m trying to figure out so I\\u2019m going to do my best to get back to all of you sharing your thoughts. Thank you all for showing your support, truly means a lot.\\n\\nEdit 2: i want to thank all of you for bringing your unique perspectives to this conversation. It was eye-opening to hear how many of you are in a similar position. I hope we can all find happiness however possible. After reading through all of your comments I think I\\u2019m going to do the following in this order:\\n\\n1. Rule out medical issues like thyroid/hormone.\\n2. Talk to a professional therapist to make sure these feelings stem from something like ADHD, depression, or past workplace trauma.\\n3. Continue my search for a hobby, something that I can enjoy and look forward to outside of work.\\n4. Look into volunteer opportunities where I can give back to my community.\\n5. While doing the above, reflect on what is and isn\\u2019t in my control and focus on changing aspects of my life that are in my control.\"", "title": "Why am I so unmotivated when I have a good job, at a good company, that pays well?", "upvote_ratio": 0.94, "url": "https://www.reddit.com/r/careerguidance/comments/13fn9l9/why_am_i_so_unmotivated_when_i_have_a_good_job_at/"}, {"author": "TheTon3Ranger", "created_utc": 1686761732.0, "link_flair_template_id": "682e2d40-78e2-11ea-b9b2-0e4e69ee6911", "link_flair_text": "Advice", "num_comments": 654, "post_id": "149cx5y", "score": 1232, "subreddit": "careerguidance", "text": "\"Hey all, \\n\\nFirstly apologies for formatting I'm on mobile. \\n\\nI have been offered a position via a recruiter that's more than double my salary and even more with the bonuses and benefits package. The recruiter has asked me to fill out the usual details required to start the process with the hiring company and one of the questions is what my current salary is. \\n\\nNow my current salary is around \\u00a336k and the proposed salary for this new role is \\u00a380k, plus the bonuses and benefits which bring it between \\u00a396k and \\u00a3103k, I have never been in this position before and I'm just a little unsure as to how I approach it?\\n\\nI fit the job role perfectly and have all the required skills and I would also say I'm very much underpaid at my current company, my two collgues are on significantly more than me but not \\u00a380k, my current job is outside of London and the new role is central London. \\n\\nIf anyone at all has any advice it would be really helpful.\\n\\n***UPDATE***\\n\\nThe recruiter got back in contact with me to let me know the questions were for their purposes and not the employer. I know the overwhelming majority of your comments are to not disclose my current salary but given that it's so let for thr purpose of the recruiter does that change your opinion?\\n\\nThanks for all the advice too!\"", "title": "Job offer is double my salary and they are asking for my current salary, what do I do?", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/careerguidance/comments/149cx5y/job_offer_is_double_my_salary_and_they_are_asking/"}, {"author": "PuzzledRiver6534", "created_utc": 1655546697.0, "link_flair_template_id": "682e2d40-78e2-11ea-b9b2-0e4e69ee6911", "link_flair_text": "Advice", "num_comments": 716, "post_id": "vf32dw", "score": 1232, "subreddit": "careerguidance", "text": "\"What should I do? I'm dumb and useless, nothing interests me.\"", "title": "I'm depressed, can't handle criticism, hate long hours, dislike coworkers, and overall hate work, what career should I get?", "upvote_ratio": 0.92, "url": "https://www.reddit.com/r/careerguidance/comments/vf32dw/im_depressed_cant_handle_criticism_hate_long/"}, {"author": "Legitimate_Turnip342", "created_utc": 1689593308.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 470, "post_id": "151zaa0", "score": 1207, "subreddit": "careerguidance", "text": "\"At between 15-18, I wanted to become an investment banker and work all the hours that god gave me. \\n\\nBy 22, I settled on insurance but aspired to one day become the CEO of the big conglomerate I worked for. \\n\\nBy 24, my focus had been more about work-life balance, and earning enough for a nice car / big house. \\n\\nBy 27, my focus is more on earning enough to buy a house, raise a kid and have a nice comfortable life. \\n\\nIs this normal? And if so, why do you think this is? I now look back on my ambitious from 15 - 22, and think how much ambition I lost.\"", "title": "Did you become less ambitious with age?", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/careerguidance/comments/151zaa0/did_you_become_less_ambitious_with_age/"}, {"author": "Goodgirlwithlove", "created_utc": 1703482012.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 569, "post_id": "18qc6cj", "score": 1194, "subreddit": "careerguidance", "text": "\"Please let us know\"", "title": "People who earn well, What are some of the highest income skills for 2024 ?", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/careerguidance/comments/18qc6cj/people_who_earn_well_what_are_some_of_the_highest/"}, {"author": "None", "created_utc": 1691063418.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 528, "post_id": "15h1z3k", "score": 1173, "subreddit": "careerguidance", "text": "\"I want to tell them we are expecting, mainly because I will need to be there for delivery and I don\\u2019t want to lose my job if I miss time. I want to know clearly that it\\u2019s ok for me to do that. If they aren\\u2019t ok with it, then I will stay where I am. \\n\\nThis job pays about $15,000-$18,000 more than I currently make so obviously I want it badly especially with our first on the way. \\n\\nShould I disclose this at the end of the interview?\\n\\nUPDATE: Interview went great (best interview I\\u2019ve ever been in honestly) and I decided to wait until *if* I get offered the position and can review their benefits package. I am reading the responses now. Thanks for the help guys!\"", "title": "Wife is due in late March and I have an interview today. Do I disclose?", "upvote_ratio": 0.9, "url": "https://www.reddit.com/r/careerguidance/comments/15h1z3k/wife_is_due_in_late_march_and_i_have_an_interview/"}, {"author": "Wasted_Panda12", "created_utc": 1672130795.0, "link_flair_template_id": "682e2d40-78e2-11ea-b9b2-0e4e69ee6911", "link_flair_text": "Advice", "num_comments": 1341, "post_id": "zwb2g4", "score": 1176, "subreddit": "careerguidance", "text": "\"I\\u2019m wanting a fresh start in my early 30s and would like to be able to support myself in HCOL state. Is it too late to achieve this sort of income short of becoming a nurse or working in tech?\\n\\nETA: holy moly didn\\u2019t expect this blow up, but, thank you so much to everyone that took time to respond! Can\\u2019t wait to go through all the answers after work. You\\u2019re a bunch of rockstars!\"", "title": "Women that make six figures, what do you do?", "upvote_ratio": 0.94, "url": "https://www.reddit.com/r/careerguidance/comments/zwb2g4/women_that_make_six_figures_what_do_you_do/"}, {"author": "OpinionHavR", "created_utc": 1608121950.0, "link_flair_template_id": "682e2d40-78e2-11ea-b9b2-0e4e69ee6911", "link_flair_text": "Advice", "num_comments": 203, "post_id": "ke8d2y", "score": 1174, "subreddit": "careerguidance", "text": "\"You guys know those people that thinks its a competition to see who struggles the hardest and looks down on those who doesn't struggle as much as they do or had to back in day?\\n\\nRight now im fighting a sinus infection and for the first time ever out of multiple jobs i have had since becoming an adult (I'm now 24 worked 5 jobs before) i might have to miss 2 days of work because i tried going to the doctor yesterday and my insurance denied so i have to go again tomorrow and now here come my parents saying shit like \\\"back in my days i only skipped work if i was unconscious\\\" or \\\"I used to go to work feeling so bad i had hallucinations\\\" \\n\\nWhy do you people say this shit like that's something to the proud of? Putting your health on hold to make $8 an hour isn't some noble duty. Its more pitiful that someone has to be at work basically dead due to an illness. I will never understand that shit. I like going to work typically and i work hard, but wtf is this struggle porn fetish where people try to top you about how bad their work/ life or work/ health balance is?\\n\\nYou will unironically hear people brag about how they worked so many hours that they haven't seen their 7 year old son in a month. Most of the time that's just called being a bad parent or having a really shitty job since you have to work that many hours to survive. That is not a bragging point. What the hell is wrong with people?\"", "title": "Why do people brag about being overworked and neglecting their health for their job?", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/careerguidance/comments/ke8d2y/why_do_people_brag_about_being_overworked_and/"}, {"author": "WBHUH_interesting_", "created_utc": 1691725314.0, "link_flair_template_id": "682e2d40-78e2-11ea-b9b2-0e4e69ee6911", "link_flair_text": "Advice", "num_comments": 481, "post_id": "15nxq3u", "score": 1168, "subreddit": "careerguidance", "text": "\" I\\u2019m coming to you all to tell my story and humbly ask for advice. I\\u2019ve never been attacked on a personal level in an interview I was recruited into before and I\\u2019m not sure what to do from here. \\n\\nA little over a month ago I applied for a business representative role B2B for a tech accessory company. I went through five different interviews. My first was an initial screening with a recruiter. The second an interview with HR. My third was an interview with the VP of revenue and operations. My fourth interview had the same VP another VP of enterprise as well as the strategic account manager. The fifth interview I got a tour of the building got to meet all of my peers and talk about the business plans for the future. The company is a conglomerate of four brands that supply things to schools and businesses. \\nA week goes by and I get a call from HR saying that she has some exciting news for me. I was loved by everyone I interviewed with and they saw a promising future for me with the company so much so that they thought I was overqualified for the role I was applying for and that they were creating a new elevated role within the company they thought I would be perfect for. I just needed to wait for the formal job description to finalize and I would need to interview with two more people. \\n\\nToday was the day of my interview and I never had a chance. I have no idea what was wrong but I\\u2019ll describe to you the interview with the east coast territory sales manager. \\nI started off thanking the man for being here today and taking the time to meet with me. I was excited and looking forward to working with and learning from someone who had over 20 years in the technology sales industry and I had really been looking forward to today. \\nHis response was \\u201coh you think you know about me i only heard about you two days ago.\\u201d\\nDefinitely not off to a good start. He asked me to tell him about myself and he was shaking his Head at me In disappointment the entire time. \\nHe asks \\u201cWhy are you here? What makes you want this job and don\\u2019t give me some cookie cutter answer I\\u2019ll know.\\u201d \\nI start to talk about how inspired I was when touring the facility and how all I\\u2019ve been thinking about is being apart of the projects that they had in the works and the impact I could make and my vision and dreams to be apart of the business projects and he cut me off- \\n\\u201cIm going to stop you right there you. Im going to apologize for everyone because you obviously have no idea what you are applying for. I don\\u2019t think they took the time they needed to prepare you for this because this is only for the k-12 department. I get your resume in my email saying how great of a fit you are and how everyone loves you and you don\\u2019t know anything. I guess this is the result when you get VPS over the hiring for sales roles.\\u201d \\nI\\u2019m keeping my cool mostly in shock halfway wondering if this is some sort of test to see how I handle rejection. I\\u2019m trying to explain my past job experience and how my experience related but there was no recovering control im just on the defense at this point treading water. \\nHe rolls his eyes and is like \\u201cwell I don\\u2019t have much else to say do you have any questions for me?\\u201d\\nI asked him \\u201cWhat part of my experience exactly do you have hesitations about?\\u201d\\nHe starts shaking his head again and angrily says \\u201cExperience? You don\\u2019t have any experience. All you have going for you is you are a young woman with a lot of enthusiasm. I might potentially consider you from an entry level position but not this. I\\u2019m the one that has to take the time to teach someone and I have to think about what\\u2019s best for my team and this company. Yeah you have some sales experience but all you\\u2019ve done is retail. You are in no way ready to do this job it\\u2019s completely different. I really hope you still have your other job, you haven\\u2019t left it yet have you?\\u201d \\n\\nI don\\u2019t have any large scale b2b experience but I have over 7 years of Sales experience & 4 years of sales management experience. I\\u2019m highly decorated in my field as a consistent top performer with a ton of awards. I\\u2019ve been highly successful in outside sales roles working in Trade shows and I have a little experience selling to small businesses like private practices. \\n\\nI have never in my life been treated with such disrespect by someone my senior. I was literally eating shit for an entire hour by this man. Im still in disbelief. \\nI\\u2019m so disappointed because I was so inspired and excited by the positive culture in the office I would have been working in. I was truly looking forward to working under the people there.\\nWhere do I go from here? I can\\u2019t imagine anyone else I\\u2019d met in the company thus far would approve of his behavior but I\\u2019m wondering should I just cut my losses and keep it moving or if I should reach out to one of the VP\\u2019s or HR about their east coast territory sales manager\\u2019s unprofessional behavior? Would I just look like a bad sport or is it the right thing to do? I know I don\\u2019t have a future there and after that interaction regardless nor would I care to work with someone like that.\\n\\n\\nSecond Edit & update\\u2014\\u2014-\\nI sent an email to all the vps and the the one hr person. \\nSubject: Concerns about recent interview experience \\n\\nDear [HR's Name] and [VP's Name],\\nI hope this email finds you well. I recently had the opportunity to interview for the Inside Account Representation role and I wanted to bring to your attention an unfortunate experience I had during my 5th interview session. I believe it's important to address this matter as it greatly impacted my perception of the company and the potential role I was excited about.\\nDuring my interview with (name) the East Coast Territory Sales Manager, I encountered behavior that left me deeply unsettled and disheartened. I was met with disrespect, dismissiveness, and belittling comments that I found to be unprofessional and incongruent with the positive and inclusive culture that I had previously encountered throughout the interview process.\\nI want to emphasize that I hold the utmost respect for (company) and the values it upholds. My intention in sharing this experience is to ensure that the company's commitment to fostering a respectful and inclusive environment continues to be upheld, even in challenging situations.\\nI understand that interactions can sometimes be misinterpreted, and I did take into consideration that this could potentially be a potential hazing to see how I performed under pressure but I don\\u2019t believe that berating a possible candidate over the course of an hour is a ethical practice. However, I strongly believe that open communication is key to addressing such concerns. I would appreciate the opportunity to discuss this matter further and provide more context.\\nMy aim is not to escalate the situation unnecessarily but rather to contribute positively to the betterment of the company's interview process. I believe that addressing this issue transparently will help maintain the strong reputation that (company) holds within the industry.\\nThank you for your time and consideration. I look forward to any insights or guidance you may offer regarding this situation.\\n\\nBest Regards,\"", "title": "What to do after a Hostile interview?", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/careerguidance/comments/15nxq3u/what_to_do_after_a_hostile_interview/"}, {"author": "DownfalI", "created_utc": 1685969282.0, "link_flair_template_id": "682e2d40-78e2-11ea-b9b2-0e4e69ee6911", "link_flair_text": "Advice", "num_comments": 740, "post_id": "141dhdj", "score": 1163, "subreddit": "careerguidance", "text": "\"Hey everyone,\\n\\nI'm seriously considering rage quitting my job and I'm curious to see what you guys would do if you were in my shoes.\\n\\nIt's an internship (I'm still in college) at a big company in a prestigious field. I started out in 2021 and I got a two-year contract.\\n\\nThey can't extend the internship, so the company would need to promote me if they want me to stick around. I've always received great feedback from the whole team, everyone \\\"loves to work with me\\\", I'm a \\\"great professional\\\" and all this other stuff. But as time went on, I was only rewarded with extra work. I kept tackling on more and more work, including taking on some new responsibilities.\\n\\nFast-forward to this year, my contract runs out at the end of this month and no one is talking about this promotion or mentioning the possibility of it. I thought my hard work would be rewarded, but I eventually found out that's not enough in the corporate world. Anyway, I muster up enough courage to talk to both my manager and my manager's manager one day and they both give me a ton of excuses (\\\"We're on a hiring freeze\\\", \\\"We don't have the head count\\\", \\\"HR won't approve\\\").\\n\\nI get it. Tough luck. It happens. I was pretty disappointed at first, but I (kinda) understood. A few days go by, and the whole team got an invite to a meeting. I asked around to see what it was about, but everyone played dumb. I don't know what I was expecting at first, but I was completely shocked when the day finally arrived. They set-up the meeting to announce that *another* intern from the team was getting promoted.\\n\\nI was absolutely caught off guard. He has different responsibilities than me, but we both started at around the same time. We don't share the same manager, but both our managers report to the same person. I do a lot more than him and I've been involved in a lot more projects. I have a bigger impact than he does, point blank.\\n\\nI felt betrayed, deceived. They lied to me. I'm sure there is a \\\"hiring freeze\\\", but they could've gone around it. I don't know what happened, maybe they got used to me in a bigger role and they just forgot about it.\\n\\nI don't know what do. Should I blow up the bridge? Save face? Neither? I'm open to all kinds of advice.\\n\\nEDIT: I would like to thank everyone that commented and left their thoughts/opinions. I've read every single one of them, and I'll admit quitting is not the brightest idea. I was feeling very sad when it happened but now I realize it's immature, and I won't gain anything from it. There are some great pieces of advice in the thread below, so I wanted to thank everyone once again for talking some sense.\"", "title": "Should I rage quit my job?", "upvote_ratio": 0.9, "url": "https://www.reddit.com/r/careerguidance/comments/141dhdj/should_i_rage_quit_my_job/"}, {"author": "About27Penguins", "created_utc": 1688644784.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 597, "post_id": "14s72do", "score": 1148, "subreddit": "careerguidance", "text": "\"Basically title. I lost my job yesterday. It\\u2019s my fault I know that. I\\u2019m sitting outside an unemployment office rn but I\\u2019m worried about my prospects of finding another one because I know this question will come up in interviews.\\n\\nEdit I got fired for being on my phone\\nEdit 2 I was a bank teller\"", "title": "How to respond to “why did you leave your last position?”in an interview when you got fired?", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/careerguidance/comments/14s72do/how_to_respond_to_why_did_you_leave_your_last/"}, {"author": "yerawizard-HERRY", "created_utc": 1657423769.0, "link_flair_template_id": "682e2d40-78e2-11ea-b9b2-0e4e69ee6911", "link_flair_text": "Advice", "num_comments": 248, "post_id": "vvihhh", "score": 1147, "subreddit": "careerguidance", "text": "\"Hi all. I'm just wondering as the title states, why do we keep hearing the phrase \\\"nobody wants to work\\\" when most people I know are struggling to find jobs? \\n\\nI've been applying for office type jobs for the last 2 months now. I have 7 years of solid experience in the field, an associates degree, & many credible references. Out of about 50 applications, I heard back from 5 employers, & scheduled an interview with 2, to which I never heard back from afterwards. My roommate was applying to jobs for almost 4 months before she finally was able to get an interview, & get a job. Many of my peers are struggling with this as well.\\n\\nI'm really just frustrated with this. I have never had issues finding employment before this. Is anyone else experiencing the same thing? How are you handling it? How did you improve your chances of hearing back from employers? \\nThanks!\"", "title": "Why do employers keep saying \"nobody wants to work\", but don’t respond to job applicants?", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/careerguidance/comments/vvihhh/why_do_employers_keep_saying_nobody_wants_to_work/"}, {"author": "TheMajesticMoose08", "created_utc": 1683461827.0, "link_flair_template_id": "682e2d40-78e2-11ea-b9b2-0e4e69ee6911", "link_flair_text": "Advice", "num_comments": 605, "post_id": "13am21k", "score": 1142, "subreddit": "careerguidance", "text": "\"I currently work for a small company of about 7 people. It started as an internship right out of college then turned into a job, and in the 5.5 years I've been there I've been promoted up to a VP (everybody gets a fancy job title being a small company). \\n\\nHowever, we've always struggled to make it by and I'm pretty underpaid for the work I do because we're always broke. Since the way the company gets paid is in larger, spread out chunks rather than steady but smaller cash flow, right now only me and two other guys are on salary. The rest are commission-only. \\n\\nMy boss has promised me multiple times that as soon as we have more money he'll give me a raise, make me a junior partner, etc. and to be fair I don't doubt his intent. He really is a nice guy; he's just not very good at running a business. \\n\\nMeanwhile, a very large and well-funded company with whom I work with directly on the weekly basis and have a good relationship with one of their higher-ups is hiring for a position that's right up my alley and that I qualify for. They have great benefits, I'd get to work remote, and even the low end of the posted salary range is 50% more than what I'm making now. \\n\\nLogically, it makes all the sense in the world to make the move. \\n\\nOn the other hand, I'm currently in a position with my company where I'm in charge of all the day-to-day stuff and there are many critical functions that only I'm trained to do and manage. If I left there's a good chance the company would collapse and everyone else there would lose their jobs. \\n\\nI feel like my head is telling me one thing and my heart another; I need some advice.\"", "title": "I currently work for a small company. Should I jump ship to a bigger company even though doing so would probably cause my current company to collapse?", "upvote_ratio": 0.94, "url": "https://www.reddit.com/r/careerguidance/comments/13am21k/i_currently_work_for_a_small_company_should_i/"}, {"author": "SpecialCay87", "created_utc": 1669787798.0, "link_flair_template_id": "682e2d40-78e2-11ea-b9b2-0e4e69ee6911", "link_flair_text": "Advice", "num_comments": 792, "post_id": "z8j2of", "score": 1142, "subreddit": "careerguidance", "text": "\"A couple of friends (in different circles of friends) recently revealed how much they make annually at their office job.  I was blown away.  I\\u2019ve never made more than 45k in a year doing primarily blue collar work.  And that year I make $45k was on the front line fighting miserable fires with endless hours of overtime. \\n\\nI started asking specifically what my friends do for work, and follow their lucid answers by specifically asking what they literally do on a day to day hour to hour basis and I\\u2019m met with a lot of generic terminology like consultations, meetings, analytics but no real explanation to what skills they acquired to be valuable at this.  Just a bunch of non sequiturs that sound like they do bullshit and make it pass as having societal value. \\n\\nMy friends are either so smart they\\u2019re unable to explain in layman\\u2019s terms what they do, or they are as dumb as they sound but figured out the key to landing ass backwards into a great situation.\\n\\n\\nMy one friend was at least transparent enough to tell me she does three hours at most of work per day (remotely) and simultaneously crams in most of what she has to do while attending zoom meetings.  She\\u2019s a business analyst which is as generic a term as the explanation she gave to me about what she does.\\n\\nAs a blue collar worker I can go on for days about what I clean, what I produce, and what value it brings my employers.  I don\\u2019t get why it\\u2019s so hard for them.  \\n\\nI\\u2019m a hard worker who gets praise for what he does but am never a factor for promotions or advancement. \\n\\nI\\u2019m playing the game incorrectly and it\\u2019s really starting to bother me.  \\n\\nHow am I playing the game incorrectly?  Are their skills that specialized if they can\\u2019t even explain to me what they do? Or are my suspicions correct that a lot of private sector white collar work in America in 2022 is an economic conspiracy hardly contributing anything of substance to society?\"", "title": "When I ask my white collar friends what they do I always feel like I’m getting the run around and they really don’t do anything that special. Am I dumb? Ignorant? What am I missing?", "upvote_ratio": 0.9, "url": "https://www.reddit.com/r/careerguidance/comments/z8j2of/when_i_ask_my_white_collar_friends_what_they_do_i/"}, {"author": "AlexaRose98", "created_utc": 1690980843.0, "link_flair_template_id": "682e2d40-78e2-11ea-b9b2-0e4e69ee6911", "link_flair_text": "Advice", "num_comments": 394, "post_id": "15g86e3", "score": 1133, "subreddit": "careerguidance", "text": "\"So I have worked for a major retailer for the past 4.5 years. This was my first real job solely focused on finance..it is a corporate job and I started in the AP department as a \\u201cfinance specialist.\\u201d I know I got a low amount ($18/hr) since I was just starting and was focused on landing the job. I push myself daily and get \\u201cconsistently exceeds\\u201d on yearly reviews yet my raise when I finally was giving the senior role on our team (still not a lead) was a little over a dollar. With our yearly raise, I got an additional 2.5%. This doesn\\u2019t even seem to meet inflation and was brought up to our director by another associate, but she brushed it off saying they try to be fair. The employer offers tuition reimbursement and I have one year left so I can\\u2019t quit but I still want to fight for myself if I deserve it. I had an associates when I started and decided I might as well once they began offering reimbursement. I love the culture apart from the pay but I know I\\u2019m being a pushover. I am now at $23 an hour after almost 5 years but I do forecasting for all inbound freight for the company, reporting, budgeting, and more analyst duties now. I have a touch base with lead today..how do I nicely state they should be compensating based on performance?\\n\\n*edit to add - I have about 10 months left until I receive my bachelors and there is no requirement to stay after that point luckily. I was hoping to get at least somewhat closer to what I deserve even while working to complete that. Guess I am going to continue trying to make my case for now\\n\\nIf anybody has any suggestions on getting a job in market analysis and if I would have better luck there, I would love to hear. I\\u2019m open to learning SQL and don\\u2019t have a passion for finance, but I do enjoy researching and digging around in data. Marketing has always been in the back of my mind, as my bachelors will be an accounting degree with a minor in marketing.\"", "title": "I got a dollar raise for a promotion I waited years for..now what?", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/careerguidance/comments/15g86e3/i_got_a_dollar_raise_for_a_promotion_i_waited/"}]