[{"author": "cscareerthrowaway567", "created_utc": 1496462292.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 4183, "post_id": "6ez8ag", "score": 29049, "subreddit": "cscareerquestions", "text": "\"Today was my first day on the job as a Junior Software Developer and was my first non-internship position after university. Unfortunately i screwed up badly. \\n\\nI was basically given a document detailing how to setup my local development environment. Which involves run a small script to create my own personal DB instance from some test data. After running the command i was supposed to copy the database url/password/username outputted by the command and configure my dev environment to point to that database. Unfortunately instead of copying the values outputted by the tool, i instead for whatever reason used the values the document had. \\n\\nUnfortunately apparently those values were actually for the production database (why they are documented in the dev setup guide i have no idea). Then from my understanding that the tests add fake data, and clear existing data between test runs which basically cleared all the data from the production database. Honestly i had no idea what i did and it wasn't about 30 or so minutes after did someone actually figure out/realize what i did.\\n\\nWhile what i had done was sinking in. The CTO told me to leave and never come back. He also informed me that apparently legal would need to get involved due to severity of the data loss. I basically offered and pleaded to let me help in someway to redeem my self and i was told that i \\\"completely fucked everything up\\\". \\n\\nSo i left. I kept an eye on slack, and from what i can tell the backups were not restoring and it seemed like the entire dev team was on full on panic mode. I sent a slack message to our CTO explaining my screw up. Only to have my slack account immediately disabled not long after sending the message. \\n\\nI haven't heard from HR, or anything and i am panicking to high heavens. I just moved across the country for this job, is there anything i can even remotely do to redeem my self in this situation? Can i possibly be sued for this? Should i contact HR directly? I am really confused, and terrified.\\n\\n*EDIT* Just to make it even more embarrassing, i just realized that i took the laptop i was issued home with me (i have no idea why i did this at all). \\n\\n*EDIT 2* I just woke up, after deciding to drown my sorrows and i am shocked by the number of responses, well wishes and other things. Will do my best to sort through everything. \"", "title": "Accidentally destroyed production database on first day of a job, and was told to leave, on top of this i was told by the CTO that they need to get legal involved, how screwed am i?", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/cscareerquestions/comments/6ez8ag/accidentally_destroyed_production_database_on/"}, {"author": "badcscqadvice", "created_utc": 1654102844.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 2754, "post_id": "v2lpdw", "score": 26016, "subreddit": "cscareerquestions", "text": "\"Elon Musk just emailed everyone \\u201cyou are expected to spend 40 hours in the office, if you don\\u2019t show up, we will considered you have resigned\\u201d\\n\\nTesla expanded massively during Covid, as of now half of the dev team(including me) don\\u2019t have parking space or desk. It\\u2019s physically impossible for everyone to return to office.\\n\\nShould I ignore the email, or should I drive to the office and sit under the stairs?\"", "title": "Elon Musk just asked all employees to return to office when it’s physically impossible to do so", "upvote_ratio": 0.89, "url": "https://www.reddit.com/r/cscareerquestions/comments/v2lpdw/elon_musk_just_asked_all_employees_to_return_to/"}, {"author": "chinnick967", "created_utc": 1638903959.0, "link_flair_template_id": "05438160-1232-11e5-b573-0e1422b8b60b", "link_flair_text": "New Grad", "num_comments": 552, "post_id": "rb6tdu", "score": 13942, "subreddit": "cscareerquestions", "text": "\"Hey guys! I just started my first job at Amazon working on AWS and I just pushed my first commit ever this morning! I called it a day and took off early to celebrate.\"", "title": "I just pushed my first commit to AWS!", "upvote_ratio": 0.94, "url": "https://www.reddit.com/r/cscareerquestions/comments/rb6tdu/i_just_pushed_my_first_commit_to_aws/"}, {"author": "avril_de_plonkers", "created_utc": 1572467771.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 783, "post_id": "dpcfns", "score": 10467, "subreddit": "cscareerquestions", "text": "\"At my (now former) company, we use a metric called SHOT to track the performance within a portfolio. It's some in-house calculation no one else uses, but it's been around for like 20 years even though no one remembers what the acronym is supposed to mean. My task was to average it over a time period, with various user-defined smoothing parameters... to accumulate it, in essence.\\n\\nSo, I don't like long variable names like \\\"accumulated\\\\_shot\\\\_metric\\\" or \\\"sum\\\\_of\\\\_SHOT\\\\_so\\\\_far\\\" for what is ultimately just the cumulated SHOT value. So I gave it the short name, \\\"cumShot\\\", not thinking twice about it, and checked it into the code. Seeing that it passed all tests, I went home and forgot about it.\\n\\nTwo months later, today, my boss called me into a meeting with HR. I had no idea what was going on, but apparently, the \\\"cumShot\\\" variable had become a running joke behind my back. Someone had given a printout to the CEO, who became angry over my \\\"unprofessional humor\\\" and fired me. I didn't even know what anyone was talking about until I saw the printout. I use abbreviated variable names all the time, and I'm not a native speaker of English so I don't always know what slang is offensive. \\n\\nI live in California. Do I have any legal recourse? Also, how should I explain this in future job interviews?\"", "title": "I got fired over a variable name....", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/cscareerquestions/comments/dpcfns/i_got_fired_over_a_variable_name/"}, {"author": "KingMoosytheIII", "created_utc": 1676183195.0, "link_flair_template_id": "0968d7a4-1232-11e5-a323-0e1422b8b60b", "link_flair_text": "Experienced", "num_comments": 984, "post_id": "1108zxj", "score": 7858, "subreddit": "cscareerquestions", "text": "\"I know this is a crazy situation, I still can\\u2019t believe it but it happened. Honestly, if I wasn\\u2019t terrified of getting fired during this market, I\\u2019d would find this situation funny hilarious.\\n\\nDuring stand ups, My senior engineer has a *very* distinct sound in his background. It\\u2019s  like a vacuum, but the pitch of the sound gets really low, then quickly becomes high-pitch. He was always a quiet, but very cheerful person with a thick Spanish accent. He also lives with his brother, who calls him by his nickname.\\n\\nLast Monday, I played COD late at night, and almost immediately, I heard somebody from the other team with that same vacuum pitch. They were winning and we started arguing, and that\\u2019s when he finally started talking. It was exact same accent, and at that point, I was willing to put money that it was my senior.\\n\\nNear the end of the game, both of us were completely trash talking each other (nothing hateful, just small banter, apparently he\\u2019s very competitive). It felt so out of character for him, he was laughing a lot; it was entertaining. As a joke, I called him out by his nickname, and he immediately goes quiet. I reached out to him after the game saying that it\\u2019s me, and he doesn\\u2019t respond at all. \\n\\nThe next day, his attitude is now cold. He\\u2019s very silent during our calls, and isn\\u2019t explaining things the way he used to in the past. I sent him a message during closing saying that I hoped I didn\\u2019t offend him during the game, and I actually really respect them. He claims he has no idea what I\\u2019m talking about, and just brushed me off. He remained dismissive the remainder of the week\\n\\nNow it\\u2019s the weekend and Im trying to catch up on work, but Im lost on how to proceed with him. I feel like he\\u2019s practically cutting me off. Im not sure what to do at this point. I even recorded the footage from the game, I heard it over again, and there was nothing offensive. He even started the trash talking. This feels so unreal, and I never thought something like this could happen.\\n\\nEdit: For reference, I have 4.5 years of experience. I carry my weight really well in the team and serve as a mentor for junior developers. I\\u2019d  find it hilarious if one of the juniors came up to me and mentioned we met online\\n\\nEdit: I\\u2019m going to clarify a couple of things, since there are a couple of misconceptions that are spreading\\n\\n1) My senior and I have been the only devs for nearly 2 years until 2020. We managed to hire a ton of new graduates ever since the Covid outbreak, and now we have a fully fledged team. There\\u2019s a lot of work, but we have meetings to discuss how to properly mentor juniors and planning for tasks.\\n\\n2) We were on really close terms. I knew a lot about his personal life and vice versa. we were friendly. We\\u2019ve had plenty of banter during our work meetings when we worked alone. This isn\\u2019t some dude I just decided to friendly to. This was a friend that I knew for nearly half a decade. That\\u2019s why I\\u2019m shocked at his response\\n\\n3) I did not bother him repeatedly about this situation. The moment he went silent after I introduced myself during the game, i got the hint dropped it. It wasn\\u2019t until I realized that work is currently being affected since our encounter that I sent an apology, hoping to mediate things and continue things as they were before.\\n\\n4) his nickname was something his brother called since they were kids. He personally enjoys the nickname and even has that set as his name in meetings. Everybody at work and his friends call him by it. Some juniors don\\u2019t even know his full first name.\\n\\n5) I record a lot of gameplay, it\\u2019s not something that I did out of context. I went to check on the recording because I wanted to verify if there was anything I said that was vulgar/offensive that might have led to this. He DOESNT know I have gameplay saved. There was NOTHING malicious, from both of us. if he\\u2019s uncomfortable with the gameplay, i\\u2019d delete it in an instant.\\n\\n6) my main issue is that his self-destructive attitude is blocking our development process. I\\u2019m perfectly okay with pretending this never happened. But he\\u2019s not addressing tasks / helping juniors nor is he acknowledging the issue. A lot of work is getting funneled towards me. I DONT mind working a 9-5, 40 hr week, but there are juniors who are need guidance, and if I abandon them, they are more likely going to fired, especially during this market.\\n\\nI thought this was a harmless scenario, and I hoped for advice to address how we can make things better. Instead, I\\u2019m met with pitchforks about I fucked his life over, deserving to get fired along with the rest of the team. Seriously, hop off the echo chamber hive mind and quit exacerbating a situation far beyond then it really is. He needs to grow up and acknowledge that there\\u2019s an issue instead of letting us burn in quiet. \\n\\nEverybody on this thread is trying to explain why he acted this way, but it definitely doesn\\u2019t justify his actions. Nobody deserves to lose their way to pay bills or provide food on the table over something as ridiculous as this. Y\\u2019all heartless bastards need to grow the fuck up.\"", "title": "I accidentally came across my senior engineer on an online video game, now he’s being distant at work.", "upvote_ratio": 0.94, "url": "https://www.reddit.com/r/cscareerquestions/comments/1108zxj/i_accidentally_came_across_my_senior_engineer_on/"}, {"author": "whydidIdothis3920", "created_utc": 1597890118.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 1687, "post_id": "id1tug", "score": 7485, "subreddit": "cscareerquestions", "text": "\"What the hell?\\n\\nDid I waste my time doing CS if I want to get into web dev?\\n\\nSeem like CS is more for thing like embedded engineering, data engineering, etc.\\n\\nWhat is point of CS degree if i want to become web dev???\"", "title": "Why did I spend 4 year getting a CS degree for Web Development when people doing coding bootcamp for a few weeks and are able to get same jobs?", "upvote_ratio": 0.94, "url": "https://www.reddit.com/r/cscareerquestions/comments/id1tug/why_did_i_spend_4_year_getting_a_cs_degree_for/"}, {"author": "newgradsmackindab", "created_utc": 1643581730.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 529, "post_id": "sgktuv", "score": 6793, "subreddit": "cscareerquestions", "text": "\"Will keep it short and simple.\\n\\nI'm a new grad, and I received several offers from top companies and well known unicorns / startups.\\n\\nHow did I do it? Leetcode.\\n\\nThat's the name of the game currently. If you can do Leetcode, you WILL get a top offer from a top company. Thats all there is to it.\\n\\n**Here is how to properly leetcode:**\\n\\nDO NOT attempt to solve any questions on your own (YET!). Yes, you heard me right. I know I sound crazy. But solving ANYTHING on your own is a complete and utter waste of time. Don't even spend 5 minutes on a problem. You do not have the base knowledge yet. You will simply be getting frustrated, and spinning your wheels.\\n\\nSo, what do you do? simple.\\n\\n1. Go to grokking the coding interview (no DONT buy it. Waste of money) and look at their list of patterns.\\n2. Pick one pattern, and go to leetcode. Search for problems with that pattern.\\n3. Go through each problem for the pattern, and go STRAIGHT to the solution. Do not even spend 1 second trying to solve the problem. WASTE OF TIME.\\n4. Understand the solution DEEPLY. Make notes. Google things you don't understand. Watch videos on youtube about the solution. Go to the discussion section on leetcode and see what others came up with. Play around with the solution, modify variables, etc. Basically... UNDERSTAND THE SOLUTION AS DEEPLY AS YOU CAN\\n5. Move on to the next problem, and repeat.\\n6. After you have done this for enough problems, you will feel a lightbulb going off in your head. Congrats, now you know how to solve this pattern!\\n7. Go back and pick a new pattern, and do the same thing.\\n\\nBecause you aren't wasting time spending hours on a problem, in just 1-3 weeks, you will have a deep understanding of all the major patterns and common solutions to these patterns. You will be able to recognize how to break down a problem into specific patterns, etc.\\n\\nOnce you have done 300-400 problems like this (it sounds like a lot, but remember.. you are NOT wasting hours per problem trying to solve it.. so you will go through A LOT of problems in a short amount of time.. the key is NOT to memorize, but to UNDERSTAND THE PATTERNS), you can start going through company specific questions on leetcode by buying premium. You will notice you can solve them now on your own!\\n\\nCongrats, you just saved yourself months and months of headache and frustration.\"", "title": "The DEFINITIVE way on how to LeetCode properly. (Hint: You are most likely doing it wrong!)", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/cscareerquestions/comments/sgktuv/the_definitive_way_on_how_to_leetcode_properly/"}, {"author": "backpainjoe", "created_utc": 1623251468.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 1010, "post_id": "nvy7cj", "score": 6487, "subreddit": "cscareerquestions", "text": "\"So, this happened, I got rejected for- having a reddit account and being unbelievably stupid.   \\nI am Senior software engineer and was interviewing for a startup which just got huge funding. I got through first 4 rounds.  \\nNow here comes the last Engineering manager round. I was pretty confident. He asked me two Leetcode hard problems and I was able to do both. For the next question he asked me to open Reddit. Pretty weird, right ? Basically he just wanted to show me how reddit/subreddits/subcomments looks and design a database for it.  \\nHere comes the stupid part- I opened reddit from the browser I had logged in with my personal account. He asked me to open a post and to my great luck, all the usernames in that post were similar to these - pusyman34, hairylicker, largenuts. And he was trying to explain me how he needs me to design a database with these users. I was barely controlling my laughter at that moment. I started designing database and so far interview was going pretty interactive but now he kind of got distracted and started to check something else on his computer. He wasn't focussing on anything I was saying and he was just replying \\\"Yeah sure, it will work\\\". 10 minutes into the question and he suddenly said -\\\"okay I think I am done here.\\\" I was answering all his questions, we had still 30 mins left and this guy wanted to leave the discussion. Then it hit me like a train. He must have seen my username, searched my account and must have been seeing my posts and comments. And my account was just posts about trolling and hating corporate, 9-5, managers and whole software world basically.  \\nInterview Result - Rejected  \\nFeedback- LLD knowledge not up to mark(I was not asked a single question on LLD in any of my interview)   \\nMy reddit account - now deleted\\n\\nEdit- Some of you are thinking interviewer asked me to open my reddit account. No, he asked me to open reddit. I was the dumbass who opened it in the browser I was logged in.\"", "title": "My Reddit account cost me my next SDE job(95% sure)", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/cscareerquestions/comments/nvy7cj/my_reddit_account_cost_me_my_next_sde_job95_sure/"}, {"author": "FeelingReallyBadTA", "created_utc": 1533661510.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 518, "post_id": "95dgrx", "score": 6005, "subreddit": "cscareerquestions", "text": "\"Using a throw away account here. I just need to get this off my chest because I currently feel like Hitler. I haven't told anyone this irl yet because part of me is still hoping I'm asleep and this is a nightmare\\n\\nI interviewed with a small start up in the city this morning. Phone screening went *incredibly* well, and I was feeling good about this place. They don't have a dedicated room for interviews, and the place was small enough that really all the engineers were just taking part of it\\n\\nWe were at the white board and I was drawing a diagram for a system design question. I didn't know they had an office dog. I didn't know the office dog was about 18 and the founders best friend since childhood. I didn't know the little guy (i'm talking super little, like squirrel small) liked to hang around peoples feet.\\n\\nI took a step back from the board to take a look at something better and stepped on her. I don't mean stepped on her foot or something. I mean right on her proper. She gave out a heart shattering yelp and died after squirming a little bit.  I still can't fathom that this actually happened. The founder started to sob uncontrollably and I think everyone else was in just as great disbelief \\n\\nI don't know how to try and make something like that right. I don't think I could handle working there even if they did still want me. I just kind of apologized profusely and left. How do you even make up for something like that?\"", "title": "I am absolutely mortified and embarrassed beyond belief and I have zero idea what to do", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/cscareerquestions/comments/95dgrx/i_am_absolutely_mortified_and_embarrassed_beyond/"}, {"author": "Throwaway75623594", "created_utc": 1608260349.0, "link_flair_template_id": "10926bda-1232-11e5-a7a9-0e9aedb4175b", "link_flair_text": "Lead/Manager", "num_comments": 1464, "post_id": "kfcmbj", "score": 5772, "subreddit": "cscareerquestions", "text": "\"Throwaway for obvious reasons.\\n\\nI've spent the last year planning my exit strategy. I moved to somewhere with a lower cost of living. I lowered my expenses. I prepared to live on a fraction of my income.\\n\\nThen I quit my job as a Principal Software Engineer for a major tech company. They offered me a promotion, I said no. I have zero plans of ever getting another job in this industry.\\n\\nI love coding. I love making software. I love solving complex problems. But I hate the industry and everything it's become. It's 99% nonsense and it manufactures stress solely for the sake of manufacturing stress. It damages people, mentally. It's abusive.\\n\\nI'm sick of leetcode. I'm sick of coding interviews. I'm sick of everyone being on Adderall. I'm sick of wasting time writing worthless tests. I'm sick of fixing more tests than bugs. I'm sick of endless meetings and documents and time tracking tools. I'm sick of reorgs. I'm sick of how slow everyone moves. I'm sick of the corporate buzzwords. I'm sick of people talking about nebulous bullshit that means absolutely nothing. I'm sick of everyone above middle management having the exact same personality type. I'm sick of worrying about everyone's fragile ego. I'm sick of hissy fits. I'm sick of arrogance. I'm sick of political games. I'm sick of review processes that encourage backstabbing. I'm sick of harassment and discrimination. I'm sick and I'm tired.\\n\\nAnd now I don't have to deal with it anymore.\\n\\nI've never felt happier. It's as if I've been freed from prison.\\n\\nI won't discourage anyone from pursuing a career in software, but I will encourage everyone who does to have an exit plan from day one. One day, you'll realize that you're rotting from the inside out.\\n\\n**Edit**\\n\\nI wasn't expecting this many responses, so I'll answer some questions here.\\n\\nI'm in my early 40's and I've been doing this since college.\\n\\nI didn't get a large sum of money, I simply moved to a small place in a small town where I'll be taking a part time job working outdoors. I was living in a tech center with a high cost of living.\\n\\nI've worked at 7 companies, including Microsoft and Amazon. The startups were much nicer, but they become more corporate over time.\\n\\nFinding a good company culture is mostly luck, and I'm tired.\\n\\n&#x200B;\"", "title": "I've walked away from software development.", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/cscareerquestions/comments/kfcmbj/ive_walked_away_from_software_development/"}, {"author": "InterestingArgument", "created_utc": 1668623580.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 1339, "post_id": "yx1v9z", "score": 5650, "subreddit": "cscareerquestions", "text": "\"https://www.bbc.com/news/business-63648505\\n\\nCorrectiona: till Thursday.\"", "title": "Elon Musk tells Twitter staff to work long hours or leave. Have till Friday to submit pledge.", "upvote_ratio": 0.94, "url": "https://www.reddit.com/r/cscareerquestions/comments/yx1v9z/elon_musk_tells_twitter_staff_to_work_long_hours/"}, {"author": "Real_Obligation_4449", "created_utc": 1633714408.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 385, "post_id": "q42lgm", "score": 5461, "subreddit": "cscareerquestions", "text": "\"**\\\\[Update to** [**Name and Shame: LoanStreet (NY) cheated me out of equity**](https://www.reddit.com/r/cscareerquestions/comments/o3jpfc/name_and_shame_loanstreet_ny_cheated_me_out_of/)**\\\\]**\\n\\nLast summer, **I was overwhelmed by the positive response** of online forums for workers in the technology industry **when** **I** [**shared**](https://www.reddit.com/r/cscareerquestions/comments/o3jpfc/name_and_shame_loanstreet_ny_cheated_me_out_of/) [**the**](https://www.glassdoor.com/Reviews/Employee-Review-LoanStreet-NY-RVW48628117.htm) [**true story**](https://www.teamblind.com/post/Name-Shame-LoanStreet-NY-cheated-me-out-of-equity-rRKGJAj3) of how my former employer, [LoanStreet](https://www.loan-street.com/) (NY), cheated me out of equity compensation and fired me without warning in the middle of the COVID hiring freeze. Thousands of people went out of their way to read, upvote, and comment on my posts, spreading the message far and wide. **It was amazing to see people from around the world join forces to protect vulnerable, at-will workers from exploitative opportunists.**\\n\\n**In response, LoanStreet and its** [**CEO Ian Lampl**](https://www.linkedin.com/in/ian-lampl-b7a5b684/) **have** [**sued me**](https://dockets.justia.com/docket/new-york/nysdce/1:2021cv06166/563584) **for at least three million dollars in U.S. federal court.** They are throwing the kitchen sink at me, accusing me of breach of contract, defamation, injurious falsehood, unfair competition, and false designation of origin. **All the accusations are either false or are attempts to enforce contract provisions that are illegal under federal labor law.**\\n\\n[**LoanStreet's legal complaint**](https://www.dropbox.com/s/5g263cnc22yursj/Federal%25252525252525252525252520Court%25252525252525252525252520Complaint%2525252525252525252525252019%25252525252525252525252520Jul%2525252525252525252525252021.pdf?dl=0) **against me is riddled with inaccuracies**, accusing me of all sorts of things I had nothing to do with. **Attempting to discredit me and distract from its lack of any supporting evidence, LoanStreet drags my name through the mud with wild lies** about my professional abilities and my motivation for sharing my experience, using phrases like \\\"intent of...whipping up an angry mob\\\"; \\\"acted maliciously, oppressively, with an improper and evil motive\\\"; \\\"delusions of grandeur\\\"; \\\"wickedness of \\\\[my\\\\] intentions\\u201d; and \\\"pernicious intentions.\\u201d\\u00a0I'm not sure if I'm being sued by LoanStreet or Charles Dickens.\\n\\n**To LoanStreet and CEO Ian Lampl: US law is on my side and I will prevail in court. Common sense and morality are on my side and I will prevail in the court of public opinion.** My donors and I can and will keep this fight up as long as is needed to ensure you cannot blindside anyone else, and to set a legal precedent that will protect all American workers from companies like you. Multiple former LoanStreet employees who feel you took advantage of them have reached out to thank me for standing up to you. You got away with discreetly abusing employees for a long time, but now you are reaping what you sowed.\\n\\nMedia coverage:\\n\\n* [Ladders](https://www.theladders.com/career-advice/a-former-employee-trashed-his-employer-online-now-theyre-suing-him)\\n* [Business Insider](https://www.businessinsider.com/bad-glassdoor-reddit-review-led-to-a-1-million-lawsuit-2021-8)\\n* [The Hustle](https://thehustle.co/08052021-glassdoor-lawsuit/)\"", "title": "Name & Shame: LoanStreet (NY) is suing me for over $3M in federal court after I warned potential employees about the company's labor practices", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/cscareerquestions/comments/q42lgm/name_shame_loanstreet_ny_is_suing_me_for_over_3m/"}, {"author": "newintownla", "created_utc": 1653510430.0, "link_flair_template_id": "0968d7a4-1232-11e5-a323-0e1422b8b60b", "link_flair_text": "Experienced", "num_comments": 340, "post_id": "uxqaf9", "score": 5262, "subreddit": "cscareerquestions", "text": "\"[Original Post](https://www.reddit.com/r/cscareerquestions/comments/uurkw4/i_broke_production_and_now_my_tech_lead_says_he/)\\n\\nI actually can't believe how this turned out. I think this might be the best thing that has ever happened to me in my entire life.\\n\\nI ended up having it out with my tech lead. We got into a couple of heated exchanges when I pushed the cause of this incident back on him since he knew production was vulnerable, and failed to address the root issue for over a year. He didn't like that, so he tried to have me demoted and removed from any development tasks, so I quit on the spot. The next day, the CEO called me, and we had a pretty productive chat about the whole situation. Our chat ended with with him telling me, \\\"I like you. I respect you, and I am definitely listening to what you're saying. I hope we can work together again sometime in the future in some capacity.\\\"\\n\\n&#x200B;\\n\\nNow for the best part...\\n\\n&#x200B;\\n\\nI had mentioned in some response comments in the previous thread that I had been applying for jobs the previous week before this incident occurred.  As of today, I got an offer for a much larger, more established company for a 100% remote position with a 133% increase in salary, full benefits and all.\\n\\n&#x200B;\\n\\nAs for what's next, It's a 2 week process for on-boarding at the new place which is mostly handled on their end, so I'm going on vacation. I'm taking my girlfriend to every beach town in California for the next 2 weeks.\\n\\n&#x200B;\\n\\nEdit: I forgot to mention that the tech lead went to the client and named me personally as the one who broke their production DB. That sent me over the edge with him which is what made me walk on the spot.\"", "title": "[Update] I broke production and now my tech lead says he doesn't trust me", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/cscareerquestions/comments/uxqaf9/update_i_broke_production_and_now_my_tech_lead/"}, {"author": "HexadecimalCowboy", "created_utc": 1639285614.0, "link_flair_template_id": "0968d7a4-1232-11e5-a323-0e1422b8b60b", "link_flair_text": "Experienced", "num_comments": 476, "post_id": "rehnfm", "score": 5116, "subreddit": "cscareerquestions", "text": "\"LOG4J HAS OFFICIALLY RUINED MY FUCKING WEEKEND. THEY HAD TO REVEAL THIS EXPLOIT ON THE FRIDAY NIGHT THAT I WAS ON-CALL. THEY COULD NOT WAIT 2 FUCKING DAYS BEFORE THEY GREW A THICK GIRTHY CONSCIENCE AND FUCKED ME WITH IT? ALSO WHAT IS THEIR FUCKING DAMAGE WITH THIS LOGGING PACKAGE BEING A DAY-0 EXPLOIT? WHY IS A LOGGING PACKAGE DOING ANYTHING BESIDES. SIMPLY. LOGGING. THE. FUCKING. STRING? YOU DICKS HAD **ONE** JOB. NO THEY HAD TO MAKE IT SO IT COULD EXECUTE ARBITRARILY FORMATTED STRINGS OF CODE OF COURSE!!!!!! FUCK LOGGING. FUCK JAVA. AND FUCK THAT MINECRAFT SERVER WHERE THIS WAS DISCOVERED.\"", "title": "LOG4J HAS OFFICIALLY RUINED MY WEEKEND", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/cscareerquestions/comments/rehnfm/log4j_has_officially_ruined_my_weekend/"}, {"author": "12838929382", "created_utc": 1540036241.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 429, "post_id": "9ptj1r", "score": 5005, "subreddit": "cscareerquestions", "text": "\"I was being underpaid and contacted the rival company, known for paying good salaries. It was my first time doing a hackerrank style interview and failed it. I obviously haven't told anyone about it so I'm positive their HR told my boss to create a toxic work environment for us, which they succeeded in doing. Not sure how to deal with this, I am quitting so it shouldn't matter but still left a bitter taste in my mouth\"", "title": "Applied to our main competitor, they told my boss about it", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/cscareerquestions/comments/9ptj1r/applied_to_our_main_competitor_they_told_my_boss/"}, {"author": "throwawayforsec1045", "created_utc": 1572763258.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 1080, "post_id": "dqwwol", "score": 5010, "subreddit": "cscareerquestions", "text": "\"Before I get loads of comments telling me \\\"You just don't get it\\\" or \\\"You have no relevant experience and are just jealous\\\" I feel I have no choice but to share my credentials. I worked for a big N for 20 years, created a spin off product that I ran till an IPO, sold my stake, and now live comfortably in the valley. The posts on this sub depress me. I discovered this on a whim when I googled a problem my son was dealing with in his operating systems class. I continued to read through for a few weeks and feel comfortable in making my conclusions about those that frequent. It is just disgusting. Encouraging mere kids to work through thousands of algorithm problems for entry level jobs? Stressing existing (probably satisfied) employees out that they aren't making enough money? Boasting about how much money you make by asking for advice on offers you already know you are going to take? It depresses me if this is an accurate representation of modern computational science. This is an industry built around collaboration, innovation, and problem solving. This was never an industry defined by money, but by passion. And you will burn out without it. I promise that. Enjoy your lives, embrace what you are truly passionate for, and if that is CS than you will find your place without having to work through \\\"leetcode\\\" or stressing about whether there is more out there. The reality is that even if there exists more, it won't make up for you not truly finding fulfillment in your work. I don't know anyone in management that would prefer a code monkey over someone that genuinely cares. Please do not take this sub reddit as seriously as it appears some do. It is unnecessary stress.\"", "title": "This sub infuriates me", "upvote_ratio": 0.89, "url": "https://www.reddit.com/r/cscareerquestions/comments/dqwwol/this_sub_infuriates_me/"}, {"author": "Pathological_Liar-", "created_utc": 1676328986.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 226, "post_id": "111mq5e", "score": 4835, "subreddit": "cscareerquestions", "text": "\"Former drug addict (20-25) and was able to get my Software Engineering degree two summers ago at age 30 (2021). I completed an embarrassingly amount of applications. I was losing hope. \\n\\nA local company finally gave me the break I desperately needed  \\n\\nI really don't have any family or friends left. Just wanted to share. It has been a long ride.\"", "title": "After Almost Two Years It Finally Happened", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/cscareerquestions/comments/111mq5e/after_almost_two_years_it_finally_happened/"}, {"author": "anonymouspsy", "created_utc": 1626665759.0, "link_flair_template_id": "05438160-1232-11e5-b573-0e1422b8b60b", "link_flair_text": "New Grad", "num_comments": 474, "post_id": "on60qg", "score": 4590, "subreddit": "cscareerquestions", "text": "\"Might be a silly question, but I've recently started using the site more to see what I've been missing. \\n\\nIt seems like all I see is random \\\"inspiration posts\\\" with hashtag spam\\n\\nego circlejerking of \\\"I am ex google ex Facebook ex NASA you should listen to me\\\"\\n\\n\\\"I just hit 10,000 followers, thanks!\\\"\\n\\n\\\"2 years ago I was a janitor at my local 7-Eleven, now I'm a software engineer at Google\\\"\\n\\nDo I have to partake in this shit to move up? Am I the one missing out?\"", "title": "Is Anyone Else Weirded Out by LinkedIn Culture?", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/cscareerquestions/comments/on60qg/is_anyone_else_weirded_out_by_linkedin_culture/"}, {"author": "SomeGuyInSanJoseCa", "created_utc": 1612304280.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 222, "post_id": "lb88w1", "score": 4509, "subreddit": "cscareerquestions", "text": "\"His ex-wife is giving away half of his money, he lost all his hair, and now he's got to go through the Leetcode grind.\\n\\nAmazon is ruthless.  Feel sorry for the guy.  If someone in Google can hook up with a referral, that'd be nice.\\n\\nWell, at least he's got FAANG on his resume.\"", "title": "Damn, you know it's bad when Jeff Bezos got PIP'd.", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/cscareerquestions/comments/lb88w1/damn_you_know_its_bad_when_jeff_bezos_got_pipd/"}, {"author": "TomBakerFTW", "created_utc": 1670274599.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 431, "post_id": "zdjsux", "score": 4325, "subreddit": "cscareerquestions", "text": "\"Y'know those questions Indeed asks you about current and previous jobs while you're applying?\\nI just got fired because I answered some of those questions honestly. I thought it was anonymous (I could swear they told me that it was anonymous....) well it turns out that it mentions your position.\\n\\nSince I'm the only person at my company with that position it was clear who answered the question naming my company as toxic.\\n\\nWell, just like a toxic employer, they fired me for it.\\n\\nUPDATE: I found a job about a week after being fired. It pays a lot less, but it's a much better environment.\\n\\nFuck you Indeed!\"", "title": "PSA: Don't answer Indeed's questions, it could get you fired.", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/cscareerquestions/comments/zdjsux/psa_dont_answer_indeeds_questions_it_could_get/"}, {"author": "None", "created_utc": 1639783676.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 562, "post_id": "ritq3j", "score": 4291, "subreddit": "cscareerquestions", "text": "\"I spent Monday-Wednesday absolutely slaving away for corporate, working long hours and producing excellent work. This work has been essential to the team and the overall project and the team is happy, management is impressed.\\n\\nToday and yesterday? Oh you know read some Harry Potter, played some Diablo 2, and moved the cursor around every 10 minutes cause I\\u2019m exhausted. \\n\\nCan we just cut the bullshit and come up with a new work format which promotes better work/life balance?\"", "title": "I believe the 9-5, M-F format is outdated. Especially for Software Engineers", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/cscareerquestions/comments/ritq3j/i_believe_the_95_mf_format_is_outdated_especially/"}, {"author": "texzone", "created_utc": 1651051795.0, "link_flair_template_id": "0968d7a4-1232-11e5-a323-0e1422b8b60b", "link_flair_text": "Experienced", "num_comments": 338, "post_id": "uczkay", "score": 4252, "subreddit": "cscareerquestions", "text": "\"I must introduce this guide first with this preamble: I cannot for the life of me believe that people are *not* doing this. I mean that literally - I believe, and to a larger degree, I hope, that this is all useless information.\\n\\nHowever, I have helped close to three dozen friends go from getting nearly zero interviews or even responses, to getting them all the time, just by... get ready for it... this one simple trick.\\n\\n\\\\------------------------------------------------------------------------------------------------------\\n\\nIf your primary strategy for applying to jobs is by going to [indeed.com](https://indeed.com), [monster.com](https://monster.com), [jobs.linkedin.com](https://jobs.linkedin.com) \\\\- etc, and hitting submit on an application, then I am so happy to inform you that you're just doing this wrong. I have applied to many jobs this way, and I have sparingly seen a response. Why? Because I'm a shithead, and no one wants to hire a shithead.\\n\\nSo, what did I do instead, and what did all my other shithead friends do instead?\\n\\n# What The Hell To Do Instead\\n\\nHAVE A RESUME THAT LOOKS GOOD\\n\\nI have seen so many resumes from newgrads and junior engineers with the most *blegh* looking resumes. I am not talking content here - by now, I hope you know how to make your resume sound, and this is not going to be a guide on how to make your resume *sound* good. But for the love of God, if you're making your resume on microsoft word, do yourself a favor and [make yourself a resume on overleaf.](https://www.overleaf.com/gallery/tagged/cv) Or whatever you want. Make it look good. Overleaf makes it hella easy, especially if you're a developer. Don't know LaTeX? Neither do I, and I got by just fine, and, remember, I'm a shithead. You can figure it out, I promise.\\n\\nOkay, have a nice looking resume? Good.\\n\\n&#x200B;\\n\\n# Use LinkedIn to Contact People. Seriously.\\n\\nI have never, ever, *ever*, sent an application randomly through one of those crap-chute websites and expected to ever hear anything back. And guess what? Lo and behold, I nearly never hear back. So, here's what I do.\\n\\nLet's say I want to apply to a Spotify job. I'll go to Spotify's \\\"careers at spotify\\\" page, and look for two, three maximum, roles that sound right for me. Then, I go on [linkedin.com](https://linkedin.com) and search \\\"Spotify\\\" and land on their company page. You should see something like [this](https://imgur.com/a/uoIPIXH).\\n\\nThen, I click on the [People](https://imgur.com/a/ZBT5oOg) tab.\\n\\nThen, I look at the [filters that are immediately available.](https://imgur.com/a/TQRLKxk)\\n\\nAnd I apply some filters!\\n\\nYou want people in Engineering. You want people who went to your college. You want people who studied what you studied. You want people who are first, second, or even third connections. Just add as many filters as *you* can. The more related they are to you, the better!\\n\\nThen, start mass-adding people that clear the filters. If they are already a connection - great, send them a message. If they went to your school (this is very helpful) - great, send them a message. If they have your first name - great, send them a message.\\n\\nIf they share fuck-all with you, great, send them a message!\\n\\nBut they have to accept your connection first, of course, if you don't have Linkedin premium. A lot of them will. Some of them won't. Whatever, doesn't matter. You really just want 1-3 people.\\n\\nOnce you have at least one person accept your connection request, send them a message! You don't want more than a paragraph. 1-2 sentences telling them why you are messaging them, 1-2 sentences introducing yourself, and 1-2 sentences to just shoot the shit. Something like:\\n\\n\\\"Hey, my name is Texzone, and I am messaging you because I am interested in a job at Spotify. These roles I have sent below seem like a great fit for me (send roles after sending the intro message), and, I would love if you could refer me. I am a newgrad interested in backend development with a focus in data engineering, and I have some experience under my belt that I think would be beneficial to Spotify. \\\\[insert line about your qualifications; seriously, Keep It Simple, Stupid\\\\]. Thank you so much for everything, and have a great day!\\\"\\n\\nThat's it.\\n\\n\\\"*But* u/texzone\\\\*, that's so annoying! I'm surely harassing them by doing this!\\\"\\\\*\\n\\nYou idiot. You know, if they refer you and you get accepted, most companies have a bonus that they offer the employee! It ranges anywhere from 2k-10k. And all they have to do is drag-and-drop your resume on some shitty internal portal, then continue picking their nose while watching whatever tiktok nonsense they were watching when you messaged them.\\n\\nEven if they don't get any money out of it, people like helping other people. Really, it's true. They do.\\n\\nAnd, with a referral, you are almost *guaranteed* an interview if you:\\n\\n1.\\tHave a clean looking resume and it sounds good.\\n2.\\tYou are applying to a role that matches your background/experience, at least loosely.\\n3.\\tThat's it.\\n4.\\tYeah that's really it.\\n5.\\tI swear.\\n\\nEasy. I have applied to dozens upon dozens of jobs this way, and I have gotten interviews at nearly every single damn one. My resume isnt amazing. My experience isn't way out there. My friends? A lot of them had a clean looking resume, but had shit-all for experience. But they all got interviews as well.\\n\\n&#x200B;\\n\\nI am sharing this because I am forced to believe people aren't doing this, and are instead hitting submit on some portal. This is by far the worst god damn way to ever apply *anywhere* nowadays. Unless your resume is filled with jargon, years of experience, and a sprinkle of FAANG, forget this ever being a smart way to apply to jobs.\\n\\nSo, that's how I, a shithead, have gotten over a hundred (I'm seriously not kidding) interviews over three cycles of job hunts that lasted about 3-5 months each. I applied once when I graduated, once during COVID, and just finished a job hunt right now.\\n\\nI *now* have some impressive stuff on my resume, thankfully. I look less and less like a shithead, and more like a professional - much to the dismay of the world - and I *still* don't ever hear back (rarely) from applying to jobs \\\"normally.\\\" I still do apply normally - I'll send out applications every month or so, even when I'm working, so I can keep interviewing and stay ontop of my interviewing game. But from, say, 50 applications I send out, I'll maybe hear one  response.\\n\\nBut when I apply the way I described above? If the person delivered, and referred me, I never *don't* hear back. Neither do my friends. And I will almost always find someone to refer me. So... yeah, I hope this helps.\\n\\n&#x200B;\\n\\nNote: I guess this may not work for super small startups. Whatever.\\n\\n# FAQs\\n\\n1.\\tIs this method something you would recommend for internships?\\n   1. No, not really - this method is something that I strongly encourage for full time jobs. Internships, co-ops, etc - those are a different beast and I know nothing about that. A college internship? ...Maybe. A High school one? ...Unlikely.\\n2.\\t***AM I SUPPOSED TO SUBMIT MY APPLICATION BEFORE OR AFTER THEY REFER ME***\\n   1. ***VERY VERY VERY VERY VERY MUCH AFTER! DONT APPLY, LET THEM APPLY FOR YOU!*** If you apply before they refer you, well, then, you applied, and they can no longer refer you. So don't apply unless they explicitly tell you to do so.\\n3.\\tAm I supposed to contact recruiters?\\n   1. Yes. They are excellent. Yes, do contact them. But honestly I've just never really had much luck with them.\\n4.\\tDo I attach my resume unprompted?\\n   1. Up to you really. I usually don't. But you can. Especially if u like it\\n\\n## Edit\\n\\nThis strategy may not be so effective anymore. Good luck, its rough out there right now.\"", "title": "Referrals Are King - A Shithead Guide On Successfully Applying To Jobs, Even - ESPECIALLY - When You're A Shithead.", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/cscareerquestions/comments/uczkay/referrals_are_king_a_shithead_guide_on/"}, {"author": "Real_Obligation_4449", "created_utc": 1635358628.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 697, "post_id": "qh2xho", "score": 4236, "subreddit": "cscareerquestions", "text": "\"\\\\**This is an update to* [*Name & Shame: LoanStreet (NY) is suing me for over $3M in federal court after I warned potential employees about the company's labor practices*](https://www.reddit.com/r/cscareerquestions/comments/q42lgm/name_shame_loanstreet_ny_is_suing_me_for_over_3m/)*\\\\**\\n\\n# Subpoena\\n\\n**Last Friday,** [**LoanStreet (NY)**](https://www.loan-street.com/) **and its** [**CEO Ian Lampl**](https://www.loan-street.com/company#hs_cos_wrapper_widget_1542403709654) **asked a federal judge to force Reddit to de-anonymize** ***every*** **post and comment I've written in my entire life by revealing** ***every*** **username I have** ***ever*** \\\\*\\\\*used.\\\\*\\\\***^(1)**\\n\\nIf you want to experience a company praise your work for over a year only to fire you without warning or severance in the middle of a pandemic, screw you out of promised compensation, *and* punish you for talking about it by trying to bankrupt you and publicly link you to every Reddit comment or post you've written under any username since you were born, LoanStreet is the company for you!\\n\\n**Publicly identifying the Reddit usernames that I used when I was in middle school and/or only for posts unrelated to LoanStreet can serve no purpose, in my opinion, other than to try to harass and embarrass me and to intimidate other exploited employees into silence.**\\n\\nJust when you think LoanStreet can't stoop any lower, they do. **At this point, no one is making the dangers of working at LoanStreet clearer than LoanStreet itself.**\\n\\n# Commentary\\n\\nI want to address a few things that have been brought up in the comments on my posts:\\n\\n* I completely agree that people should be skeptical of any claims they hear, including any that LoanStreet or I might have made. That said, **I wouldn't be risking millions of dollars in penalties for lying if I didn't know that I haven't.**\\n* Last summer, LoanStreet threatened to sue me unless I took down all of my posts and paid for the \\\"reputation management\\\" costs it had incurred as a result of my posts.^(2) So while I respect the right of real Redditors to be skeptical of and to disagree with me, I encourage everyone to keep in mind that **LoanStreet has admitted to paying professional stooges to counteract my story** (and the stories of other former employees it has baselessly accused me of authoring). While LoanStreet has not revealed the specifics of these manipulations, be on the lookout for odd clusters of comments, upvotes, and downvotes on posts about LoanStreet. Where there is sensuous bootlicking, there could well be money changing hands.\\n* **Do not threaten violence or joke about committing violence against anyone from LoanStreet**. The right way to fight for justice is by sharing accurate information about LoanStreet's labor practices and protecting access to that information.\\n* **Just because a non-disparagement clause is in a signed contract** [**does not mean it's legal**](https://www.reuters.com/article/labor-nondisparagement/law-firms-broad-non-disparagement-pact-violated-labor-law-nlrb-general-counsel-idUSL2N27V1RN)**.**\\n* **None of the factual or legal claims in LoanStreet's legal complaint have been vetted by a judge or jury yet.** Take them with a grain of salt. Many will not age well.\\n* **Most workers who are exploited cannot afford to fight back. Those of us who can, must.** LoanStreet would only pay severance to the people it abruptly fired^(3) if they signed permanent non-disparagement agreements. It forced these people - who, for example, had kids, were pregnant, and/or had a spouse already out of work during the pandemic - to choose between protecting their families from financial strain and protecting other workers from LoanStreet's exploitation. I doubt I would have taken on the risks I have if I had had a spouse or child that I was endangering by doing so. I am inspired to continue fighting by the former LoanStreet employees and people around the world who have thanked me for standing up for what's right. Ideally, this episode causes companies in general to think twice before exploiting their employees and empowers workers with knowledge of [their rights](https://www.nlrb.gov/about-nlrb/rights-we-protect/your-rights/employee-rights).\\n* I am comfortable accepting the risk of some employers passing on me over this in the future. Those aren't companies I would want to work for, anyway. I currently have a good job with a company I trust and I have no doubt I could find another. I think you'll find that most people, including hiring managers, believe that vulnerable, at-will workers should be able to warn each other about egregiously exploitative companies.\\n\\n# Footnotes\\n\\n1. [Link to LoanStreet's requested subpoena](https://we.tl/t-rZw13hIUPT), which would force Reddit to hand over \\\"Documents sufficient to show the identity of all Reddit user names used by \\\\[me\\\\]\\\" (Request No. 4). Together with the earlier instruction that \\\"The use of any tense of any verb shall be considered to also include within its meanings all other tenses of the verb so used\\\" (Instruction 7), LoanStreet and Lampl want to force Reddit to reveal *every* username I have *ever* used, regardless of its relevance to their claims.\\n2. They also appear to allude to these reputation management costs in their [complaint](https://www.dropbox.com/s/5g263cnc22yursj/Federal%25252525252525252525252520Court%25252525252525252525252520Complaint%2525252525252525252525252019%25252525252525252525252520Jul%2525252525252525252525252021.pdf?dl=0) (paragraph 108).\\n3. Reminder: the annualized turnover rate in my LoanStreet office was about 50% - much of it involuntary.\"", "title": "Name & Shame: LoanStreet (NY) wants federal judge to force Reddit to de-anonymize every post and comment I've written in my entire life", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/cscareerquestions/comments/qh2xho/name_shame_loanstreet_ny_wants_federal_judge_to/"}, {"author": "Strong_Taco1", "created_utc": 1595428254.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 497, "post_id": "hvuscm", "score": 4203, "subreddit": "cscareerquestions", "text": "\"I've been in the industry for a long time now. I have worked at 2 startups and both have pulled the \\\"we are a family here\\\" line on me. Well to any young job searcher reading this, I want you to know that this is the reddest of flags. Here is a story what I have experienced at my \\\"familiar\\\" company.\\n\\n- CEO says we are stronger together at the beginning of COVID and that we can ride out the wave. 1 month later he lays off half the company without warning. There were two meetings you were invited to, if you were in 1 you stayed, if you were in another you were gone. No notice. Great way to treat \\\"family\\\" eh?\\n\\n- Chat room was opened up for people to support each other in the times of COVID. Many people posted things like \\\"we can't be expected to be as productive when we have kids at home during a pandemic\\\" which is true. It just so happens that those same people are now gone.\\n\\n- Came out that a manager was harassing some of his employees. When they went to HR they defended him and the employees left the company. The harassing manager is still there.\\n\\n- People filled out \\\"anonymous\\\" surveys. 2 people who gave negative feedback were gone the next day.\\n\\nOf course, my only family is my wife and children. I just wanted to share that some of the most toxic places I have ever worked spout this \\\"family\\\" nonsense. Watch out for it.\"", "title": "Reminder: \"we're a family here\" is bullshit", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/cscareerquestions/comments/hvuscm/reminder_were_a_family_here_is_bullshit/"}, {"author": "AtomicLeetC0de", "created_utc": 1605172492.0, "link_flair_template_id": "05438160-1232-11e5-b573-0e1422b8b60b", "link_flair_text": "New Grad", "num_comments": 576, "post_id": "jsrmtw", "score": 4084, "subreddit": "cscareerquestions", "text": "\"Listen to my brilliant idea: We should create a new college major: Leetcode Engineering\\n\\nYear 1: cover basic Python\\n\\nYear 2: leetcode easy\\n\\nYear 3: leetcode medium\\n\\nYear 4: leetcode hard\\n\\nResult? PROFIT?: Tech job at GoOglE\\n\\n\\nAfter a long and worthy prior post battle, I have decided it is best to create a new college major focused on Leetcoding 24/7 to guarantee entry into a top tech company since CS is just so useless right.\\n\\nYou have research experience? Scrap it\\n\\nYou have 30 side-projects? Scrap them\\n\\nYou are fluent in 4-5+ coding languages? Focus on Python\\n\\nYou are top rank of your CS university? Scrap it, drop out now.\\n\\nYour key to success is to leetcode, leetcode.\\n\\n\\nThoughts or questions are welcomed.\"", "title": "Remove CS and replace with Leetcode Engineering", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/cscareerquestions/comments/jsrmtw/remove_cs_and_replace_with_leetcode_engineering/"}, {"author": "UnRenardRouge", "created_utc": 1639927860.0, "link_flair_template_id": "c9dd4bf2-b859-11e3-8535-12313d31e5b1", "link_flair_text": "Student", "num_comments": 563, "post_id": "rjz0e3", "score": 4028, "subreddit": "cscareerquestions", "text": "\"I get that having a good portfolio is a great tool in getting a job when you don't have experience in the industry, and I get that many people are very passionate about programming and would still be programming on their own even if they didn't have a job. But at the same time I see a lot of people and even employers with this idea that if you aren't programming regularly in your free time then you're somehow less of a programmer or that you should pick a different career all together.\\n\\nWhat is the point of this? I don't see this mindset present in many other industries. What's the problem with just wanting to code 9-5?\"", "title": "A plumber doesn't go home every day and fix his sink, a surgeon doesn't go home every day and preform operations, so why does a programmer have to go home every day and code?", "upvote_ratio": 0.93, "url": "https://www.reddit.com/r/cscareerquestions/comments/rjz0e3/a_plumber_doesnt_go_home_every_day_and_fix_his/"}, {"author": "WeeklyGuidance2686", "created_utc": 1665090213.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 868, "post_id": "xxg9ag", "score": 3971, "subreddit": "cscareerquestions", "text": "\"I\\u2019m on a small team. After posting a jr level job, we had +200 applicants on the first week. Most of these per our manager \\u201care on the back burner and won\\u2019t even be looked at\\u201d. \\n\\nMy team and I started conducting interviews and we have only done two of them so far and they are both referrals only. Two interviews next week, also only referrals. Everything is moving really slowly and one of the guys we interviewed only exposure to SWD is from a bootcamp he hasn\\u2019t finished yet. I was going to give him a LC medium but I asked him FizzBuzz instead and he wasn\\u2019t able to even begin it.\\n\\nLong story short, if you are a new grad or barley starting your career, to increase your chances at landing something, PLEASE network! There\\u2019s no one size fits all solution for this shitty mess, but I have found that DMing recruiters, hiring managers, going to career fairs, anything you got to do to put your name above a stack of +200 resumes, 97% of them which will likely not even be touched, really helps (didn\\u2019t do any of this until towards the end of my first job hunt hence the title). An influx of bootcamp grads/students, combined with covid, recessions, hiring freezes, and God only knows what else is the reason folks.\\n\\nAlso, no hate on the new people coming into the field or the bootcamp students. Keep grinding, keep working hard, keep learning new stuff! We are all going to make it, provided you stick to it and see it all the way through. But be honest and realistic with yourself as well.\\n\\n**EDIT**: https://leetcode.com/problems/fizz-buzz/description/\"", "title": "Now I understand why it took me so long to land an entry level job", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/cscareerquestions/comments/xxg9ag/now_i_understand_why_it_took_me_so_long_to_land/"}, {"author": "PecDeck", "created_utc": 1709649536.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 355, "post_id": "1b76qha", "score": 3964, "subreddit": "cscareerquestions", "text": "\"Just wanted to put a bit of positivity out there since this sub gets mostly negative posts.  At 32 I'd decided that I fucking hate sales, I had no degree, and I saw no other real option for growth without one.  I saw that Software Engineer degrees were the #1 job on US World Report or something like that, and the salaries looked great, so I signed up for that degree plan in night school because I'd always liked computers.  I had no fucking idea how difficult this degree was going to be.  I have no passion for math and honestly not a huge interest in programming before, but I stuck with it and a few years later got my degree this last December.  In the beginning of last fall, I honestly thought I'd made the worst mistake of my life.  I sat here and read this sub and looked on YouTube about how there's no jobs, and was basically having complete breakdowns several times a week.  I was a mess.  I also, had almost no idea how to code because the degree plan had just kicked my ass, so I was just barely keeping passing in my classes.  From August to December, I went on Leetcode every day, and submitted applications every day.  It was a fucking nightmare.  I had no idea how to do even the most basic Leetcode questions.  For two months, it was staring at every single Leetcode question and having no idea how to do it, meanwhile just getting job rejection letters in my e-mail.  Over and over and over.  Day after day- failure and rejection constantly.  But I went to every job fair my school offered and got there three hours before they opened so I could be first in line, and filled out about 800 job applications (which I know isn't many compared to some people I see on here).  Anyways, eventually I landed a great Development Engineer job and didn't even have to do any coding in the interview.  High fresh grad salary for the area (North Texas) and a job I really enjoy.    \\n\\n\\nEven if you fucked off through school, even if you fucked off through your 20's like I did, you can still turn this around.  There ARE jobs- but you have to bust your ass to get yourself in front of as many as possible, and you probably have to spend months getting rejections too.  And for everyone that feels discouraged starting late, my completely unrelated work experience that every fuckface resume review person I sat down with told me would make me less hirable, was what made my boss told me made my resume stand out from the 300 he looked through.  It's not the scarlet letter they say it is.  \"", "title": "I did it. Fresh Grad. 35 years old. 2.8 GPA. 95k salary.", "upvote_ratio": 0.92, "url": "https://www.reddit.com/r/cscareerquestions/comments/1b76qha/i_did_it_fresh_grad_35_years_old_28_gpa_95k_salary/"}, {"author": "burnbabyburn694200", "created_utc": 1692467684.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 719, "post_id": "15vmsnk", "score": 3917, "subreddit": "cscareerquestions", "text": "\"3 YoE.\\n\\nRecruiter pinged me on LinkedIn.\\n\\nI said sure, send me the OA just to humor the idea.\\n\\nThey sent me a take home assignment that I'm expected to spend \\\"6-8 hours on\\\", unpaid, to write a heavy graph traversal algorithm given an array of charging station objects with a bunch of property attributes like coordinates attached to each object.\\n\\nLaughed and immediately closed it and went about my day.\\n\\nWhat a f*cking joke \\ud83d\\udc80\"", "title": "A recruiter from Tesla reached out and I cannot believe what this sh*tcan of a company expect from applicants.", "upvote_ratio": 0.94, "url": "https://www.reddit.com/r/cscareerquestions/comments/15vmsnk/a_recruiter_from_tesla_reached_out_and_i_cannot/"}, {"author": "digitalbiz", "created_utc": 1627427157.0, "link_flair_template_id": "10926bda-1232-11e5-a7a9-0e9aedb4175b", "link_flair_text": "Lead/Manager", "num_comments": 312, "post_id": "osxhf6", "score": 3913, "subreddit": "cscareerquestions", "text": "\"It's very basic thing but often ignored so thought to put it out.\\n\\nI don't know if you would believe it or not, but some junior developers are shit scared when they join any team. I had a couple in my previous job, one in a job before that and a few now. \\n\\nSome go well along with the flow and throw in so much productivity. Some, however, aren't able to perform at their full potential even though they know a bunch of stuff and super technical.\\n\\nUsually what blocks them is company/team/project specific things which they aren't able to figure out on their own.\\n\\nI used to be that guy 7 years ago. Asking my senior peers was such an issue for me. There was a sense of judgement which held me off from asking more than a predetermined number of questions to any senior guy in the team. Part of this also had to do something with the fact how douchebag some of the senior devs in my team were. A few would literally reply with wink emojis and sarcastic replies when I asked them for a help in solving merge conflicts in my initial years, after I tried to figure out on my own by staying awake whole night reading git articles and exploring stackoverflow like a maniac. Trust me, no matter how simple you think it is and that junior guy should know this, sometimes it literally is impossible for them.\\n\\nSome junior guys break out in company washrooms too.\\n\\nSeriously, some senior devs don't have tolerance around taking more than 4-5 questions a day from junior devs and it can be seen/felt through their body language. Their main excuse is they should figure it out on their own, but sometimes it's soul killing to the junior guys. Trust me, I have been there.\\n\\nKeeping my past in mind, I tell these things repeatedly to any new intern/junior who joins in my team.\\n\\n\\\"Hey, look, feel free to ask as many questions you want. I personally prefer to get asked more questions from you. The more you ask, the more we both learn. And, you know what, your mind will tell you to not ask more questions when you already asked me 4 doubts in a day (at this statement, they show their smiling/nodding face in video chat because it's the fact for them), but, don't listen to your mind. Thats' the limit you set in your mind thinking it's not ok to ask more than a few doubts a day to any person. I would be ok even if you ask me 50-100 things a day. So, feel free to throw them in my slack and never feel hesitated to ask your questions. Even if you personally think, this might be a silly doubt, throw it in. I will never judge you for that.\\\"\\n\\nThis gives them so much confidence and assurity to get unblocked fast and be more productive. Not only that, they speak highly of you with upper management and HRs which gets you additional brownie points. So, it's a WIN WIN.\\n\\nTldr: Be nice to junior devs. You were also junior once.\"", "title": "Here's few things I am telling junior developers in 1:1 and it's working out pretty well", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/cscareerquestions/comments/osxhf6/heres_few_things_i_am_telling_junior_developers/"}, {"author": "DroughtFloodFamine", "created_utc": 1705673452.0, "link_flair_template_id": "0968d7a4-1232-11e5-a323-0e1422b8b60b", "link_flair_text": "Experienced", "num_comments": 1360, "post_id": "19ajyuq", "score": 3869, "subreddit": "cscareerquestions", "text": "\"I can\\u2019t be the only one who has started to notice this trend. First generation Indian gets a management role, and they hire 30 of their kinsmen as fast as they can. \\n\\nWe have a new manager that is fighting tooth and nail to hire people on visas, when there are perfectly qualified people here locally who I\\u2019m sure need the opportunity in this job climate. *Maybe* this was acceptable during talent shortages but the industry is hemorrhaging jobs and this trend needs to be addressed yesterday.\\n\\n\\n I think it\\u2019s time to start the dialogue.\"", "title": "With all of the talk about DEI, I want to address the real elephant in the room. Indian managers who hire other Indians almost exclusively", "upvote_ratio": 0.92, "url": "https://www.reddit.com/r/cscareerquestions/comments/19ajyuq/with_all_of_the_talk_about_dei_i_want_to_address/"}, {"author": "lotsofhugszerofucks", "created_utc": 1660243355.0, "link_flair_template_id": "1ae775c6-1232-11e5-bc2c-0e9aedb4175b", "link_flair_text": "Meta", "num_comments": 378, "post_id": "wlyuji", "score": 3874, "subreddit": "cscareerquestions", "text": "\"Seriously, it gets pretty annoying to see one in every five post is about one of these:\\n\\n1) Asking how to get 150k salary with 1-2 YOE\\n2) Humble bragging (has high salary, seeks some advice for trivial problems out of boredom)\\n3) Asking if they're earning enough. (Just ask yourself if you're living comfortably and that's it. Everyone has different standards)\\n\\nI believe there're much more to talk about in this beautiful career than salaries.\"", "title": "Let's stop 100k+ salary posts", "upvote_ratio": 0.85, "url": "https://www.reddit.com/r/cscareerquestions/comments/wlyuji/lets_stop_100k_salary_posts/"}, {"author": "No_Advantage_1636", "created_utc": 1628096381.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 932, "post_id": "oxx25o", "score": 3832, "subreddit": "cscareerquestions", "text": "\"I just got like my 15h rejection in a row, this time with feedback on a hackerrank that said \\\"Our engineering leadership thought that your HackerRank solution was a bit convoluted and not what we are looking for currently.\\\" Except that I know I'm a good engineer and my solution was not at all convoluted. All my former coworkers were happy with my work. My bosses were happy and gave me good performance reviews. Maybe they're annoyed I used functions instead of having everything in a for loop or that I used camel case. I don't fucking know. I just know that I'm tired of answering questions correctly and getting rejected. \\n\\n&#x200B;\\n\\nI've been out of the job force for nearly a year now. I'm going to be homeless in a few months. And literally every place rejects me after I correctly answer a tech question. Yes I know I shouldn't have quit my job without another one. I didn't think I'd literally be blacklisted from the fucking industry because of it. I'm fucking over it. I just want a fucking job. I'll take a minimum wage job at this point. From $250k TC to being homeless in a few months.\"", "title": "Does the job search make anyone else want to cry?", "upvote_ratio": 0.92, "url": "https://www.reddit.com/r/cscareerquestions/comments/oxx25o/does_the_job_search_make_anyone_else_want_to_cry/"}, {"author": "Technical_Fly4266", "created_utc": 1670474417.0, "link_flair_template_id": "0968d7a4-1232-11e5-a323-0e1422b8b60b", "link_flair_text": "Experienced", "num_comments": 1160, "post_id": "zfp5wl", "score": 3831, "subreddit": "cscareerquestions", "text": "\"I've been a software developer for the past 10 years. Yesterday, some colleagues and I were discussing how awful the software developer interviews have become.\\n\\nWe have been asked ridiculous trivia questions, given timed online tests, insane take-home projects, and unrelated coding tasks. There is a long-lasting trend from companies wanting to replicate the hiring process of FAANG. What these companies seem to forget is that FAANG offers huge compensation and benefits, usually not comparable to what they provide.\\n\\nMany years ago, an ex-googler published the \\\"Cracking The Coding Interview\\\" and I think this book has become, whether intentionally or not, a negative influence in today's hiring practices for many software development positions.\\n\\nWhat bugs me is that the tech industry has lost respect for developers, especially senior developers. There seems to be an unspoken assumption that everything a senior dev has accomplished in his career is a lie and he must prove himself each time with a Hackerrank test. Other professions won't allow this kind of bullshit. You don't ask accountants to give sample audits before hiring them, do you?\\n\\nThis needs to stop.\\n\\nShould we start refusing coding challenges?\"", "title": "Should we start refusing coding challenges?", "upvote_ratio": 0.93, "url": "https://www.reddit.com/r/cscareerquestions/comments/zfp5wl/should_we_start_refusing_coding_challenges/"}, {"author": "leagueofgreen", "created_utc": 1544040516.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 589, "post_id": "a3g13s", "score": 3817, "subreddit": "cscareerquestions", "text": "\"[US]This is my dream job, Ive wanted to make Games and Apps  since i was played 64, and Apps as soon as the AppStore became a thing. I called my family, gave my two weeks, bought a plane ticket, etc. Then the employer said they changed their minds.\\n\\nEdit: hey everyone just wanted to say thank you. Im surprised at all the support I've gotten. Great community here, if im being frank, I just needed a place to complain. It was a wildly frustrating day and I work in a service industry job so i had to be polite and friendly all day when i truthfully just wanted to pout. This post, and all of you, helped me get it out of my system. Thank you all \\n\\nEdit 2: what is this, r/wholesomememes? Thank you all so much for your kindness. It's really, truly helping.\\n\\nEdit 3: not going to sue. Just going to keep on improving. Thank you all!\\n\\nEdit 4: airline took care of the airplane ticket. We're okay!\\n\\nEdit 5: gold?? This was totally worth it.\"", "title": "Landed my dream job, Android developer, the employer and I just signed the job offer! Bought the plane ticket, gave my two weeks! then they rescinded my job offer.", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/cscareerquestions/comments/a3g13s/landed_my_dream_job_android_developer_the/"}, {"author": "Real_Obligation_4449", "created_utc": 1624290496.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 222, "post_id": "o4y6xa", "score": 3772, "subreddit": "cscareerquestions", "text": "\"\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\n\\n[\\\\[UPDATE: my post on Blind has now also been removed, likely due to being flagged by LoanStreet\\\\]](https://www.reddit.com/r/cscareerquestions/comments/o52lmw/name_shame_loanstreet_ny_removed_my_blind_post/)\\n\\n\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\n\\nUpdate to [this original post](https://www.reddit.com/r/cscareerquestions/comments/o3jpfc/name_and_shame_loanstreet_ny_cheated_me_out_of/)\\n\\n**LoanStreet seems to be at work trying to sweep their misconduct under the rug so they can continue to mistreat employees with impunity.**\\n\\nThis morning **Glassdoor** emailed me to let me know they had **removed my post**:\\n\\n*We determined your review does not meet these guidelines because you have mentioned or discussed yourself or another individual by name, title or association. As part of our guidelines,* ***we do not allow users*** *within their reviews* ***to single out*** *themselves or* ***non-C-level executives*** *in a negative light. We only permit discussion of specific individuals when they are C-level executives and therefore represent the public face of the company and have great influence over the broad work environment.*\\n\\n**The thing is, all the people named in my Glassdoor review are C-level executives:**\\n\\n* Cofounder/CEO Ian Lampl\\n* Cofounder/former COO Christopher Wu\\n* CTO Larry Adams (he's listed as VP Engineering on LoanStreet's website, but there is no engineering/tech manager above him)\\n\\nI had already been through multiple rounds of review with Glassdoor prior to the review being posted. In the end, **a senior member of the Glassdoor content review team confirmed that my review met guidelines and was approved. Screenshot** [here](https://imgur.com/a/cBQQLkh)**.**\\n\\nIt's disappointing to see Glassdoor allow a company to hide an approved post that dozens of people marked as helpful (thank you, r/cscareerquestions!). I will try to get the post back up.\\n\\n**Glassdoor may have lost its spine, but please upvote** [**my Blind post**](https://www.teamblind.com/post/Name-Shame-LoanStreet-NY-cheated-me-out-of-equity-rRKGJAj3) **to get the word out.**\\n\\nFinally, **thank you to the mods of** r/cscareerquestions and to Reddit **for showing some integrity and allowing us to** do what members of communities should do: **warn each other of predators** so that only one person needs to be hurt before the entire group learns how to be safe.\\n\\n&#x200B;\"", "title": "Name and Shame: LoanStreet (NY) cheated me out of equity [UPDATE: Glassdoor removes review, in violation of their own policy]", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/cscareerquestions/comments/o4y6xa/name_and_shame_loanstreet_ny_cheated_me_out_of/"}, {"author": "Space-Ape2000", "created_utc": 1626882995.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 679, "post_id": "oosru6", "score": 3698, "subreddit": "cscareerquestions", "text": "\"Not my main account because I know some of my coworkers/friends browse this sub and would recognize me.  I just want to rant and encourage people to keep looking for remote jobs and make the transition if they can/prefer it.\\n\\nSo last week, after a year or so working from home, I had to go back (for the first time in my career) into the office. According to my company, we should work from the office because it will increase collaboration and people will perform better.  Bunch of bs, but I had no other choice at the moment.\\n\\nSo first things first, instead of waking up at 8:20 and join a useless meeting at 8:30, be on mute and proceed to go make my breakfast and take my dog for a walk,  I now have to wake up at 7, get properly dressed (no more comfortable clothes), make sure I have lunch and breakfast prepped, get on the highway, drive, get there at 8:15, mindless chit chat till 8:30, join the same useless meeting on zoom (with coworkers from around the globe, what's the f. point? ) and now I HAVE to/MUST pretend to pay attention to something that has no relation to what I work with because well, I got no more flexibility on my surrounding environment.\\n\\nAt home, I invested in a nice work setup. I have a nice chair, a stand-up desk, wireless keyboard/mouse/headphones, 2 monitors that I can adjust, plus a private kitchen to make my snacks, and teas.\\n\\nThe first time I went to the office and I saw the work environment I felt ridiculous. It's a fucking cubicle, with a shitty keyboard, mouse, and headset. The best part is that the cubicle doesn't have tall walls so I can literally see/hear everything, including other people's monitors.  The monitors, of course, are facing the hallway, so you can't see who's walking behind you, but whoever walks past you can freely see what you are doing.  Manager's dream.\\n\\nI also have to wait in line now if I want to make some tea or something, delightful.\\n\\nAt home, I am able to have a quiet environment and be super productive. When I get a card, depending on what it is, I can finish it in 2-4 hours, and then I can focus on doing something else for the rest of the day (learning/training, other meetings, or just not work at all since I was able to be productive).\\n\\nAt the office, because of being constantly watched, I became lazy just to have something to hold on to/last for the rest of the day. I also noticed that my team members do the same.  Also for me, IT IS EXTREMELY HARD to actually focus with a lot of background noise and as I mentioned above, because of the cubicles, every time someone gets up (every 10 mins), or gets a phone call, my attention is drawn to that and I lose what focus I had.\\n\\nThe company kept saying we will be more productive at the office. That's the opposite of what I am seeing. My team is now taking longer for cards, and the amount of time wasted in the office is ridiculous. The number of people, mindless walking around, chit-chatting in cubicles, going out for lunch/ coffee breaks just to fill in the time is a joke(nothing wrong with that IMO, but I'd rather do that at home).\\n\\nI loved having a private bathroom at my house. I can go and do whatever I want to do in peace. At the office, welcome to the shitty stalls and pooping side by side because, yes, I do love the smell of people farting in the morning.\\n\\nThe people that wanted to go back into the office, after a week of going to work and lunches and whatnot, started to mention some stuff during the stand-ups and I quote:\\n\\n\\\"Are you guys feeling more tired than usual?  I forgot I didn't enjoy the commute\\\"\\n\\n\\\"Man I forgot it sucked to have to prep a meal every day and wait in line in the cafeteria to reheat it\\\"\\n\\n\\\"I actually didn't realize I was saving money eating at home, I spent over 100 dollars last week on coffee and lunch\\\".\\n\\nAt home, after work, I could go for a jog right away or just go watch some Netflix and chill out.\\n\\nAt the office after a long, tiring day? Nope, get in the car, you are going to waste 40 minutes in stressful traffic to get home.\\n\\n&#x200B;\\n\\nI am FUCKING glad, I am putting in my 2 weeks this Wednesday and going fully remote. I started looking 4 months ago when the company announced their plans because I was feeling that this office thing would be horrible. I tried it out and it just doesn't work for me.\\n\\nIf you are looking for a remote role, keep applying/interviewing, you will get something too.\\n\\nIf you like/prefer going to the office that is fine. I am not trying to say we should all be remote. Companies should offer FLEXIBILITY to let employees choose where to work from.\\n\\nWe have different personalities and different preferences. Just because some people enjoy going into the office (or because management needs control) doesn't mean everyone has to.\\n\\n&#x200B;\\n\\nI am gladly never going to or near an office ever again.\\n\\n&#x200B;\\n\\nTL;DR: Went to the office for the first time in my life. I hated it and makes no sense to me.  Companies should let employees decide where to work from. If they can't offer that and make their employee's lives easier/better, they should/will lose all their talent to companies that do.\\n\\n&#x200B;\\n\\nEDIT 1: There seems to be a lot of people saying that I am entitled. For a bit of background, I started working a couple of years ago as a dishwasher and made my way to where I am right now. I never had an easy path nor a college degree (I am self-taught with a small coding Bootcamp).\\n\\nJust because I prefer having a better quality of life/work, doesn't mean I am entitled. Instead of bickering with each other about who works harder or whatever, we should focus on having a better quality of life and trying to make it the norm. If you are working 6 days a week and you feel proud, good for you but I don't want that for me.\"", "title": "I went to the office for the first time. I fucking hated it.", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/cscareerquestions/comments/oosru6/i_went_to_the_office_for_the_first_time_i_fucking/"}, {"author": "ElectricPaper", "created_utc": 1609780487.0, "link_flair_template_id": "10926bda-1232-11e5-a7a9-0e9aedb4175b", "link_flair_text": "Lead/Manager", "num_comments": 263, "post_id": "kqd16b", "score": 3678, "subreddit": "cscareerquestions", "text": "\"I\\u2019ve been a developer for 17 years and I want to talk about someone I\\u2019ve met literally hundred of times and I guarantee you will work with one day: Bob.\\n\\nBob has been a professional developer for 10 years. Whenever he touches someone else\\u2019s code he complains endlessly about how stupid they were or how bad the code is. At the same time, he\\u2019s never really considered the readability of his code by another person. It\\u2019s not tricky because he understands it.\\n\\nHe\\u2019s worked at small companies where peer reviews weren\\u2019t a thing when he was learning unfortunately and he\\u2019s now developed an ego that make him immune to all criticism. Anyone who critiqued his code would be wrong 100% of the time because he\\u2019s a senior lead grandmaster engineer. He\\u2019s the only one who knows how [system he built] works so he\\u2019s invaluable to the company. They train people to tiptoe around his \\u201cdifficult personality\\u201d or whatever euphemism the project team has assigned to him being an asshole.\\n\\nBob\\u2019s code is never as good as he thinks it is. It\\u2019s full of idiomatic quirks he developed over time like a programming accent that nobody else checked him on. It suffers because:\\n\\n-\\tIt will never be better than his limited knowledge. He\\u2019s a cup full of water and there\\u2019s no room for more water. Anything he doesn\\u2019t want to learn is a \\u201cfad of the week.\\u201d\\n-\\tAnyone reading his code becomes a forensic investigator who needs to decipher his little quirks instead of focusing on the problem being solved.\\n\\nDon\\u2019t be like Bob. He\\u2019s toxic. He\\u2019s miserable to work with and creates a culture of mediocrity. His name (whatever it is at your office) is a slur for a difficult person.\\n\\nTo every junior engineer out there please burn into your mind:\\n\\n-\\tAny code written more than 10 seconds ago is immediately garbage that was written by someone who was dumber than they are now. Good developers all have a shared understanding not to speak these thoughts aloud.\\n-\\tAll code is written for two audiences: the machine reading it and the poor slob who has to update/fix it in 4 years (maybe you). Tricky code is a middle finger to that second audience meant to show how smart you think you are.\\n-\\tEvery criticism you get is a gift, seek them out. You are not your code. Beg for criticism. Even when they\\u2019re not right, trying to understand why they think they are is a valuable thought exercise. Start with the premise your wrong. Even if it\\u2019s not phrased constructively take the part you need (the feedback) and ignore how it\\u2019s delivered. \\n-\\tThe more you think you know the more your ego will try to sabotage your growth by convincing you you\\u2019re always right and shutting out new knowledge.\\n-\\tRefusing to admit you\\u2019re wrong about something is a show of insecurity. Admitting you\\u2019re wrong about something (especially to a junior developer) is a flex that shows your knowledge/skills/authority isn\\u2019t challenged by new information.\\n-\\tUnless you\\u2019re entry level, helping less experienced/knowledgeable folks constructively is an implied part of your job.\\n\\nThanks for coming to my TED talk.\"", "title": "A plea to future and junior developers", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/cscareerquestions/comments/kqd16b/a_plea_to_future_and_junior_developers/"}, {"author": "Real_Obligation_4449", "created_utc": 1624119634.0, "link_flair_template_id": "0968d7a4-1232-11e5-a323-0e1422b8b60b", "link_flair_text": "Experienced", "num_comments": 221, "post_id": "o3jpfc", "score": 3677, "subreddit": "cscareerquestions", "text": "\"********\\n[UPDATE: LoanStreet is suing me for over $3 million in federal court because I shared the story below](https://www.reddit.com/r/cscareerquestions/comments/q42lgm/name_shame_loanstreet_ny_is_suing_me_for_over_3m/)\\n********\\n[UPDATE: Name & Shame: LoanStreet (NY) wants federal judge to force Reddit to de-anonymize every post and comment I've written in my entire life](https://www.reddit.com/r/cscareerquestions/comments/qh2xho/name_shame_loanstreet_ny_wants_federal_judge_to/)\\n********\\n\\nI worked for [**LoanStreet in NYC**](https://www.loan-street.com/). Small company. <30 people. [**Cofounder/COO Christopher Wu**](https://www.linkedin.com/in/chriswu000) **told me my equity would start vesting after 12 months.** **After I started, they told me that they actually meant 12 months after the next quarterly board meeting, and I would only start to vest after 16 months.** I asked them to change it. They dragged their feet for months, pretending to work on it. **After 15 months of praising my work, they abruptly fired me just as COVID froze tech hiring, refused to vest any of the promised equity, and the head of HR (who is also the wife of the CEO and who had spoken to me warmly just the night before) refused to answer my phone calls asking for an explanation.** LoanStreet is run by fancy lawyers and they were crafty with the offer letter language so I had no legal case. The offer letter said the details of the equity compensation would come in a different document, which they didn't provide for almost a year after I joined. **If it was a good-faith error, they could have done the right thing and granted me what I earned. They chose not to.**\\n\\n**The only problem I was aware of was that the** [**CTO Larry Adams**](https://www.linkedin.com/in/larry-adams-2a20b07) **was upset with me because I discovered one of his favorite engineers had broken mission-critical code, and I fixed it.** Basically this guy was making changes to financial code he didn't understand, and had erroneously +1'd in one place so he ended up -1'ing in a bunch of other places to offset the initial error and get the tests to pass even though some key, untested functionality was now broken. The engineer didn't remember why he had made the change and refused to help me investigate why tests were failing. I privately spoke to him to ask him to be careful with the code in that area because it was tricky, to leave comments if he writes something that might be confusing to another reader, and to feel free to ask me for help in that area since it was my niche in the company. I was trying to do him a favor by not making a more public stink about it. He immediately complained to the CTO, who called me 30 min later to sternly tell me that there was no error because we had tests that would have caught it and to scold me for going out of my lane. I wrote a failing test proving that the error existed and that our tests were incomplete. Then I fixed the error. He brusquely told me to fix anything I had broken by making that change. At the next retro \\\"needs improvement\\\" section I said I hoped we could affirm a team norm of being responsible for your code: being able to explain it and to help fix things if it breaks something. Larry Adams got mad and shut down the conversation. **For the next few weeks he worked behind my back to get me fired.**\\n\\n[**Cofounder/CEO Ian Lampl**](https://www.linkedin.com/in/ian-lampl-b7a5b684/), his wife and [**head of HR Alyssa Guttman**](https://www.linkedin.com/in/alyssa-guttman-37133a4)**,** [**COO Christopher Wu**](https://www.linkedin.com/in/chriswu222)**,** [**CTO Larry Adams**](https://www.linkedin.com/in/larry-a-2a20111), and [**General Counsel Thaddeus Pittney**](https://www.linkedin.com/in/tlpitney) are the people chiefly responsible for what happened.\\n\\nCopying my [**Glassdoor review**](https://www.glassdoor.com/Reviews/Employee-Review-LoanStreet-NY-RVW48294594.htm) below. Please follow the link and mark it as helpful so that the message is amplified and as many people are warned as possible. LoanStreet fires people without warning and makes severance dependent on signing a permanent non-disparagement agreement, so we need to elevate the negative reviews they do have.** They have no legal fees because many of the top people are lawyers, and so they intimidate people into keeping their stories to themselves, even with \\\"anonymous\\\" outlets like Glassdoor available.\\n\\n**Pros**\\n\\n*They are willing to give boot camp grads a chance*\\n\\n**Cons**\\n\\n*TLDR: Stay far, far away unless you're truly desperate. LoanStreet is a raging dumpster fire and you will get burned like many before. After 15 months of praising my work - and as COVID froze the hiring markets in 2020 - they abruptly fired me and withheld $100k in options that they promised me before I was hired.*\\n\\n*The annualized turnover rate in the small NYC office during my time there was around 50%. Every two months or so, someone was fired who said they weren\\u2019t given any warning and the company would tell the same story that this person was given many warnings and opportunities to respond to feedback. I saw a lot of good workers blindsided, some leaving in tears. I thought it was fishy and eventually it happened to me, despite always having received glowing praise from leadership.*\\n\\n*Any promises made to you to entice you to sign an offer should be regarded with extreme skepticism. Get everything in writing and reviewed by a good lawyer.*\\n\\n*After hiring employees with a promise of unlimited PTO, management rolled out a PTO tracking tool that explicitly capped PTO at 15 days per year.*\\n\\n*Before I joined, Cofounder/COO Christopher Wu told me that the first quarter of my stock options would vest after a year. My offer letter said details on the equity compensation would be provided in a separate equity agreement. I wasn't provided that agreement for nearly a year after my start date, and you can imagine my surprise when I saw that I wouldn't begin to vest until nearly 16 months of employment. After 15 months of work, I was abruptly fired and didn't receive a single option.*\\n\\n*Because the offer letter omitted the details of the equity compensation, labor lawyers told me I had no case. Keep in mind, LoanStreet is run by lawyers who used to worth at Cravath, a very prestigious and lucrative NYC law firm. I suspect they knew exactly what they were doing when they wrote the offer letter. If it was just a good-faith mistake, they could have done the right thing and granted me the options I earned. They chose not to.*\\n\\n*Placing my trust in LoanStreet was a costly mistake. If you're reading this, please don\\u2019t be fooled by the Series B funding or the impressive pedigrees of the leaders; this place is a fraudulent, exploitative mess and you have a good chance of being fired within a year.*\\n\\n*CEO Ian Lampl is the ringleader of this racket, but Cofounder/COO Christopher Wu, CTO Larry Adams and the rest of leadership are his spineless sycophants. They either agree with Lampl's despicable abuses of his employees or are too cowardly to stand up for what's right.*\\n\\n*This group will twist employees\\u2019 arms to post positive reviews after they see this one, just like they have in the past, but this review is the real story and just the tip of the iceberg, given LoanStreet's practice of paying fired employees to sign permanent non-disparagement agreements.*\\n\\n*You deserve to be treated with dignity. Work elsewhere.*\\n\\n**Advice to Management**\\n\\n*Your exploitation of people is disgusting. Look in the mirror and ask yourselves how your loved ones would feel if they knew that you cheat people just to make your big piles of cash a little bigger*\"", "title": "Name and Shame: LoanStreet (NY) cheated me out of equity", "upvote_ratio": 0.99, "url": "https://www.reddit.com/r/cscareerquestions/comments/o3jpfc/name_and_shame_loanstreet_ny_cheated_me_out_of/"}, {"author": "six_hunt_throwaway", "created_utc": 1642273549.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 237, "post_id": "s4rkbe", "score": 3580, "subreddit": "cscareerquestions", "text": "\"2016 - Graduated with below 2.5 GPA. No job, just my johnson in my hand.\\n\\n2017 - Live at home NEET, crazy depression, anxiety, and suicidal thoughts. Burned an entire year watching anime, netflix, and movies. Also sleeping 12 to 16 hours a day. Waking up and smoking enough weed to put an elephant asleep because every waking moment was extremely painful.\\n\\n2018 - start of therapy and medication.  Had to learn how to function as a human again. While also trying to cram leetcode and general cs theory\\n\\n2019 - Condition improve, but continued to try to learn too many things at once. Didn't help that I was living in abusive home enviorment. Managed to land a internship that paid $10 and hour for 3 month.\\n\\n2020 -  Switched to an ad agency for $25/hr. Covid happen and was laid off during the height of pandemic. Couldn't code at home because of abusive enviorment. Rented a co-working space when everyone was staying home. Was practically living there because I could not afford to move out. Stayed for 3 months, because I could not afford $250 a month open desk. Spent another 3 month working my mall's outdoor food court 12 hours a day. \\n\\n2021 - Got a better deal from co working space for $100 a month. Was practically living at the co working space again. A small win, but there was increase of random violence at home. Took remaining amount of money, and left the country. Was able to focus on building a product. Applied, and interviewed for a job November. Received and signed offer in December.\\n\\n2022 - I start working.\\n\\nWhat I learned\\n\\n1. Don't try to learning everything at once. Focus on one thing at a time.\\n2. Be brave and leave a toxic home enviorment. You won't be able to actually digest material if you are in constant state of fight or flight.\\n3. Watch out for coding anxiety. Don't code for the sake of coding. Think about what you want to achieve. Use bloom taxonomy to learn deeply.\\n4. Take your time, and pace yourself accordingly.\\n5. Believe in the process and believe in yourself.  \\n\\n\\nTook god damn 6 years because I was constantly in state of anxiety and flight mode. Took me 6 months to readjust to a healthy baseline. FML but I made it and so can you. Don't give up. To the bitter end.\\n\\nEdit1. I was a non-cs major that majored in accounting. My 3rd year i have a 3.0 to 3.2 gpa. Always loved tech but coming from an extremely poor family i was never introduced or had guidance to coding until college. I do recall learning how to make a website with dreamweaver as a freshie. But I loved tech since i was a kid.\\n\\nI believe coding is just the modern day carpenter and anyone can do it.\\n\\nEdit2. I did not get FANNG nor was asked an algro question. Though doing tons of leetcode allowed me practice visually mapping algros and cleaned up my coding logic.\"", "title": "After 6 years of struggle. I made it bros/gals. Signed 100k package.", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/cscareerquestions/comments/s4rkbe/after_6_years_of_struggle_i_made_it_brosgals/"}, {"author": "Martydude15", "created_utc": 1587841367.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 343, "post_id": "g7z78b", "score": 3548, "subreddit": "cscareerquestions", "text": "\"I'm so excited guys. After over 200 applications , 20+ interviews, and a lot of almost giving up, I GOT A OFFER WITH MY DREAM AEROSPACE COMPANY. Crazy thing is... I didn't even have to do a dumb \\\"code this\\\" technical interview. I get 60K starting off! with a bonus!! That's amazing starting off in the South. Crazy thing is someone who works there , while I was doing a internship, told me they wouldn't hire a black man straight out of college. I'm glad I kept trying. Shoutout to r/cscareerquestions for all the help in this process.\\n\\nEdit: Thank you all for the kind support! It means a lot to me. Just to clear up a few things. I graduate with a Bachelors in CS in a few weeks so I'm not self taught. To address the lack of diversity in STEM, do your research. The data is out there, the accounts of what people go through are out there. Educate yourselves and fix the problem. Most of our jobs is googling so you can do it haha.\\n\\nEdit 2 : Since people are asking, I'll go into a little bit of my background. I am graduating with a Bachelors in Computer Science W/ a minor in Mathematics in a few weeks. I have had a internship every summer of my undergrad which includes two summers at a really famous science institute and 1 at a REALLY famous space company. During my time at both companies and in undergrad, I built up a crazy professional network of people I could rely on for information and some for a recommendation. A awesome woman at said space company, recommended me to her friend on another team and I got the interview then the job. So what else did I do in terms of the crazy amount of interviews and applications? I did some Hackerrank, Leetcode, and messaging recruiters on LinkedIn which helped me get interviews. Polishing my LinkedIn helped me get way more traffic and I got a Google interview doing so. I also used organizations like NSBE & ACM to help me get interviews at conferences or find resources. My resume also went through numerous changes over the span of my applying to jobs (August - Now). In terms of job sites, I used everything. LinkedIn, USAJobs, Handshake, Hired.com, Indeed, Seen, etc.\"", "title": "I FREAKING DID IT!!", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/cscareerquestions/comments/g7z78b/i_freaking_did_it/"}, {"author": "ohhellnooooooooo", "created_utc": 1651828987.0, "link_flair_template_id": "0968d7a4-1232-11e5-a323-0e1422b8b60b", "link_flair_text": "Experienced", "num_comments": 255, "post_id": "ujjhpi", "score": 3510, "subreddit": "cscareerquestions", "text": "\"Here's some general advice that if everyone followed, salaries across the country would go up (We've seen this happen already with the service industry! #GreatResignation /r/WorkReform ). And of course, so could yours if you follow it.\\n\\n&#x200B;\\n\\n* Don't try to \\\"get a job\\\"\\n   * You are offering a service, selling your labor. imagine you're a basket weaver. Selling baskets is your only source of income. You just opened shop, if I show up and offer $10, would you take it right away? or would you research how much baskets are being sold in your area first? they could be going for $1000 instead of $10. And of course, you would set the price right? not the first customer to walk in.\\n   * So research. like you would if you are a business owner. at the minimum, once a year, because salaries change fast!\\n      * Know not just how much people get paid in FAANG, tier 1, startups, average F500, banks, etc\\n      * but know as well their WLB, weekly hours, etc\\n      * Do NOT be the guy that thinks that everyone in good paying companies works >40h and thus, doesn't try to go into these companies, or accepts >40h and bad WLB because they are paid well - you can have both\\n      * Do not be the guy that assumes but doesn't verify, that to reach X salary you must pass leetcode hard and get into FAANG or Quant, when many lesser prestigious companies have started paying higher and higher - be the guy that verifies\\n   * Your labor is worth what you decide, not what the first company decides\\n* Keep your secrets, reveal your strengths\\n   * You are letting companies blindly bid on your employment - which is even more advantageous than selling on a shop like the example above\\n   * it's a blind auction. And you are in control of the information, they don't know if you already have offers for 200k, if you are earning 180k right now, etc\\n   * Keep them in the dark of what doesn't help you and inform them of information that helps you\\n      * You got a Google offer? tell everyone\\n      * Google low balled you to SDE3 instead of 4? Just mention Google offer, not the pay / level\\n      * No name company offered big bucks? Just leave the name out, show the number\\n      * You are making more than their offer? reveal\\n      * You are making less? keep it\\n      * reveal the best, hide the worst\\n   * if you say you earn X, now the negotiation is more restricted to X + 10% - 30% even though they had budget for more. not completely impossible to negotiate more, but harder\\n   * and never say \\\"can you do 100k?\\\" you just cut yourself out of the rest of the budget, now you look rude if you then say there's another offer you are considering, etc\\n* Write down all offers. keep track\\n   * write down what was said verbally, the written offer might change\\n      * the offer is more than the written contract. Hints about good WLB, red flags about long hours, there's a ping pong table at the office and you are a fanatic for ping pong...\\n      * on the other hand, what's not in written contract is not guaranteed, and a lot of things don't get written down like a ping pong table\\n   * you might forget things as this could be a long process\\n* \\\"Never say the first number\\\" is good but not enough. And not always possible. Better is: \\\"Never say the *last number*\\\"\\n   * if you can be the first to ask about pay before they ask you, then great, ask them for a range. Keep in mind, the range they give you is not truly the highest they are willing to pay\\n   * if they insist hard on asking a number from you first, before interviewing to avoid wasting time, don't say \\\"the minimum I would take..\\\" or \\\"I would sign for...\\\"\\n   * Do not, ever, put a hard ceiling or limit on what you would accept!\\n   * when you say any number, always keep higher pay as a possibility\\n   * Answer if you have to: \\\"I'm looking for at least average/above average market pay for my experience, which would be at least X\\\"\\n   * then you are not an asshole if you come back with an offer of X + 40k, and they cannot tell you that you said you would accept X - you never said that\\n* Stack offers. Don't stop interviewing because 1 company made an offer - you are just getting started\\n   * keep your job as long as you can - it's leverage\\n   * keep interviewing as long as you can - you gain leverage with each offer\\n   * first thing you do when you get an offer - ask for time to decide, more on this later\\n   * When you get an offer that expires after 10 days, only sign it on the 9th day. Let them sweat, let them consider offering you more - so really do, unprompted even\\n   * leave all offers open\\n      * you might think it's good to tell 'no' to the company that offered you 100k after you get a 150k offer - don't\\n      * never say 'no', or that you are moving on, or going for other opportunities\\n      * leave every door open until the day you sign your best offer\\n      * you might be surprised that the cheap-ass offer suddenly becomes your best offer\\n   * Inform all other companies, hell, even the ones that rejected you before if you have a recruiter email, about the best offers you received\\n      * \\\"Hello X,  I just wanted to updated you on my thoughts regarding the decision to join *COMPANY*. I just received a strong/competitive/enticing offer from *CORP*. I am still very excited to join your team as I had a great experience during the interviews, as such can we ...\\n      * for companies you are still interviewing \\\"..can we expedite the interview process as my timeline is now tight?\\\"\\n      * for companies that made you an offer \\\".. can we revisit the offer and make this work? The offer I received is... X salary, Y RSU..\\\"\\n* How to get more offers\\n   * You might be feeling hopeless. you applied to 200 jobs, passed only 3 resume screens, passed only 1 on-site, and have only 1 offer\\n   * you will be tempted to accept\\n   * you will doubt yourself and think you got lucky to get 1 offer\\n   * As I said, you are only getting started.\\n      * Linkedin, find recruiters, say you are very excited about their company, want to interview, etc..\\n      * say you already have an offer from X\\n      * Watch them scramble to get you (the better X company is)\\n   * Then do it again when/if you get an offer from Y where Y in (F, A, N, G, tier1List, unicornList)\\n      * You might be surprised how many resume screens you will skip straight to interviews, because if you passed Y's interviews, you can probably pass their own interviews. your weak CV doesn't matter as much now\\n   * going back to applying seems crazy: but you are not starting from zero - you have proof of your competitiveness now, x10000 more proof than a resume can give\\n* referrals, referrals, referrals\\n   * Your friend saying \\\"hey, my friend is looking for a job\\\" = not great, another guy trying to get his friend a job\\n      * but definitely helpful, and do that to try to get your first offers!\\n   * \\\"hey, my friend got an offer from X, he's really good, would you like to interview him before he accepts?\\\" = wow I just got a chance at fishing a competitive candidate because of this guy is in my network! I'm on a time limit to get this guy!\\n   * So absolutely leverage your network\\n      * ask them to refer you to their companies to get your first offer\\n      * re-contact everyone AGAIN when you have an offer\\n      * heck, re-contact everyone ***again*** and ask for referral ***again*** if you get your first FAANG offer, suddenly the referrals that did nothing, that went ignored, will be calling back because you are the guy they heard about twice and is now about to get fished by Google\\n* Exploding offers (when they ask you to sign in less than 2-3 days)\\n   * these might be one of the hardest things to deal with if circumstances are wrong\\n      * No job, no other offers? You're fucked. Either accept, or if you have balls of steel and confidence that you will get other offers? then keep applying\\n   * exploding offers are negotiable too. everything is. deadlines are.\\n      * show them the offers that are bigger (and don't necessarily tell deadlines unless they keep insisting about the expiration)\\n      * \\\"My offers for X and Y will expire significantly later, and I want to take time to make this important decision of which company I will work with for the next years. I will get back to you at that timeline\\\"\\n      * insist that you, while very excited to work for them, want to finish X recruiting process, and or go into your cave/lake side house/spend the weekend with family/reflecting on all the opportunities you have before making a decision\\n   * Calling this bluff is hard - but worth it for many circumstances. usually companies that do this don't have great offers - that's exactly why they do it\\n   * if you need a job, there's zero shame in taking this kind of offer, in letting their bluff win. next year, you will have more leverage (a job, +1 YoE)\\n* Say that you cannot reach a final decision without first sleeping over it, or talking to your family, or spending a weekend reflecting, anything.\\n   * prepare this line\\n   * when you are on the phone, and you are being told your offer, don't say \\\"amazing, what's the start date\\\" - then the negotiation is over, or if you re-open the negotiation, it will be bitter and hard and won't be a very successful one\\n      * don't also say \\\"can you do +30k\\\". they'll do that or 20-25k and it's over. never finish a negotiation early, never close doors voluntarily - they say you can decide in a week, then ask for 2 weeks, and decide on the last day\\n   * with email it's easier - with phone it's more rewarding if you are a fucking boss with better social skills than a recruiter\\n   * Instead reply:\\n      * \\\"thank you for your offer, I am very excited about *COMPANY*, I loved meeting the *TEAM* / *STAFF,* and I know I will be a good fit and I'm happy you agreed as well. I'm not ready to discuss the offer at this point, but I am confident we can find a package both sides would be happy with. I will still sleep on/reflect over the weekend/talk to my family about this before making a decision\\\"\\n   * when you are not the sole decision maker, you will be pressured less. because the other side can't talk to your family to convince them - this is huge if you are not the most confident person, and can be persuaded to say 'yes' by a strong willed recruiter\\n* be excited, positive, kind, never rude\\n   * you want them to want you, and no one wants someone that isn't happy to work for you\\n   * even when you get a low ball offer, don't reply in a negative manner\\n      * \\\"thank you for your offer, I am excited about \\\\[... same as above...\\\\] I believe am good fit and I'm happy you agreed as well. The offer is not meeting my expectations, but I'm sure we can work on this and find a package both sides would be happy with. At the moment, I've been offered... \\\" and show them your Ace of Spaces offer\\n      * if you are lacking a trump card offer, then instead say \\\"..for my level of experience and considering the market value, we should work towards X value\\\" and then keep applying\\n   * never say you are negotiating, or 'lets negotiate' or 'I want to negotiate'\\n      * instead say \\\"let's work towards finding a package we are both happy with\\\"\\n      * \\\"i'm excited about joining the company, but for the sake of my family I have to re-consider because the salary is\\n* Companies have no idea if you are good.\\n   * that's why they almost never offer the full amount they would be willing to pay, the real amount, the amount only available after a recruiter goes to his superior to increase the budget\\n   * even after 6 or 7 interviews. on-site. leetcode hards. Companies are stillreluctant to hire you, even those that made you an offer.\\n   * but if you have other offers, this signals more strongly than the interviews that you are competitive\\n   * just like a married man with a wedding ring is much more vetted to not be a total creep, to be at least a somewhat decent partner, and thus more attractive or easier to be around, if you have a job vs not having one, if you have multiple offers vs not, you are vetted, you have proof, that you are a hot piece of juicy steak\\n* You are also blind to their budget\\n   * You might think that because you were offered 100k at first, this company would never pay you 200k\\n      * Yet on blind, blogs, and here in /r/cscareerquestions many people have gone from 120k to 200k, or on rarer occasions even more, at the same company, same position, same interview performance, just from having higher offers\\n   * Don't believe when you are told the max is X, the range is X to Y, just keep the door open: meaning, the way you reply to them is neither accepting the offer, or giving up on the company\\n      * to each company/offer, you are either reflecting/talking to your family, or if their offer is less than another offer, you have emailed them about it and are waiting for them to get back to you with a counter-offer (again, keep track of what each company is doing, who is the blocker, you or them, don't leave anyone without reply for more than a day!)\\n* Finally, you have tried your best, you are tired of applying, or the deadlines for several offers are coming in the next 2-3 days\\n   * time to pull your trump card\\n   * Contact your favorite company/offer (not necessarily the highest offer!)\\n   * Say \\\"I'm very exci-- you know by now\\n   * \\\"I have this and that offer, can you do X to help with my decision, and I will sign?\\\"\\n   * if( company never did a counter-offer )\\n      * then X = +20% of original offer\\n   * else if ( company is not the highest offer )\\n      * then X = highest offer (and maybe +10%)\\n   * else\\n      * X = +10%\\n   * This is on top of the possible counter-offers you got in the previous phase\\n   * No one gives their best price on the first offer, so ask for extra 20% from original offers at least. if you followed the advice from earlier, they already increased their first offer\\n   * Don't make the same company counter-offer over and over, except with this trump card, then you can ask for either your highest offer (of course, why would you take less than highest?\\\\*) or for 10% if it's already the highest offer as a bonus that you will sign and stop considering others\\n   * this is the one and only time you will put a hard limit on your pay\\n   * the only circumstance that you reveal the number that would make you sign now\\n   * never go back on your word and take that offer to another company, because you could have done earlier in the process, to get that same amount of $$$ while being polite in your negotiation, not like a lying asshole. You might the higher pay anyway, but you do it at the expense of burning a recruiter/company after saying you would sign if they did X. And I don't believe doing that can get you a significantly higher pay than this strategy that it would be worth it\\n   * then sign on the last day of expiration (beware off by 1 errors, check if 0-indexed or 1-indexed)\\n* bonus\\\\*: Pay is not all you can negotiate. More vacation days, work from home, etc. but going that way right at the beginning of negotiation, will make it hard to compare offers. it's easy to compare 140k and 150k, but hard to compare 140k+5 extra vacation or 150k, or compare 140k plus some equipment you like and 150k\\n   * so start with salary. later, if there's something you prefer over higher salary, ask for that in your trump card move\\n      * of course, negotiating full-remote when you are about to sign, might not work at all if the company doesn't do full-remote\\n* bonus: \\\"Oh shit, a company went back on their offer\\\" Immediately re-contact your second best offer, explain that the position was closed / the project abandoned (aka not your fault, you didn't kill the founders dog) and hope for the best\\n\\nThis post was inspired by many posts and blogs, personal experience, but primarily this: [https://haseebq.com/my-ten-rules-for-negotiating-a-job-offer/](https://haseebq.com/my-ten-rules-for-negotiating-a-job-offer/)\"", "title": "Not all can make top 5% salaries - by definition, but all would make more if they research salaries, job hop, negotiate, stack competing offers, rather than not. Here's how:", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/cscareerquestions/comments/ujjhpi/not_all_can_make_top_5_salaries_by_definition_but/"}, {"author": "None", "created_utc": 1587398707.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 845, "post_id": "g4viz4", "score": 3518, "subreddit": "cscareerquestions", "text": "\"She just told us in our daily standup that she wants to visit each member of the project at home in order to give advice on how to rearrange the interiour for more productivity, wants to talk with family to identify distractions and wants to sit right next to someone in order to see working from home. \\nWhat should I do? That sounds really uncomfortable to me because I'm quite introverted and I don't think that this will help me.\"", "title": "Scrum Master wants to visit each member of the project at home \"in order to understand the work from home experience for a developer.\"", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/cscareerquestions/comments/g4viz4/scrum_master_wants_to_visit_each_member_of_the/"}, {"author": "cbxxxx", "created_utc": 1654345635.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 484, "post_id": "v4nuay", "score": 3423, "subreddit": "cscareerquestions", "text": "\"When Elon Musk sent an email the other day demanding that all his staff come back to the office or face dismissal, I saw a lot of posts on Linkedin from the anti-WFH crowd along the lines that \\\"See, even a company as big as Tesla can't function with its staff working from home\\\" or \\\"Tesla only became as successful as it did because of the people who came to work\\\".\\n\\nA short time later Elon revealed that he's concerned about the economy and intends to reduce Tesla's workforce by 10%. It's pretty clear that he issued the mandate hoping that some of his staff would choose to resign rather than return to the office.\\n\\nDoes anyone else find it ironic that proponents of the anti-WFH voice used this example, which was orchestrated to make people quit their jobs, to try and prove their point that everyone should return to the office?\\n\\nSeems more to me like working from home was too effective and that's what most people would prefer to do. But everyone's different and adults should be given the opportunity to decide what works best for them.\"", "title": "The irony of using Tesla's return-to-office mandate to bash WFH", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/cscareerquestions/comments/v4nuay/the_irony_of_using_teslas_returntooffice_mandate/"}, {"author": "ConsulIncitatus", "created_utc": 1627649641.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 668, "post_id": "ouk1at", "score": 3373, "subreddit": "cscareerquestions", "text": "\"Hey guys - if you have the time, take a minute to read a couple of the anecdotes of women who worked at Blizzard, [here](https://www.twitlonger.com/show/n_1srp3fb) and [here](https://wtbrecognition.blogspot.com/2021/07/my-experiences-at-blizzard-entertainment.html?m=1).\\n\\nThis sub trends young and trends male, so to that audience, I want to warn you all how easy it is to become acclimated to a culture, even a toxic one.  \\n\\nWhen I was 22 I started working for a company that was an acquired startup of almost all men and a handful of women.  It didn't have the problems that Blizzard has - it was far from \\\"frat boy\\\" - it was more Office Space-esque cynicism.  It affected me far more than I realized, because as a young professional, I sought approval from my older peers and bosses.  I wanted to *fit in*, so I behaved the way they did.  And it hurt me personally and professionally.  I was completely blind to it at the time, but in hindsight, I was surrounded by bitter, jaded, poisonous people, and I became that way myself.\\n\\nI know it seems slimy to call the perpretrators at Blizzard victims too, but many of them are, because work does that to you.  When you spend 40 hours a week for years on end with a group of people, their behavior and attitudes (aka, their culture) *will* affect you, no matter how hard you think it won't.\\n\\nDon't let that happen to you.  If you find yourself at a company that tolerates anything even approaching the way Blizzard let its male employees treat its female employees, do something about it, or quit, or both.  I know the market is tough and that's easier said than done, but even if your conscience doesn't demand it, guilt by association is a real thing.  Blizzard was an amazing name on your resume until about a week ago.  Now it's a liability.\\n\\nIf there's one explanation for the Blizzard debacle, it's that evil perpetuates when good men do nothing.\\n\\nEDIT: To be clear - I'm not blaming the victims here, nor am I suggesting perpetrators are blameless.  I am warning you to steer clear of situations that might require you choose between your conscience or your job.  If you are forced to make the wrong choice too many times, it could have negative, lasting effects on you.\"", "title": "Pay attention to what's going on with Blizzard", "upvote_ratio": 0.84, "url": "https://www.reddit.com/r/cscareerquestions/comments/ouk1at/pay_attention_to_whats_going_on_with_blizzard/"}, {"author": "dataperson", "created_utc": 1490410865.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 271, "post_id": "61di57", "score": 3314, "subreddit": "cscareerquestions", "text": "\"In light of the two recent posts on *creating fake [job](https://www.reddit.com/r/cscareerquestions/comments/61b5rf/i_posted_a_fake_job_listing_to_get_a_feel_for/)/[internship](https://www.reddit.com/r/cscareerquestions/comments/61cy7v/fake_internship_posting_absolutely_blown_away_by/) postings*, can we as a sub come together and just...stop? Please. *Stop.*\\n\\nThis shit is **weird**. Not \\\"interesting\\\", not \\\"deep\\\" or \\\"revealing about the tech industry\\\", not \\\"an unseen dataset\\\". It's **weird**. Nobody does this \\u2014 nobody.\\n\\nThe main posts are bad enough \\u2013 posting fake jobs to look at the applicants? This is *pathetic*. In the time you took to put up those posts, collect resumes, and review the submissions, you could have picked up a tutorial on learning a new framework.\\n\\nThe comments are doubly as terrifying. Questions about the applicants? There are so many ethical lines you're crossing by asking questions about school, portfolio, current employment, etc. These are *real people* whose data you solicited **literally without their consent** to treat like they're lab rats. It's **shameful**. It is neurotic. It is **sad** in every sense of the word.\\n\\nAnalyzing other candidates is a thin veil over your blatant insecurities. Yes, the field is getting more saturated (a consequence of computer science becoming more and more vital to the working world) \\u2014 who gives a damn? Focus on yourself. Focus on getting good. Neuroticism is difficult to control once you've planted the seed, and it's not a good look at all.\"", "title": "This sub is getting weird", "upvote_ratio": 0.89, "url": "https://www.reddit.com/r/cscareerquestions/comments/61di57/this_sub_is_getting_weird/"}, {"author": "mistergerber2019", "created_utc": 1597987507.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 194, "post_id": "idqtgo", "score": 3278, "subreddit": "cscareerquestions", "text": "\"Being a neonate, I often find that professional spaces tend to greatly discriminate against me - often times, I attend interviews, only to be vigorously patronized and coddled. \\n\\nLast week, I attended a virtual interview for a developer position at Goldman Sachs. For the upcoming months, I poured over \\\"Cracking the Coding Interview\\\" by Gayle Laakmann McDowell and completed MIT's 6.006 course. I wore my best slacks, but despite this, my interviewer dismissed me the moment I came onto the call. I have difficulty enunciating, as I have no teeth, and due to this lacking of mine, my interviewer began to coo at me, saying \\\"Who's a smart boy? Who's the cutest boy in the world?\\\". He then turned to someone off camera and said, \\\"I think someone just... left their kid at the computer and didn't show up for the interview...?\\\" Fools! How insulting.. my parents are gainfully employed. And I knew the answer to his query, \\\"who's the cutest boy\\\" was me, of course - my mother tells me as such daily, but what could I say to that clear repudiation of my technical skill? \\n\\nOne interview, in particular, sticks out in my mind as being the worst instance of neonate-ism that I have experienced in my lifetime. I will not name names, but at this interview, I was bounced from lap to lap, fed liters of milk, and my suit was ruined by the slops of Gerber 2nd Food Tube Vegetable Beef Baby Meals! \\n\\n I want to be taken seriously in my career, I have the skills. I'm an avid contributor to many JavaScript open source projects and I understand the ins and outs of neural networks. I am starting to believe that they don't want to test my coding skills after all... perhaps my fatal flaw is the lack of years of experience with each language. I feel as though my coding prowess itself is adequate, however, I have only been coding for the last five months, as that is when my fine motor skills had developed sufficiently for me to type. Prior to that, I was reading up on CS theory, discrete mathematics, and linear algebra. I suspect that my interviewers are seeking out employees with more months of experience. \\n\\nI'm wondering if others have experienced something similar in their travails in technical coding interviews. How do I overcome my deficient experience and showcase my skills?\"", "title": "I (M,1), am having difficulty in finding jobs in my field of study.", "upvote_ratio": 0.93, "url": "https://www.reddit.com/r/cscareerquestions/comments/idqtgo/i_m1_am_having_difficulty_in_finding_jobs_in_my/"}, {"author": "gsuboiboi", "created_utc": 1613252809.0, "link_flair_template_id": "1ae775c6-1232-11e5-bc2c-0e9aedb4175b", "link_flair_text": "Meta", "num_comments": 454, "post_id": "lja3lc", "score": 3256, "subreddit": "cscareerquestions", "text": "\"It bothers me so much when I see all the people at work all frail and hunched over at their desks. I get you are supposed to work hard for the company but not at the expense of your health. So many colleagues with diabetes and high blood pressure, sheesh. Please exercise regularly and eat healthy. Me personally, I exercise well but my diet is outta wack.  So even I have to work on this. CS careers lead to a sedentary lifestyle. Let\\u2019s fix this. Sending positive vibes. Peace out.\"", "title": "Please take care of your body", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/cscareerquestions/comments/lja3lc/please_take_care_of_your_body/"}, {"author": "GermanNarvaez", "created_utc": 1601260871.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 498, "post_id": "j14267", "score": 3222, "subreddit": "cscareerquestions", "text": "\"This happened a few months ago. I was called by a HR person who told me that they were interested in my profile. After getting a perfect score in their easy leetcode questions I was scheduled a final interview with a mexican dev (I'm from Colombia).\\n\\nAnd then it started. That guy didn't read my CV before the meeting and got angry when I told him that my undergrad was in EE and not CS. He spent almost 15 minutes berating me about it. \\\"Can you really program at all? what are you doing here? you won't be able to get anything done\\\". After his speech about how I didn't have the knowledge needed to get the job, he saw that I got a perfect score in their assessment. Then he gave me 5 minutes to talk about my experience and the interview ended. I thought about telling the HR person who started the process, but they ghosted me after this interview.\\n\\nI'm quite angry about it, specially because I never applied. It was their HR staff who got in touch with me.\"", "title": "I was humiliated because my undergrad is EE and not CS", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/cscareerquestions/comments/j14267/i_was_humiliated_because_my_undergrad_is_ee_and/"}, {"author": "_sleepykitten_", "created_utc": 1681237311.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 393, "post_id": "12isln9", "score": 3222, "subreddit": "cscareerquestions", "text": "\"Just an FYI, don't get blindsided like I did. I have a tendency to be optimistic. \\n\\nThere are not usually any exciting updates to reveal, this is the sign of a goodbye waiting to happen.\"", "title": "If HR and the CEO join your standup, you're all getting laid off", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/cscareerquestions/comments/12isln9/if_hr_and_the_ceo_join_your_standup_youre_all/"}, {"author": "SnooDonuts7261", "created_utc": 1639182914.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 495, "post_id": "rdn3z9", "score": 3159, "subreddit": "cscareerquestions", "text": "\"I just went through my Microsoft onsite for new grad and literally just had the worst interview experience of my life. Interviewer showed up with his camera turned off and wanted to go straight to coding. He gave me a question and I explained my approach and then he wanted me to solve it using a stack DFS instead of recursion, which I had never done before so I struggled a bit. I usually have some scratch paper in hand so I can visualize things, but he told me that I wasn't allowed to do that and to use the Codepair scratchpad. Later as I looked to the side to think for a second, he asked me \\\"why the fuck are you looking to the side\\\" (verbatim) and to focus on the screen, to which I apologized and kept going. He wasn't really angry, in fact he was laughing when he said it but at this point I was extremely uncomfortable and it was impossible to think through the problem. I was explaining my thought process and when I said something about popping a node from the stack he deadass replied \\\"Ayee pop it like it's hot\\\".\\n\\nHe then started getting impatient when I couldn't solve the problem and he started throwing out a lot of curse words in his hints (that weren't ever helpful) and then said \\\"C'mon you're a \\\\[T10 uni\\\\] student, show me some code\\\", which is probably one of the most demoralizing things I've been told. He ended it and asked me if I had any questions. I asked him how he liked Microsoft and he said you learn a lot but \\\"the pay is shit and the work is boring.\\\" I thanked him for his time and he said yeah and dc'ed (this was the first interview of the loop). Got rejected the next day.\\n\\nGG\"", "title": "lnterview From Hell", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/cscareerquestions/comments/rdn3z9/lnterview_from_hell/"}, {"author": "yeahdude78", "created_utc": 1672668127.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 485, "post_id": "101db50", "score": 3086, "subreddit": "cscareerquestions", "text": "\"Basically the title..\\n\\nI have a great job, interesting, good co-workers, sane management, awesome work life balance, fully remote.. but I'm still dreading having to work tomorrow. Going to really miss the holidays.\\n\\nWhat about you?\"", "title": "Anyone else dreading going to work after the holidays?", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/cscareerquestions/comments/101db50/anyone_else_dreading_going_to_work_after_the/"}, {"author": "bored_and_scrolling", "created_utc": 1646158223.0, "link_flair_template_id": "1ae775c6-1232-11e5-bc2c-0e9aedb4175b", "link_flair_text": "Keep it civil!", "num_comments": 1077, "post_id": "t4e8o6", "score": 3037, "subreddit": "cscareerquestions", "text": "\"So I just unfortunately heard that all of our remote russian devs were just fired due to the US economic sanctions on Russia. Does this mean that US companies cannot employ people in Russia at all? Sounds pretty insane. Can anyone elucidate?\\n\\nEdit: This post is probably gonna get locked after I say this but to be clear if you are one of the people commenting here of the opinion that it's GOOD for Russians to lose their jobs because of who their leader is, maybe you should educate yourself just a tiny bit about the active imperial military invasions the US has done and the millions we've killed without any consequences overseas as recently as in the last 20 years. Next time think about that before you start saying it's good for civilians to have their lives ruined for the actions of their leaders. \"", "title": "All Russian developers at my company just got fired", "upvote_ratio": 0.87, "url": "https://www.reddit.com/r/cscareerquestions/comments/t4e8o6/all_russian_developers_at_my_company_just_got/"}, {"author": "anonproduct", "created_utc": 1676842556.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 298, "post_id": "116oo6o", "score": 3034, "subreddit": "cscareerquestions", "text": "\"Short summary:\\n\\nThe FTC has proposed a rule to ban non-competes, and retroactively invalidate old ones.\\n\\nFor those not familiar, many tech companies outside of California force employees to sign horrible non-competes that prevent you from getting other jobs related to that. These are downright evil.\\n\\nWhy?\\n\\n1. They can be super broad, capturing massive industries or technologies\\n\\n2. They can include \\\"lists of competitors that we can add to at any time\\\"\\n\\n3. They apply to nearly everyone, not just those with sensitive information\\n\\n4. They are absolute bullshit. These contracts essentially would prevent you from working at companies with the exact skillset you grew.\\n\\nHow would you feel if you were desperate for a job right now and dealing with this?\\n\\nPlease, please, please go make a public comment here before the FTC stops taking comments. Discuss how it restricts competition.\\n\\n[https://www.regulations.gov/document/FTC-2023-0007-0001](https://www.regulations.gov/document/FTC-2023-0007-0001)\\n\\nComment button is the blue button on the top left\"", "title": "FTC has proposed banning non-compete agreements. PLEASE go comment in support of this for your own good.", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/cscareerquestions/comments/116oo6o/ftc_has_proposed_banning_noncompete_agreements/"}, {"author": "psychometrixo", "created_utc": 1557175219.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 843, "post_id": "blhdf7", "score": 2987, "subreddit": "cscareerquestions", "text": "\"Sometimes I see people in this sub getting down about themselves and I wanted to share a perspective from the other side of the desk.\\n\\nI'm currently hiring contractors for bug fix work.  It isn't fancy.  We're not in a tech hub.  The pay is low 6 figures.  \\n\\nSo far in the last 2 weeks, a majority of the candidates I've interviewed via phone (after reviewing their resume and having them do a simple coding test) are unable to call out the code for this:\\n\\n> Print out the even numbers between 1 and 10 inclusive\\n\\nThey can't do it.  I'm not talking about getting semicolons wrong.  One simply didn't know where to begin.  Three others independently started making absolutely huge arrays of things for reasons they couldn't explain.  A fourth had a reason (not a good one) but then used map instead of filter, so his answer was wrong.  \\n\\nBy the way: The simple answer in the language I'm interviewing for is to use a for loop.  You can use an if statement and modulus in there if you want.  += 2 seems easier, but whatever.  I'm not sitting around trying to \\\"gotcha\\\" these folks.  I honestly just want this part to go by quickly so I can get to the interesting questions.  \\n\\nThese folks' resumes are indistinguishable from a good developer's resume.  They have references, sometimes a decade+ of experience, and have worked for companies you've heard of (not FANG, of course, but household names).  \\n\\nSo if you're feeling down, and are going for normal job outside of a major tech hub, this is your competition.  You're likely doing better than you think you are. \\n\\nKeep at it.  Hang in there.  Breaking in is the hardest part.  Once you do that, don't get complacent and you'll always stand out from the crowd. \\n\\nYou got this.\"", "title": "Hiring manager checking in - you're probably better than this sub makes you feel like you are", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/cscareerquestions/comments/blhdf7/hiring_manager_checking_in_youre_probably_better/"}, {"author": "away_shall_be_thrown", "created_utc": 1641327645.0, "link_flair_template_id": "0968d7a4-1232-11e5-a323-0e1422b8b60b", "link_flair_text": "Experienced", "num_comments": 366, "post_id": "rw3p8u", "score": 2965, "subreddit": "cscareerquestions", "text": "\"FANG and other big companies keep the data that you generated while interviewing with them forever.    \\n   \\nUnder GDPR, they are *required* to provide you with this data request. Just send them an email with a request for this data and they must comply (say in the email that it is a formal notification of a GDPR request).\\n  \\n \\nI have personally tested this with a couple of FAANG companies and the response was quite surprising. There was an interview that I felt went great but the interviewer thought I didn't know how to use a std::vector and thus rated my coding skills as bad (even though I did know how to perfectly use a fucking vector as I use one almost every day in my job).   \\n\\n\\n    \\nA lot of information will be redacted from these documents but it is still a useful source of feedback!\\n\\n\\nEDIT: Many people seem to think that \\\"running a background check\\\" can easily reveal whether you are a European resident or not. It's not that simple, one could easily hold dual nationality without it showing up anywhere. That have no way of knowing at all\\n\\n   \\n   \\nEDIT 2: The way this works is that large companies have entire departments that deal with these sorts of requests. A sample email you could send is:\\n\\nSUBJECT: GDPR request for accessing my previous interview feedback\\n\\nHi, \\n\\nI would like access to all of my interview feedback data. I interviewed with your company on mm-dd-yy. \\nMy full name is X X \\n\\nThis is a formal\\u00a0GDPR\\u00a0request to access this data.\\n\\n\\nThank you,    \\nCandidateName\"", "title": "PSA: If you want to know why a big company rejected you, send them a GDPR request", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/cscareerquestions/comments/rw3p8u/psa_if_you_want_to_know_why_a_big_company/"}, {"author": "dysonsphere87", "created_utc": 1634747902.0, "link_flair_template_id": "0968d7a4-1232-11e5-a323-0e1422b8b60b", "link_flair_text": "Experienced", "num_comments": 247, "post_id": "qc50hf", "score": 2962, "subreddit": "cscareerquestions", "text": "\"One thing I found that doesn't appear enough on this SR is communication. I tend to see any variation of \\\"Is this offer good?\\\" or, \\\"Why do I have to grind leetcode?!\\\". Most of the on-the-job posts consist of \\\"I am in a toxic environment\\\" or \\\"Should I change jobs?\\\"\\n\\nI have a piece of career advice for anyone who is fairly new to the field that I think could prove helpful. \\n\\nFirst, a little about me as while I'm not going to hinder my anonymity I do feel I'm in a position where I can rightly prescribe advice to newer SE's / grads / those still school: I'm a Principal Engineer, and have a wide array of experience across operations (including release / implementation) as well as experience developing user-facing code, and internal tooling used organization-wide. I've worked in the DOD, networking space, e-commerce, and fin-tech. \\n\\nJobs I've held include:\\n\\n* Software engineer (senior/staff/principal)\\n* DevOps Engineer\\n* Lead DevOps engineer\\n* Lead Site Reliability Engineer\\n* Tech Lead\\n* Software Development Manager\\n* Director of Operations\\n\\nOne of the greatest skill deficiencies I see in engineers has always been communication. Communication is a very important part of our job. It allows us to promote our ideas, defend our solutions, play the Devil's Advocate, request help, refuse help, patronize others as well as compliment them. We can use communication to self-promote or self-deprecate. Communication literally sets us apart from every other species on this planet; that's not to say other species can't communicate, but that you won't see one chimpanzee explaining to another what the functional use of a blow-hole in Blue Whales is after explaining the nuances in their childrens' respective behavior while foraging for food. \\n\\nHere is a hard reality for many engineers: ***Even if you are the best software developer at your entire company, getting others (employees, external customers, internal customers) to actually use what you wrote is a different beast than writing a tool.***\\n\\nHere is another hard reality: ***Many tasks rely on others to \\\"un-block us\\\". There are of course times when the blocker is stubborn enough that solid communication doesn't help, but solid communication never hurts.*** \\n\\nIt's not uncommon for a developer to feel like a priority queue that relies on other priority queues which are poorly optimized, and plagued with race-conditions. \\n\\nBelow are some points I'd like to make on the subject of communication:\\n\\n**Being direct is not mutually exclusive with being polite**. I often find overtly rude people fall on the \\\"I'm just direct and straightforward!\\\" excuse as though it actually is an excuse for their rudeness. Consider different ways to say the same thing. This SR, and many others, while not inherently controversial (rudeness is often derived from controversial topics), is plagued with what I'd call \\\"direct rudeness\\\". Most of us who have posted here at one point or another have been faced with someone who disagreed but failed to do so in a way that made us feel any productive discussion was possible. \\n\\nConsider the following two versions of the same sentence (email threads I've actually witnessed, redacted of course):\\n\\n>Hello \\\\_\\\\_\\\\_\\\\_\\\\_, you are writing a tool that duplicates work done in a tool I've already written. You need to do a better job of communicating what you're working on so we aren't constantly creating duplicate work and wasting time.\\n\\nHowever, consider had it been structured slightly differently:\\n\\n>Hello \\\\_\\\\_\\\\_\\\\_\\\\_, I noticed you're contributing to a tool which I found here(assume a link to source). I'd like to learn more about your specific needs and perhaps discuss whether $TOOL\\\\_I\\\\_ALREADY\\\\_WROTE would fit them, and if not perhaps we could discuss continuing your thread of work towards enhancing the existing tool-set by adding any features you find it's lacking, as there is certainly some overlap. It'd be great if we could avoid duplicate efforts and enhance a tool that's already in use by the organization. Let me know your thoughts.\\n\\nBoth sentences communicate the same message, but the former puts the recipient on the defensive and immediately raises a few barriers in their mind. Upon receiving it they will be texting / chatting most of their close-colleagues about what a jerk you were. You turned your potential meeting on the topic into a street brawl instead of a discussion. Sometimes it can work out, but why cause additional stress? \\n\\nI'd argue that the second version of the sentence still gets the point across but puts the recipient and relative ease and opens a dialogue. To expand upon it a bit more in the second version we acknowledge that the recipient is writing a tool, and raise the concern on the overlapping functionality of that tool with an existing one. The purpose of the email is clearly stated as a goal; avoiding overlap. It's not an accusation but a goal and the use of 'we' puts a collective goal in the recipient's mind. Closing with \\\"Let me know your thoughts.\\\" opens a dialogue whereas the over-directness of the first version never actually indicates any interest in a dialogue or common goal.\\n\\n**Everyone is busy, even when they aren't.** We all need things from colleagues, and some colleagues are naturally more busy than others, and some seem like they're never actually working on anything. It's not our job as developers / individual contributors to judge another's workload (and if it is you should evaluate your company's situation). Many things are cyclical and you may be faced with situations where you need a thing done by someone you do not particularly enjoy working with. I have found strategies in communicating with such people that have been effective, for the most part. \\n\\nPeople love when you acknowledge \\\"how busy they are\\\" even when they aren't ever really busy from your perspective. Consider two people asking you for help:\\n\\n>Hey \\\\_\\\\_\\\\_\\\\_, can you please do \\\\_\\\\_\\\\_\\\\_ for me? This is very urgent and blocking $IMPORTANT\\\\_THING.\\n\\nConsider that your $IMPORTANT\\\\_THING isn't always their $IMPORTANT\\\\_THING. Your emergency isn't always theirs. In a company that is unified it certainly should be, and we should all be empathetic and helpful when we can and have the bandwidth, but it's not always the hand we're dealt. Consider this slight change:\\n\\n>Hey \\\\_\\\\_\\\\_\\\\_, I know you're really busy and I'm sorry to bother you! We have an urgent ongoing issue and I'd really, really appreciate it if you could take some time to look!\\n\\nKeep in mind these are all suggestions and things that have worked for me, but I've had much better luck with using the second version over the first. To reiterate: People love to appear busy. Especially at work. I don't know what it is about perpetually being busy, but it's a badge of honor in our work culture and to not be busy is to not be relevant. ***Also keep in mind that you yourself are not a metric by which to judge people. If you put in 80 hours a week at your salaried job, that's your prerogative. Do not hold that expectation of others.***\\n\\n**Strong opinions are still opinions.** This one is very relevant in our field as there are many subjects which are inherently based on opinions which draw a lot of controversy. Spaces vs tabs, programming syntax, which language to use, which tools to use, log formatting, etc.. Sometimes we're opinionated about the problems that need to be solved. Do they need to be solved? What's the reason we're solving it?\\n\\nAlways be self-aware of when you're prescribing your opinion vs. when you're prescribing factual-based information. Pick your battles. If you like tabs, and the project uses spaces, that is not the battle to pick. It's not even really worth a mention unless you can do it without being a jerk. If you want to prescribe your strong opinions onto others then be prepared to back up why you wish to do so.\\n\\nI recommend being objective, always. Do not make statements that cannot be backed up with other objective statements and explanations.\\n\\nIdentify why you're so strongly opinionated. Can you present your opinion in a way which shows it derives some mutual benefit?\\n\\nSometimes one opinion can be stronger than another opinion but this is usually rooted in **facts or history.** For example, the spaces vs. tabs talk is inherently based on opinion. If you walk into a project which uses tabs, and you are a spaces person, you ***do not just reformat the whole project to spaces. This will only make you appear to be an asshole.*** This is also a case where your ***opinion is wrong. Not in that one is superior to the other, but the fact that now when I run a diff in SCM across to revisions, you just created a shit-ton of change where there actually was none, making debugging harder and all because you felt your opinion was superior.*** \\n\\n**In closing -** I just wanted to possibly help some others in their communication style by providing some examples where I saw what I'd consider communication miss / failure, and examples that have personally worked wonders for me. I'm open to any additional input / advice / suggestions that could help others, as well, including if you want to indicate anywhere you disagree with the things I've said and make suggestions I might not have considered.\\n\\nJust always be aware that if you aren't communicating at your job, something is wrong. If you aren't communicating ***effectively*** then you are going to hit unnecessary hurdles in your career; a career that is inherently difficult to navigate given the constant churn on technological advancement / changes. I highly recommend any new engineer to host as many lunch and learns, and project demos as they can (code you wrote, tools you wrote, etc..) to improve these skills early in their career, as it will pay massive dividends in the years to come. As for written communication, if you are communicating something that feels edgy / difficult, then sit on it for a bit and proof-read / reread it. Pretend you're the recipient and how you'd respond if you received it from yourself. Consider your relationship with the person you're sending to, and how they respond to and consume various types of communication. Always be learning about your peers and learn how to navigate their personalities in ways that increases your success without inhibiting theirs.\\n\\n&#x200B;\\n\\nThanks for reading.\"", "title": "Please don't neglect your communication skills in favor of improving your leetcode skills", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/cscareerquestions/comments/qc50hf/please_dont_neglect_your_communication_skills_in/"}, {"author": "yeahdude78", "created_utc": 1663915062.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 592, "post_id": "xlptfl", "score": 2943, "subreddit": "cscareerquestions", "text": "\"This post is not meant to discourage anyone. Nor is it a statistically valid study. I was just curious and decided to do a fun experiment.\\n\\nI have been hearing recently about how everyone should \\\"learn to code\\\", and how there are mass amounts of people going into computer science in university, or teaching themselves to code.\\n\\nWhat puzzled me is that if there are so many people entering the field, why is it still paying so much? why are companies saying they can't find engineers? Something was not adding up and I decided to investigate.\\n\\nSo I spent a few months asking \\\\~500 people on this sub if they were able to teach themselves enough to become an actual software engineer and get a job. I made sure to find people who had posted at least 1-1.5 years ago, but I went back and dug up to 3 years ago.\\n\\nOut of the 500 people I asked, I had a response rate of 267. Some took several weeks, sometimes months to get back to me. To be quite honest, I'm surprised at how high the response rate was (typically the average for \\\"surveys\\\" like this is around 30%).\\n\\nWhat I asked was quite simple:\\n\\n1. Were you able to get a position as a software engineer?\\n2. If the answer to #1 is no, are you still looking?\\n3. If the answer to #2 is no, why did you stop?\\n\\nThese are the most common answers that I received:\\n\\nQuestion # 1:\\n\\n\\\\- 12 / 267 (roughly 4.5%) of respondents said they were able to become software engineers and find a job.\\n\\nQuestion # 2:\\n\\n\\\\- Of the remaining 255, 29 of them (roughly 11%) were still looking to get a job in the field\\n\\nQuestion # 3:\\n\\nSince this was open ended, there were various reasons but I grouped up the most common answers, with many respondents giving multiple answers:\\n\\n1. \\\"I realized I didn't enjoy it as much as I thought I would\\\" - 191 out of 226 people (84%)\\n2. \\\"I didn't learn enough to be job ready\\\" - 175 out of 226 people (77%)\\n3. \\\"I got bored with programming\\\" - 143 out of 226 people (63%)\\n4. \\\"It was too difficult / had trouble understanding\\\" - 108 out of 226 people (48%)\\n5. \\\"I did not receive any interviews\\\" - 58 out of 226 people (26%)\\n6. \\\"Decided to pursue other areas in tech\\\" - 45 out of 226 people (20%)\\n7. \\\"Got rejected several times in interviews and gave up\\\" - 27 out of 226 people (12%)\\n\\n&#x200B;\\n\\nAnyways, that was my little experiment. I'm sure I could have asked better questions, or maybe visualized all of this data is a neat way (I might still do that). But the results were a bit surprising. Less than 5% were actually able to find a job, which explains my initial questions at the start of this post. Companies are dying to hire engineers because there still isn't that large of a percentage of people who actually are willing to do the work.\\n\\nBut yeah, this was just a fun little experiment. Don't use these stats for anything official. I am not a statistician whatsoever. \"", "title": "I asked 500 people on this r/learnprogramming if they were able to become software engineers. Out of the 267 that responded, only 12 told me they made it.", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/cscareerquestions/comments/xlptfl/i_asked_500_people_on_this_rlearnprogramming_if/"}, {"author": "bshutki", "created_utc": 1639678600.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 641, "post_id": "rhwl33", "score": 2930, "subreddit": "cscareerquestions", "text": "\"I started a new job 2 months ago. It's my first dev job. I have accrued a few days of Paid Time Off thus far. Catch is, at my company the PTO does not roll over to the new year. It's use it or lose it. \\n\\nSo I scheduled to take some PTO the week of Christmas, just to use up my days. Why not right? Well, my manager told me that it was a \\\"bad look\\\" for me to be taking PTO 2 months into the job, and that I had no need to take it this early. Now i'm worried about how i'll do when annual reviews come. Did I screw up?\"", "title": "Manager told me it's \"not a good look\" that i'm taking PTO", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/cscareerquestions/comments/rhwl33/manager_told_me_its_not_a_good_look_that_im/"}, {"author": "okawei", "created_utc": 1635535423.0, "link_flair_template_id": "10926bda-1232-11e5-a7a9-0e9aedb4175b", "link_flair_text": "Lead/Manager", "num_comments": 455, "post_id": "qikbq1", "score": 2905, "subreddit": "cscareerquestions", "text": "\"I'm currently a lead engineer at a F500 company.  Been at my current job for 4 of those 10 years.  I've worked at small startups to enterprise software company's.  I'd definitely consider myself \\\"senior\\\".\\n\\n\\nI just got to the 4th round of interviews for a new company, first was recruiter screen, then manager phone screen, then online coding assessment and finally this in person coding assessment.  I nailed the first 2 interviews as well as the take home coding assessment. \\n\\nThen came the live-coding session.  I was asked to solve a problem with an n-sized tic tac toe board determine whether X's won, O's won, nobody can win, or if we don't have enough data to determine if X or O has won.  \\n\\nAt the start I asked some clarifying questions then if I could use my IDE.  They said I had to use this browser version of essentially sublime text (no code completion, no auto formatting, etc).  I just froze, I was sitting starting at my two for loops and shitty code after about 30 minutes and realized I had no idea what I was doing in the moment.   I was talking through my thought process the whole time and the interviewers were just silent, it was awkward.  As soon as the interview ended and I thought more on the problem I realized like 3 solutions.\\n\\nI've never bombed an interview this bad but I guess after 10 years I was due to bomb an interview eventually.  Really sucks and I know that interview wasn't representative of my skills, but it happens.\\n\\nSo, don't be upset if you freeze during interviews, it happens to everyone. \\n\\n</end rant>\\n\\n\\nUpdate: I just got a job offer from FAANG, so it all worked out in the end!\"", "title": "I'm a lead software engineer with 10 YOE, I just bombed a coding quiz with a very simple problem, it happens to everyone.", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/cscareerquestions/comments/qikbq1/im_a_lead_software_engineer_with_10_yoe_i_just/"}, {"author": "CaptainAlex2266", "created_utc": 1677632095.0, "link_flair_template_id": "0968d7a4-1232-11e5-a323-0e1422b8b60b", "link_flair_text": "Experienced", "num_comments": 939, "post_id": "11epk68", "score": 2871, "subreddit": "cscareerquestions", "text": "\"Let's make this sub spicy\"", "title": "What is your unethical CS career's advice?", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/cscareerquestions/comments/11epk68/what_is_your_unethical_cs_careers_advice/"}, {"author": "Okmanl", "created_utc": 1556651764.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 172, "post_id": "bj7bg7", "score": 2867, "subreddit": "cscareerquestions", "text": "\"You can use them to practice your interview skills. If you get an offer just tell them that you can't work for them because you got accepted for a paid internship.\\n\\n&#x200B;\\n\\nNot only do you get back at exploitive companies by wasting their time, but you will also be able to practice what you're going to say when interviewing at a real company.\"", "title": "Unpaid internship opportunities are actually useful and you should apply to them.", "upvote_ratio": 0.93, "url": "https://www.reddit.com/r/cscareerquestions/comments/bj7bg7/unpaid_internship_opportunities_are_actually/"}, {"author": "csnoobcakes", "created_utc": 1625341380.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 530, "post_id": "od4wu5", "score": 2818, "subreddit": "cscareerquestions", "text": "\"I've noticed a lot of these posts over the last year and the theme seems to be fairly common...\\\"I'm 16, 20, whatever\\\" + \\\"I don't want to go to college\\\" + \\\"I just want to start working\\\" + \\\"How do I get a job as a developer?\\\"\\n\\nWell, to be brutally honest, you probably won't. Yes, you can self teach yourself everything you need to know over 2-4 years, maybe 1 if you really cram, and you can build up a portfolio. So then what is your plan to get a developer job? You're going to nail the technical assessments? Ok, cool. How are you going to get the interviews? Your resume, assuming you put a lot of effort into making it look good, will always look like shit compared to even people who went to a boot camp let alone got a CS degree and are competing for that entry level job as well.\\n\\nLook, it's no secret that college is overpriced, it's expensive, you won't learn specific job skills like React there, etc. etc. I get that plenty of people get into the industry without a CS degree. I'm one of them. However, I also was able to get dev experience at my old job and get a couple interviews because of having 1.5 YOE of dev experience to get my current job. My old job I only got because I have a bachelor and master's degree in a field that old job was interested in. Oh yeah, I sent out 200 applications and got 2 interviews. 1 offer. The interview that resulted in an offer came from a referral I got by dumb luck.\\n\\nThe thing is that theoretically you could teach yourself everything you need to know in far less than 4 years and for damn near free with all the resources out there. If you have never gone to college yet though, you're about to graduate HS, etc. though it just amazes me at the stupidity of the idea of not wanting to go to college and just take the easy way out. You're not taking the easy way out by eschewing college and a CS degree. You're taking the hard way out because you're going to be one of those baby turtles hatching on the beach and trying to make it to the water. A few will make it...most will get eaten.\\n\\nIf you want to roll the dice with your life and career, sure go for it, I guess you can always go to college after you most likely fail to get an entry level job self teaching yourself. The only cost to you is time which of course you'll never get back. I personally don't understand why you would intentionally try to sabotage your life though. As an aside, if you're older and thinking of breaking into the field at the age of 25, 30, 35, etc. don't worry about this comment. I'm 37 and just broke in a couple years ago myself. I do feel like I need to \\\"catch up\\\" in terms of career but it's fine. Time is indeed a very real cost though and should be considered when making important life decisions.\\n\\nAnd to be clear, this is specifically directed at people who are of traditional college age, or about to be, who have no debt, kids, etc. getting in the way of them going to college. I just wanted to point out, as someone who is self taught themselves, that going the self-taught route is brutal as fuck and I wouldn't wish it on anyone.\\n\\nEdited to add: Some people seem to misunderstand the intent of this post. Not sure if I could have worded it better or their reading comprehension is terrible. At any rate, I'm not saying you're nothing or somehow \\\"less\\\" for not going to college. I'm saying that HR / recruiters will most likely filter out your resume for stronger resumes because the vast majority of your competition will have degrees and you won't. It has nothing to do with how good you are at development. It has everything to do with how qualified HR / recruiters think you are for the job posting they're trying to fill. It's common sense but enough people are questioning it that I guess I'll use a very simplistic example. 1 entry level job posting gets 600 applications. Very common thing to happen. Let's say 300 applications have CS degrees, 200 have boot camp certs, 100 are self taught. They want to pick 20 or 30 to interview. Why even look at the self taught? Hell it may be tough for the boot camp certs to get interviews. From the standpoint of trying to find candidates, most likely they'll pull the best looking 20-30 resumes from the CS degree applicants. It just is what it is.\"", "title": "Stop asking if a CS degree is worth it if you are young and haven't started college yet", "upvote_ratio": 0.93, "url": "https://www.reddit.com/r/cscareerquestions/comments/od4wu5/stop_asking_if_a_cs_degree_is_worth_it_if_you_are/"}, {"author": "captain_ahabb", "created_utc": 1649782105.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 611, "post_id": "u23kix", "score": 2795, "subreddit": "cscareerquestions", "text": "\"I wanted to make this post as kind of a counterweight to all the stories that get posted here of people attending bootcamps and then quickly making six figure salaries, because I do not think those stories really give an accurate impression to the people here who are considering going to a bootcamp. \\n\\nThere's a concept in statistics called [survivorship bias](https://en.wikipedia.org/wiki/Survivorship_bias) where cases of failure are ignored because they're less visible than cases of success. The people who went to a bootcamp and didn't make it aren't going to come in here and talk about it, and they certainly aren't going to show up in the \\\"placement statistics\\\" that the bootcamps advertise. \\n\\nMy cohort of 22 graduated a year ago from a fairly well-known bootcamp. Our program was pretty standard, three months of full-stack work focused on JavaScript and React which cost ~$15k. \\n\\nOut of those 22, 6 (including myself) are in full-time SWE roles, mostly small companies or agencies. No FAANG. 5 more are in other non-developer industry roles (recruiters, designers, support engineers etc). The other 11 are not working in the industry and most of them haven't even touched their LinkedIn profile for months. \\n\\nThis amounts to a placement rate of 27% which is not great for a program that costs $15k. The official \\\"placement rate\\\" of my program according to their advertising materials is ~60% (which they reframe as ~90% by excluding people who don't participate in their career services \\\"to completion\\\" whatever that means).\\n\\nI don't mean to scare people off bootcamps- they worked for me (although I already had a humanities BA). But I do want to warn people who are thinking about a bootcamp as a *shortcut* to get into the industry without the effort or cost of a BSCS. Is it possible? Yes. Is it easy or guaranteed? No.\"", "title": "A year ago I graduated from a bootcamp with 21 other people. Only 6 of us are working as SWEs today.", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/cscareerquestions/comments/u23kix/a_year_ago_i_graduated_from_a_bootcamp_with_21/"}, {"author": "lamentable-days", "created_utc": 1651513882.0, "link_flair_template_id": "05438160-1232-11e5-b573-0e1422b8b60b", "link_flair_text": "New Grad", "num_comments": 290, "post_id": "ugveah", "score": 2786, "subreddit": "cscareerquestions", "text": "\"A year ago as a fresh grad applying for junior developer positions, I chanced upon an interview for cibc, a bank in Canada. Since the experience lives rent free in my mind to this day, I\\u2019ll detail it.\\n\\nHad applied for a junior Java developer position, by this point in time I had a total of 1 yoe via coops. Got an invite for a 2 hour interview with a manager and 2 senior devs.\\n\\nThey started off with some basic java related questions, stuff you\\u2019d expect someone in their last year of uni to know, simple. They started going into somewhat more complicated questions, asking about patterns I\\u2019d heard of but never seen in practise - got a comment from one of the devs by this point along the lines of \\u201cwow they teach nothing to you people nowadays\\u201d for not knowing how to explain decorator pattern properly (and this after explaining factory, flyweight and observer with examples). Alright maybe that guy is just grumpy, it\\u2019s ok.\\n\\nThen I get asked about multithreading, said I knew about deadlocks in theory but never saw it in practise besides database tx locks\\u2026 another dev says they knew this stuff perfectly by their 2nd year back in India lol okay.\\n\\nThen I get asked a problem on cloning a graph, goes well\\u2026 solved it relatively quick since I had seen it before, get negged and gaslit to oblivion by one of the devs saying my code was good but I took too long compared to other candidates, \\u201cwe will give you a chance on this next question\\u201d he says\\u2026 then he pastes in an lc hard dp problem lmfao, understandably did not get it, \\u201ccome on man algorithm class should be enough to teach you this forever\\u201d.\\n\\nManager then say that\\u2019s enough and asks the two devs to get off, says he likes me and asks me what salary I\\u2019m expecting\\u2026 I said 75k cad (downtown Toronto btw) and he looks flabbergasted and says I\\u2019d need senior level knowledge for this.\\n\\nGot rejected, it was my first interview as well so my confidence took a brutal hit. A few weeks later I land something for 90k. \\n\\nWaiting for a hopeful acceptance to faang so I can add this gaslighting trio on LinkedIn as a flex.\\n\\nThat\\u2019s my story.\"", "title": "Name and shame: CIBC", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/cscareerquestions/comments/ugveah/name_and_shame_cibc/"}, {"author": "mitousa", "created_utc": 1657637960.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 297, "post_id": "vxd8zs", "score": 2765, "subreddit": "cscareerquestions", "text": "\"About a month ago I posted about [my project](https://puter.com/app/editor?c=1) on /r/programming ([the post](https://www.reddit.com/r/programming/comments/v45rb6/i_spent_a_year_building_a_desktop_environment/)). This was a passion project that I'd been working on for a year and the community was extremely kind and gracious with their feedback and comments.\\n\\nI received many messages afterward about development decisions, bugs, future plans, ... but what stood out for me was the sheer number of direct job offers I received (9 offers, pending finalization of course). This was VERY SURPRISING for me and even though I'm not looking for a job, I thought my experience might be helpful for others looking for a job in the software field, so ask me any questions you might have about the experience :)\"", "title": "I posted my project on Reddit and received 9 job offers", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/cscareerquestions/comments/vxd8zs/i_posted_my_project_on_reddit_and_received_9_job/"}, {"author": "OsrsNeedsF2P", "created_utc": 1658998187.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 1383, "post_id": "wa4krq", "score": 2753, "subreddit": "cscareerquestions", "text": "\"I'll start:\\n\\nPrevious job - All the top insurance companies are terrified some startup will come in and replace them with 90-100x the efficiency\\n\\nCurrent job - If a game studio releases a fun game, that was a side effect\"", "title": "Alright Engineers - What's an \"industry secret\" from your line of work?", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/cscareerquestions/comments/wa4krq/alright_engineers_whats_an_industry_secret_from/"}, {"author": "Azianese", "created_utc": 1701802468.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 709, "post_id": "18bj8pz", "score": 2751, "subreddit": "cscareerquestions", "text": "\"TLDR: Stop framing every opinion as fact.\\n\\nThe worst part of this sub is not the amount of bad advice (which is already astounding on its own). It's the amount of kids who are confidently incorrect and voice their inexperienced opinions as fact. \\n\\nThe problem is the new grads who think their limited experience is representative of the whole industry. The problem is the college kids who think their limited interactions with CS folks makes them an expert. The problem is the high schoolers who see the above commenters and blindly regurgitate that garbage.\\n\\nThe problem is that the above people almost always fail to qualify their statements with what their background actually is. \\n\\n* They fail to say, \\\"I've seen others say....\\\"\\n* They fail to say, \\\"As someone still in college, I think....\\\"\\n* Instead, they say, \\\"This is how things are.\\\"\\n\\nFor a sub about career questions/advice, how are the newly initiated supposed to differentiate the hot garbage from actual, useful advice? (Hint: They don't! Because y'all love to upvote the disinformation to the top too!)\\n\\nHere's a taste of my own experiences interacting with people from this sub:\\n\\n* Someone suggested big tech has about the same WLB as a \\\"chill government job.\\\" What did they do when I confronted them about it? They tried to straw man me by saying I believe all big tech was 60 hour work weeks.\\n* Someone was overinflating Bay Area rent prices. What did they do when I confronted them about it? They proudly claimed that their Canadian ass knew better than my 20+ years of living here because they looked up the price of a specific apartment in SF next to a train station.\\n* Someone claimed something iffy about the hiring process (I forgot what by now). What did they do when I asked them for a source for their statement? They referred to their astounding experience of setting up career fairs...as a student.\\n\\nThere's a reason why more experienced folks think this sub has become trash. It's become flooded with ego-boosted kids who comment as if they've never been wrong a single time in their lives. It's full of the CS-stereotype kids who like to double down on their mistakes because they're insecure about the possibility of being wrong. Oh, you've had 4 years of college experience? Congrats! You still don't know shit.\\n\\nBut there's a solution! Simply qualify your statements. It's ok to voice your opinion. And we're all wrong sometimes. But don't give others a false impression of how accurate your comments are by framing every single opinion as fact.\\n\\nEdit: And for all of you compelled to leave an uninspired comment about me stating everything as fact, feel free to contribute to the convo here: https://www.reddit.com/r/cscareerquestions/s/B328DfIEVG\\n\\nAnd regardless of whether or not my post applies the same way, feel free to read up here: https://en.m.wikipedia.org/wiki/Tu_quoque\"", "title": "Many of you are ruining this sub, and you don't even know it.", "upvote_ratio": 0.92, "url": "https://www.reddit.com/r/cscareerquestions/comments/18bj8pz/many_of_you_are_ruining_this_sub_and_you_dont/"}, {"author": "kevincookiemonster69", "created_utc": 1638336253.0, "link_flair_template_id": "05438160-1232-11e5-b573-0e1422b8b60b", "link_flair_text": "New Grad", "num_comments": 516, "post_id": "r67an5", "score": 2740, "subreddit": "cscareerquestions", "text": "\"About me: 21F, I have roughly a little less than a year worth of experience as a dev. Bootcamp graduate. Based in the UK.\\n\\n**How the interview process went:**\\n\\n* CEO: \\\\*is impressed by resume, thinks I'll be a great fit\\n* Lead dev: \\\\*Asks me some React questions - I answer them. Asks me if I know Redux and I said no.\\n* Lead dev: \\\\*Gives me a React challenge which is apparently one of the features of their product. I finish it and add some extra features I think will make the app have a better user experience.\\n* CEO a few days later \\\\*says lead dev was really impressed by my work\\n\\nI get an offer. I am very happy. **The lead dev seems extremely nice and tells me to ask him any question whenever I might need help or get stuck.**\\n\\nDay 1 - Day - 3: I see that the codebase is really messy. Some parts use JavaScript, some use TypeScript. Some use class components, some use functional components. Some files are extremely massive which can be broken down into smaller components/chunks. I was already told that they hired lousy devs in the past and that the codebase is trash now. I am given to implement some design changes for the login, sign up and a forgot password page. It's my first day and I dunno where is what, I make some simple changes on my own branch. Second and third day, I am almost done. Just some design tweaks here and there.\\n\\nThese 3 days I asked the lead dev lots of questions, most were on git as I was struggling to rebase my branch off of development and merging with development instead of master. He happily helped me and in some cases he told me to problem solve it on my own, which I successfully did.\\n\\nDay 4: I have to make two components interact with each other and from the codebase it wasn't obvious to me that they are parent-child. Even though I dunno Redux, I thought that is possibly the only way to implement the interaction. I ask the lead dev about it (previously he told me before my first day that he will give me a crash course on it) and he said **we'll jump on a call soon** (we work remotely) - so ***he*** **offered to help**.\\n\\nHe sees the problem and lets me realize that they are parent child, and so I can just pass props (no prop drilling required). I had to pass the prop from child (written as function) to parent (written in class) and I got a bit confused and asked him what will be the best way to tackle it - he says \\\\`${myName} that's very basic\\\\`. I realize its probably a dumb question and asked him not to worry about it and that I'll figure it out.\\n\\n**NOTE**: I know I'm expected to know React, which I do and would have solved this on my own - just got slightly confused and since we were already on a call and I have been told before that I can ask for help whenever I need, I went ahead and asked it. As you know I was initially expecting some Redux topics to get knowledge on and how it has been used on the codebase.\\n\\nDay 5: Starts with a meeting, where the CEO says that the lead dev said that I ask a lot of questions that I can just \\\"google\\\". The lead dev said I asked a very basic question and that I don't know how to pass props. Funny thing? - the feature I worked, I literally made an extra component myself to keep my files cleaner. The component is of course reusable and can be used throughout the codebase. So I respectfully told him that if I didn't know how to pass props I couldn't have created the component and used it.\\n\\nHe didn't reply to that and just closed of saying I wouldn't be a good fit. He further added something like, \\\"Ik I said, you can ask for help/ask questions. Well that isn't quite true\\\". I was shocked.\\n\\nP.S: Worst thing about this experience? The first 3 days of my work, I had 3 interviews (one with a *very* big company). When I got the job, I cancelled interviews with all 3.\"", "title": "Fired on my 5th day because I asked a \"basic question\" on my 4th day.", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/cscareerquestions/comments/r67an5/fired_on_my_5th_day_because_i_asked_a_basic/"}, {"author": "GeneralBend1", "created_utc": 1622059398.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 484, "post_id": "nlq44w", "score": 2728, "subreddit": "cscareerquestions", "text": "\"https://i.imgur.com/CjSuUP4.png\\n\\nThe guy put in his notice and quit his job because he had a Tesla offer and start date, then Tesla pulled the offer. They have tons of SWE job openings so why not slot him into another open SWE role?\"", "title": "Name and Shame: Tesla", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/cscareerquestions/comments/nlq44w/name_and_shame_tesla/"}, {"author": "None", "created_utc": 1619530001.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 345, "post_id": "mzofdk", "score": 2731, "subreddit": "cscareerquestions", "text": "\"Not everyone needs more leetcode.  There are tons of CS students who are technically skilled but have trouble selling themselves on a re sume or in an inter view.  Instead, find what stage you're failing at and fix it.\\n\\nIf you can't get ANY responses at all -> build a better re sume, do more projects, reach out directly to recruiters or managers\\n\\nIf you are stuck on online assessments -> grind leetcode\\n\\nIf you fail at inter views -> inter view prep, learn how to sell yourself better, get rid of awkwardness\\n\\nIn my experience, there are a lot more students who fail at #1 and #3 and this sub leads them in the wrong direction\"", "title": "Stop blindly saying \"grind leetcode\" to anyone who can't find a job.", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/cscareerquestions/comments/mzofdk/stop_blindly_saying_grind_leetcode_to_anyone_who/"}, {"author": "Powerful-Wasabi-5007", "created_utc": 1657007415.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 499, "post_id": "vrskco", "score": 2701, "subreddit": "cscareerquestions", "text": "\"Every time I open LinkedIn and read cringe about oh wow I got a new job wow I die a bit inside.\"", "title": "Why is LinkedIn so cringe?", "upvote_ratio": 0.94, "url": "https://www.reddit.com/r/cscareerquestions/comments/vrskco/why_is_linkedin_so_cringe/"}, {"author": "ohhellnooooooooo", "created_utc": 1651752324.0, "link_flair_template_id": "1ae775c6-1232-11e5-bc2c-0e9aedb4175b", "link_flair_text": "Meta", "num_comments": 921, "post_id": "uivy5i", "score": 2693, "subreddit": "cscareerquestions", "text": "\"edit: there's people /r/ProgrammerHumor accepting $45k, $60k with multiple years of experience and arguing back saying this is normal, and saying salaries like 200k are impossible, not common, or only exist in highly stressful jobs.\\n\\nor think that you must work 60h weeks to receive that kind of TC\\n\\nI just saw a thread in /r/ProgrammerHumor about 'tech bros earning +$200k\\\" and holy shit there are several people who straight don't believe that a normal non-genius developer with 5 years of experience, can earn 200k in Silicon Valley, and work only 40 hours, not being micromanaged.\\n\\nI understand this subreddit is very skewed to very high salaries. But it's still shocking to think that maybe 90 to 95% of developers out there in the real world, are doing a very poor job of demanding higher pay, to the point of not even Googling what the typical salaries are.\\n\\nIf you were to judge the typical salary by only paying attention to the people around your social circle... you'd probably not even notice that in the last few years salaries increased across the board by a lot\\n\\nyou wouldn't what the company in the next building is paying\\n\\nand not knowing means = you get underpaid\\n\\nI think we need to follow in the steps of /r/WorkReform and try to galvanize developers into learning their worth and demanding for more. It could raise everyone's pay. Collective action problems are hard to solve, but it's worth trying\"", "title": "Our salaries could be even higher: most devs not in this subreddit or in Blind, don't negotiate, don't believe there are 200k-500k TCs", "upvote_ratio": 0.89, "url": "https://www.reddit.com/r/cscareerquestions/comments/uivy5i/our_salaries_could_be_even_higher_most_devs_not/"}, {"author": "None", "created_utc": 1693495162.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 675, "post_id": "166e0dt", "score": 2675, "subreddit": "cscareerquestions", "text": "\"My company offers unlimited PTO as a \\u201cbenefit\\u201d. Complete scam. In reality many companies don\\u2019t want you to take any. They just don\\u2019t want to pay unused PTO at the end of your employment, period. Such a scam. Why not to name it as it is: \\u201cno guaranteed PTO\\u201d. Name it as it is. Companies don\\u2019t like employees lying on their resumes, but they just throw scammy \\u201cbenefit\\u201d promises on you no problem. How would they like if employees would say \\u201cI am ready to work unlimited hours, do unlimited OT, be all the time on call etc\\u201d but in reality underperform on max. Bet they would not like that\"", "title": "Unlimited PTO is such a scam", "upvote_ratio": 0.93, "url": "https://www.reddit.com/r/cscareerquestions/comments/166e0dt/unlimited_pto_is_such_a_scam/"}, {"author": "puthsuma", "created_utc": 1636038795.0, "link_flair_template_id": "0968d7a4-1232-11e5-a323-0e1422b8b60b", "link_flair_text": "Experienced", "num_comments": 985, "post_id": "qmmrg2", "score": 2656, "subreddit": "cscareerquestions", "text": "\"I guess the title says it all. \\n\\nSeeing people in here making 100k sounds like peasant, while I'm making less than 5$/hour, really hit a nerve in me. Adding on the fact that job contents sound comparable and the level is not that far different makes it even more stressing. \\n\\nWhile it's not bad compared to the COL, seeing that much money out there that you could make if you were living in another country make your life so unfulfilling.\"", "title": "It sucks to be in this subreddit being from the \"third-world\" country", "upvote_ratio": 0.91, "url": "https://www.reddit.com/r/cscareerquestions/comments/qmmrg2/it_sucks_to_be_in_this_subreddit_being_from_the/"}, {"author": "hickglok45", "created_utc": 1703784819.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 504, "post_id": "18szhyk", "score": 2642, "subreddit": "cscareerquestions", "text": "\"Why are they leaving? Did you expect to give them a year or two of experience but keep them at their junior salary forever? If they are finding better jobs doesn't that mean you are undervaluing them? So your $80k dev leaves because another company recognizes they are worth $120k and now you have to go find an equivalent replacement...at $120k market rate. What am I missing?\"", "title": "\"We stopped hiring juniors because they just leave after we train them\"", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/cscareerquestions/comments/18szhyk/we_stopped_hiring_juniors_because_they_just_leave/"}, {"author": "janiepuff", "created_utc": 1602691870.0, "link_flair_template_id": "0968d7a4-1232-11e5-a323-0e1422b8b60b", "link_flair_text": "Experienced", "num_comments": 533, "post_id": "jb3nrf", "score": 2632, "subreddit": "cscareerquestions", "text": "\"I've been in the industry close to a decade now. Never had a lay off, or remotely close to being fired in my life. I bought a house last year thinking job security was the one thing I could count on. Then covid happened. \\n\\nI was developing eccomerce sites under a consultant company. ended up furloughed last week. Filed for unemployment. I've been saving for house upgrades and luckily didn't start them so I can live without a paycheck for a bit.\\n\\nI had been clientless for several months ( I'm in consulting) so I sniffed this out and luckily was already starting the interview process when furloughed. My advice to everyone across the board is to live well below your means and SAVE like there's no tomorrow. Just because we have good salaries doesn't mean we can count on it all the time. Good luck out there and be safe.\"", "title": "Not a question but a fair warning", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/cscareerquestions/comments/jb3nrf/not_a_question_but_a_fair_warning/"}, {"author": "Milohk", "created_utc": 1643220625.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 336, "post_id": "sdcbrn", "score": 2613, "subreddit": "cscareerquestions", "text": "\"I made a react chess game with a rest API that controls a vibrator based on the amount of points each player has. It has the basic parts of a pretty good project like having sockets and API calls between the front end and back end. The only issue is that it also makes post calls to the vibrator server and if a company sees it and googles what lovense is they will realize it's a vibrator company. I think the code is pretty good and if it wasn't NSFW I would post it but I'm not sure if it's worth posting for companies to see.\\n\\nEdit: I am working on renaming the files and calls so it looks like a non-NSFW project then putting it on my Github. Thanks Guys. \"", "title": "Should I post my NSFW code to my github?", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/cscareerquestions/comments/sdcbrn/should_i_post_my_nsfw_code_to_my_github/"}, {"author": "eatsomeonion", "created_utc": 1635285668.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 335, "post_id": "qghe65", "score": 2590, "subreddit": "cscareerquestions", "text": "\"Dead simple requirement, show a popover on hover over something, show more detail in popover, show scroll bar if popover content is too long. I asked the threshold to show scroll bar - basically the max-height of popover container div. New PM who just started two weeks ago suggested \\\"using AI and machine learning\\\" to determine it.\\n\\nThis is the dumbest thing I've heard this year. How do I tell him this is extremely dumb.\"", "title": "New PM just suggested we use \"AI and machine learning\" to determine how high a div content should be before showing scroll bar. How to deal with this kind of PM?", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/cscareerquestions/comments/qghe65/new_pm_just_suggested_we_use_ai_and_machine/"}, {"author": "vertigo_101", "created_utc": 1660650576.0, "link_flair_template_id": "0968d7a4-1232-11e5-a323-0e1422b8b60b", "link_flair_text": "Experienced", "num_comments": 131, "post_id": "wps8kt", "score": 2555, "subreddit": "cscareerquestions", "text": "\"Hi everyone, today I open-sourced my free System Design course which is suitable for all levels.\\n\\nThis course also covers everything from basics to advanced topics of system design along with interview problems such as designing Twitter, WhatsApp, Netflix, Uber, and much more!\\n\\nI hope this course provides a great learning experience.\\n\\nLink: [https://github.com/karanpratapsingh/system-design](https://github.com/karanpratapsingh/system-design)\"", "title": "System Design course for everyone! (free)", "upvote_ratio": 0.99, "url": "https://www.reddit.com/r/cscareerquestions/comments/wps8kt/system_design_course_for_everyone_free/"}, {"author": "l33tsquad", "created_utc": 1575269326.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 87, "post_id": "e4v755", "score": 2539, "subreddit": "cscareerquestions", "text": "\"With the holidays coming up, I wanted to share some mostly free resources (well the books and some courses aren't free) that I've used for preparation in the past. If you have any resources that worked for you, let me know and I'll add it onto this list. My goal is to create a master list so everyone knows about which resources might be helpful.\\n\\nLeetcode Question Sets:\\n\\n* [https://leetcode.com/discuss/interview-question/352460/Google-Online-Assessment-Questions](https://leetcode.com/discuss/interview-question/352460/Google-Online-Assessment-Questions)\\n* [https://leetcode.com/discuss/interview-question/344650/Amazon-Online-Assessment-Questions](https://leetcode.com/discuss/interview-question/344650/Amazon-Online-Assessment-Questions)\\n* [https://www.teamblind.com/article/New-Year-Gift---Curated-List-of-Top-100-LeetCode-Questions-to-Save-Your-Time-OaM1orEU](https://www.teamblind.com/article/New-Year-Gift---Curated-List-of-Top-100-LeetCode-Questions-to-Save-Your-Time-OaM1orEU)\\n* [https://medium.com/@koheiarai94/60-leetcode-questions-to-prepare-for-coding-interview-8abbb6af589e](https://medium.com/@koheiarai94/60-leetcode-questions-to-prepare-for-coding-interview-8abbb6af589e)\\n* [https://h1ros.github.io/posts/coding/leetcode-top-100-problem-selection/](https://h1ros.github.io/posts/coding/leetcode-top-100-problem-selection/)\\n* [https://github.com/fterh/leetcode-curation-topical](https://github.com/fterh/leetcode-curation-topical)\\n* [https://github.com/liuchuo/LeetCode-Top100](https://github.com/liuchuo/LeetCode-Top100)\\n\\nSystem Design:\\n\\n* System design template - [https://leetcode.com/discuss/career/229177/My-System-Design-Template](https://leetcode.com/discuss/career/229177/My-System-Design-Template)\\n* [System Design Primer](https://github.com/donnemartin/system-design-primer)\\n* [Grokking the System Design Interview](https://www.educative.io/collection/5668639101419520/5649050225344512) \\\\*this isn't free but widely used\\n* [https://www.youtube.com/watch?v=iJLL-KPqBpM](https://www.youtube.com/watch?v=iJLL-KPqBpM)\\n\\nBehavioral/Deep-Dive:\\n\\n* [https://www.youtube.com/watch?v=PJKYqLP6MRE](https://www.youtube.com/watch?v=PJKYqLP6MRE)\\n* Amazon's official interview guide - [https://www.amazon.jobs/en/landing\\\\_pages/in-person-interview](https://www.amazon.jobs/en/landing_pages/in-person-interview)\\n\\nGeneral Interview Resources\\n\\n* Careercup\\n* Glassdoor\\n* Catalog of all FAANG interview information on Rooftop Slushie [https://www.teamblind.com/article/Catalog-of-FAANG-interview-information-MRLji71n](https://www.teamblind.com/article/Catalog-of-FAANG-interview-information-MRLji71n)\\n* [https://www.freecodecamp.org/](https://www.freecodecamp.org/)\\n\\nBooks:\\n\\n* Cracking the Coding Interview by Gayle Laakmann McDowell (6th edition) [https://www.amazon.com/Cracking-Coding-Interview-Programming-Questions/dp/0984782850/](https://www.amazon.com/Cracking-Coding-Interview-Programming-Questions/dp/0984782850/)\\n* Computer Science Distilled [https://www.amazon.com/Computer-Science-Distilled-Computational-Problems/dp/0997316020](https://www.amazon.com/Computer-Science-Distilled-Computational-Problems/dp/0997316020)\\n* [Distributed Systems for Fun and Profit](http://book.mixu.net/distsys/single-page.html) \\\\- free book, 100 pages or so, but excellent content\\n* Designing Data Intensive Applications by Martin Kleppman - this is a more in-depth book, and you can get it on Amazon/libgen\\n* The Google Resume by Gayle Laakmann McDowell (1st edition)\\n* Programming Interviews Exposed\\\" by John Mongan, Noah Suojanen (3rd edition)\\n* Elements of Programming Interviews\\\" by Adnan Aziz, Tsung-Hsien Lee, and Amit Prakash (2nd edition)\\n* System Design Primer\\\" by Donne Martin\\n* Grokking Algorithms (free to read online) [https://www.manning.com/books/grokking-algorithms](https://www.manning.com/books/grokking-algorithms)\\n\\nCourses\\n\\n* [https://www.educative.io/courses/grokking-the-system-design-interview](https://www.educative.io/courses/grokking-the-system-design-interview) \\\\*this isn't free but widely used\\n* [https://www.educative.io/courses/grokking-dynamic-programming-patterns-for-coding-interviews](https://www.educative.io/courses/grokking-dynamic-programming-patterns-for-coding-interviews) \\\\*this isn't free but widely used\\n* [https://ocw.mit.edu/courses/electrical-engineering-and-computer-science/6-006-introduction-to-algorithms-fall-2011/](https://ocw.mit.edu/courses/electrical-engineering-and-computer-science/6-006-introduction-to-algorithms-fall-2011/)\\n* [https://www.youtube.com/watch?v=y62zj9ozPOM&list=PLhQjrBD2T3828ZVcVzEIhsHVgjANGZveu](https://www.youtube.com/watch?v=y62zj9ozPOM&list=PLhQjrBD2T3828ZVcVzEIhsHVgjANGZveu)\\n\\nBlogs\\n\\n* Netflix tech blog - [https://medium.com/netflix-techblog](https://medium.com/netflix-techblog)\\n* Uber - [https://eng.uber.com/](https://eng.uber.com/)\\n* Twitter - [https://blog.twitter.com/engineering/en\\\\_us.html](https://blog.twitter.com/engineering/en_us.html)\\n* Airbnb - [https://medium.com/airbnb-engineering](https://medium.com/airbnb-engineering)\\n* Airbnb - [https://airbnb.io/](https://airbnb.io/)\\n* Here's a consolidated list of company-wise engineering blogs: [https://github.com/kilimchoi/engineering-blogs](https://github.com/kilimchoi/engineering-blogs)\\n* [https://medium.com/outco](https://medium.com/outco)\\n* [https://medium.com/@liyin2015](https://medium.com/@liyin2015)\\n* [https://medium.com/@sourabreddy](https://medium.com/@sourabreddy)\\n* [https://github.com/donnemartin/system-design-primer](https://github.com/donnemartin/system-design-primer)\\n* [https://www.geeksforgeeks.org/](https://www.geeksforgeeks.org/)\\n* [https://github.com/sindresorhus/awesome](https://github.com/sindresorhus/awesome)\\n* [https://github.com/liyin2015/Algorithms-and-Coding-Interviews](https://github.com/liyin2015/Algorithms-and-Coding-Interviews)\\n* [https://medium.com/leetcode-patterns](https://medium.com/leetcode-patterns)\\n* [https://hackernoon.com/14-patterns-to-ace-any-coding-interview-question-c5bb3357f6ed](https://hackernoon.com/14-patterns-to-ace-any-coding-interview-question-c5bb3357f6ed)\\n* [https://www.programcreek.com/2012/11/top-10-algorithms-for-coding-interview/](https://www.programcreek.com/2012/11/top-10-algorithms-for-coding-interview/)\\n\\nYoutube channels/playlists that I found helpful:\\n\\n* [Back to Back SWE](https://www.youtube.com/channel/UCmJz2DV1a3yfgrR7GqRtUUA) \\\\- playlists [https://www.youtube.com/channel/UCmJz2DV1a3yfgrR7GqRtUUA/playlists](https://www.youtube.com/channel/UCmJz2DV1a3yfgrR7GqRtUUA/playlists)\\n* [Tushar Roy](https://www.youtube.com/user/tusharroy2525)\\n* [happygirlzt](https://www.youtube.com/channel/UCamg61pfZpRnTp5-L4XEM1Q)\\n* Nick White's Leetcode explanations - [https://www.youtube.com/playlist?list=PLU\\\\_sdQYzUj2keVENTP0a5rdykRSgg9Wp-](https://www.youtube.com/playlist?list=PLU_sdQYzUj2keVENTP0a5rdykRSgg9Wp-)\\n* Tushar Roy - [https://www.youtube.com/user/tusharroy2525/playlists](https://www.youtube.com/user/tusharroy2525/playlists)\\n* mycodeschool - [https://www.youtube.com/user/mycodeschool/playlists](https://www.youtube.com/user/mycodeschool/playlists)\\n* Tech Dummies - [https://www.youtube.com/channel/UCn1XnDWhsLS5URXTi5wtFTA/playlists](https://www.youtube.com/channel/UCn1XnDWhsLS5URXTi5wtFTA/playlists)\\n* CS Dojo [https://www.youtube.com/channel/UCxX9wt5FWQUAAz4UrysqK9A/playlists](https://www.youtube.com/channel/UCxX9wt5FWQUAAz4UrysqK9A/playlists)\\n* Jeff Dean's talk at Stanford: [www.youtube.com/watch?v=modXC5IWTJI](http://www.youtube.com/watch?v=modXC5IWTJI)\\n* Building Billion user Load Balancer at Facebook: [www.youtube.com/watch?v=bxhYNfFeVF4](http://www.youtube.com/watch?v=bxhYNfFeVF4)\\n* Netflix Guide to Microservices: [www.youtube.com/watch?v=CZ3wIuvmHeM](http://www.youtube.com/watch?v=CZ3wIuvmHeM)\\n* Amazon DynamoDB deep dive: [www.youtube.com/watch?v=HaEPXoXVf2k](http://www.youtube.com/watch?v=HaEPXoXVf2k)\\n* [Abdul Bari\\u2019s Youtube Channel](https://www.youtube.com/channel/UCZCFT11CWBi3MHNlGf019nw)\\n* Derek Banas tutorials [https://www.youtube.com/user/derekbanas](https://www.youtube.com/user/derekbanas)\\n\\nIntro to CS\\n\\n* [https://github.com/ossu/computer-science](https://github.com/ossu/computer-science)\\n* [https://github.com/ForrestKnight/open-source-cs](https://github.com/ForrestKnight/open-source-cs)\\n* [https://upskillcourses.com/courses/essential-web-developer-course](https://upskillcourses.com/courses/essential-web-developer-course)\\n\\nedit------\\n\\nadded some of the links/resources people commented. Put youtube channels at the bottom.\"", "title": "Master list of Free Resources", "upvote_ratio": 0.99, "url": "https://www.reddit.com/r/cscareerquestions/comments/e4v755/master_list_of_free_resources/"}, {"author": "The_True_Zephos", "created_utc": 1683063089.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 363, "post_id": "1360yie", "score": 2530, "subreddit": "cscareerquestions", "text": "\"Been in negotiations with a company that is semi local. A little more than an hour away.\\n\\nThey wanted me in office 3 days a week, despite having many people fully remote already.\\n\\nI said I would do one day per week, tops, and only if it's flexible.\\n\\nHappy to say they caved and I will be considering an offer shortly.\\n\\nIf we all don't give in to RTO they won't have a choice but to offer WFH. I know not everyone will feel the same but hopefully this encourages others to keep the gains we have made.\\n\\nUPDATE:\\n\\nThe company ended up hiring someone with a couple more YOE for less than what I was asking (same as I make now) but fully remote.\\n\\nThis market sucks. But a win for WFH at least? Turns out their RTO policy is just for locals, which is fucking stupid.\"", "title": "I stuck to my guns on WFH.", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/cscareerquestions/comments/1360yie/i_stuck_to_my_guns_on_wfh/"}, {"author": "minimaxir", "created_utc": 1546291690.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 134, "post_id": "abbgcv", "score": 2509, "subreddit": "cscareerquestions", "text": "\"Since another thread today was talking about certain trends in post titles, I figured it might be funny to train an AI on it (using [textgenrnn](https://github.com/minimaxir/textgenrnn)) and the results are pretty indicative of the subreddit.\\n\\nSome highlights:\\n\\n>How to go from senior devs that feeling like I'm the only way to do Our industry?  \\n>  \\n>Should I leave a CS graduate?  \\n>  \\n>Got the last mob job due to interviews?  \\n>  \\n>What is a reputation in an interview?  \\n>  \\n>Is it worth it to get a CS job?  \\n>  \\n>Does anybody have any experience with the job search?  \\n>  \\n>Does anyone else feel like a masters. What do I do?  \\n>  \\n>Is it worth it to get a job as a developer?  \\n>  \\n>I'm looking at a big company  \\n>  \\n>What makes a good manager salary bump in college?  \\n>  \\n>Best place to work in Career Fairs (Americans)  \\n>  \\n>Is it worth applying to many online coding challenges?  \\n>  \\n>Is it worth it to get a software job out of college?  \\n>  \\n>Is it worth taking a job in the field?  \\n>  \\n>PSA: I got a CS bachelors in CS and lack of job applications.  \\n>  \\n>Undergrad application process and I believe you enjoy it?  \\n>  \\n>I am a self-taught developer at big Income.  \\n>  \\n>Recruiter was just getting internships as a CS major?  \\n>  \\n>Graduating in December, American Salary  \\n>  \\n>Too early to be a software engineer?  \\n>  \\n>How do you deal with a day to day basis?  \\n>  \\n>Does anyone have any experience in the US?  \\n>  \\n>Just got a job offer after a company with a hackathon?  \\n>  \\n>Programmers who don't want to be a software engineer?  \\n>  \\n>First job out of college, and I have a bad boss... what can I do to get a job in the field?  \\n>  \\n>Can I apply for Full Time Jobs?  \\n>  \\n>Just got a raise before starting a new job?  \\n>  \\n>What\\u2019s the best way to land a job in a nightmare\\n\\nMore unused generated titles in this [5k title dump](https://pastebin.com/QBQTtqMx). (EDIT: [bonus 5k titles](https://pastebin.com/MSWkr8mv)!)\\n\\nGood ones from the dumps:\\n\\n>How should I properly struggle?  \\n>  \\n>Should I quit my job to have a chance to give up  \\n>  \\n>Is it normal to not be doing anyone else?  \\n>  \\n>Does anyone fall in the future.  \\n>  \\n>Computer science vs ethical path?\"", "title": "I trained an AI to generate /r/cscareerquestions post titles, and it said \"I am a self-taught developer at big Income.\"", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/cscareerquestions/comments/abbgcv/i_trained_an_ai_to_generate_rcscareerquestions/"}, {"author": "largic", "created_utc": 1657764332.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 260, "post_id": "vykch4", "score": 2485, "subreddit": "cscareerquestions", "text": "\"Been working remote for 2 years, and had my first day in office.\\n\\nI couldn't find parking so was late, then got lost trying to find my desk.\\n\\nFinished my work in about 2 hours, so spent the rest of the day trying to find something to do/pretend to work. \\n\\nRealized bathrooms were very busy and very open, making it hard to pee.\\n\\nStarted to feel like shit the last 2 hours, got home and tested positive for covid. \\n\\nNow I never want to go in office again.\"", "title": "my first day in office", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/cscareerquestions/comments/vykch4/my_first_day_in_office/"}, {"author": "pseudocoder", "created_utc": 1608679068.0, "link_flair_template_id": "0968d7a4-1232-11e5-a323-0e1422b8b60b", "link_flair_text": "Experienced", "num_comments": 395, "post_id": "kign0f", "score": 2462, "subreddit": "cscareerquestions", "text": "\"I've been in the \\\"back room HR discussions\\\" about which employees should vs. should not get promoted. I've seen what really gets the attention of senior leaders and what doesn't, etc.\\n\\nI see my friends, colleagues, and team members usually trying all the wrong things to get promoted. So I decided to put all of my experience (and wisdom?) together for folks to read.\\n\\nWhat info would be most helpful for you? I'll share the link here when I'm finished, likely by the end of January.\\n\\nP.S. - I'm a CS grad. I started as a Software Engineer and then gradually transitioned to HR. Weird, I know. We'll save that for another post.\\n\\n\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\n\\nEDIT: The guide is ready!\\n\\n[Here's the 38-page PDF.](https://www.dropbox.com/s/e2og9e9an7sler2/The%20Essential%20Guide%20to%20Getting%20Promoted%20at%20Work%20v1.pdf?dl=0) It's hosted on Dropbox, no login needed.\\n\\nI hope it's helpful!\\n\\nI'm making it available for free on reddit for one week. After that, it'll be a paid download available on Gumroad. Get it now!\\n\\n\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\"", "title": "I've worked in HR for ~15 years, and I've managed teams for 10 years. As a covid side project, I'm going to create \"The Essential Guide to Getting Promoted at Work\" that I'll be happy to share here for free. What questions or challenges do you have? What can I include that you'd find helpful?", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/cscareerquestions/comments/kign0f/ive_worked_in_hr_for_15_years_and_ive_managed/"}, {"author": "reluctantclinton", "created_utc": 1637069360.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 252, "post_id": "qv7shz", "score": 2420, "subreddit": "cscareerquestions", "text": "\"Hey everyone!  In my [last post](https://old.reddit.com/r/cscareerquestions/comments/oz52ww/just_got_fired_what_to_do_next/) I had been fired for a very minor company policy infraction at a larger company.  As an update, I found another job pretty quickly with a small company, but that turned out to be kind of a nightmare.  It motivated me to hit the books and study hard for another round of interviews, which helped me land a great new gig!  I went from making $110k TC at the company that fired me to $205k TC at my new gig!  And it's all remote, so I don't have to move!  It's been a sucky few months, but everything worked out in the end.  So if you ever find yourself like me and get fired unexpectedly in the future, hopefully you can take inspiration from my story!\"", "title": "UPDATE: Just got fired. What to do next?", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/cscareerquestions/comments/qv7shz/update_just_got_fired_what_to_do_next/"}, {"author": "JaseLZS", "created_utc": 1668167390.0, "link_flair_template_id": "0968d7a4-1232-11e5-a323-0e1422b8b60b", "link_flair_text": "Experienced", "num_comments": 568, "post_id": "ys86ns", "score": 2414, "subreddit": "cscareerquestions", "text": "\"Here are some things you may need to learn/understand as a CRUD app dev.\\n\\n1. Programming Languages  \\n(Java, C#, Python, JavaScript, etc.) It is normal to know two languages, being expert in one and average-ish in another.\\n\\n\\n2. Design Patterns  \\nBeing able to read/write design patterns will make your life so much easier.\\n\\n\\n2. Web Frameworks  \\n(Springboot, ASP.Net Core, NodeJS) Be good with at least one of them.\\n\\n\\n3. CI/CD Tools  \\n(CircleCI, Jenkins, Atlassian Bamboo) You don\\u2019t have to be an expert, but knowing how to use them will make you very valuable.\\n\\n\\n4. Build Tools  \\n(Maven, MSBuild, NPM) This is similar to CI/CD, knowing how to correctly compile your programs and managing its dependencies is actually somewhat hard.\\n\\n\\n5. Database  \\n(SQL Server, MongoDB, PostgreSQL)  \\nBeing able to optimise SQL scripts, create well designed schemas. Persistent storage is the foundation of any web app, if it\\u2019s wobbly your codebase will be even more wobblier.\\n\\n\\n6. Networks Knowledge  \\nUnderstanding how basic networking works will help you to know how to deploy stuff. Know how TCP/IP works.\\n\\n\\n7. Cloud Computing  \\n(AWS, Azure, GCP) A lot of stuff are actually deployed in the cloud. If you want to be able to hotfix/debug a production issue. Know how it works.\\n\\n\\n8. Reading Code  \\nThe majority of your time on the job will be reading/understanding/debugging code. Writing code is the easiest part of the job. The hard part is trying debug issues in prod but no one bothered to add logging statements in the codebase.\\n\\nObviously you don\\u2019t need to understand everything, but try to. Also working in this field is very rewarding so don\\u2019t get scared off.\\n\\nEdit: I was hoping this post to have the effect of \\u201cHey, it\\u2019s ok you\\u2019re struggling because this stuff is hard.\\u201d But some people seem to interpret it as \\u201cGatekeeping\\u201d, this is not the point of this post.\"", "title": "Being a Software Engineer is extremely hard", "upvote_ratio": 0.91, "url": "https://www.reddit.com/r/cscareerquestions/comments/ys86ns/being_a_software_engineer_is_extremely_hard/"}, {"author": "marma_canna", "created_utc": 1598457088.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 223, "post_id": "ih1coi", "score": 2405, "subreddit": "cscareerquestions", "text": "\"I've been working in kitchens my whole life. I was expelled and dropped out of 4 high schools. I had a 9th grade education until I was 25. I've been in college(didn't finish, gotta work) or self-studying ever since. I turn 30 in January...\\n\\nI just got a job as a Computer Technician.\\n\\nI'm not a Software Developer yet...\\n\\nBut I finally got out of the kitchen.\\n\\nNo more asking to use the bathroom. No more being on the political whim of opinionated and equally uneducated managers. No more grown ass men (or young assholes) making inappropriate comments about underage coworkers, race, politics, or drugs; I'm an internet edgeboi, but even I know when to stfu and focus on my work. No more 135\\u00b0F(57\\u00b0C) kitchen with face masks. No more \\\"broken\\\" air conditioning that corporate can't \\\"fix\\\" or \\\"turn on remotely\\\".\\n\\nI get to swap RAM, flash BIOS, and do general stuff a pc user with a sliver of curiosity could find out...\\n\\nBut I'm out of the kitchen.\\n\\nI'm touching computers for a living. That's all I can ask for right now.\\n\\nrants over...go code something!\"", "title": "I finally got out of the kitchen.", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/cscareerquestions/comments/ih1coi/i_finally_got_out_of_the_kitchen/"}, {"author": "None", "created_utc": 1567820627.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 391, "post_id": "d0pxx5", "score": 2382, "subreddit": "cscareerquestions", "text": "\"Probably a big yes from many of you and probably a dumb question, but I'm honestly not that familiar with it. I've just started getting some connections with people at the internship I was at. I've also gotten random people adding me.\\n\\nWhat's up with this site? Why did someone I don't know congratulate me on a job update from like 3 months ago?\\n\\nThen there's the generic post from a recruiter or something with a story about how the worker is all that matters, effectively pandering to everyone.\\n\\nSomeone made a post saying \\\"Thanks guys, I've just reached 5000 followers\\\" or something like that.\\n\\nThen there's the posts of \\\"X years ago I failed my whatever exam, now I'm Google\\\"\\n\\nAnd to top it off, normal ass people I knew at my internship are liking posts like this. Why do people actually care? Do I have to partake in this shit to move up? Am I the one missing out?\"", "title": "Is anyone else weirded out by Linkedin culture?", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/cscareerquestions/comments/d0pxx5/is_anyone_else_weirded_out_by_linkedin_culture/"}, {"author": "wwww4all", "created_utc": 1680472349.0, "link_flair_template_id": "1ae775c6-1232-11e5-bc2c-0e9aedb4175b", "link_flair_text": "Meta", "num_comments": 246, "post_id": "129zj0s", "score": 2387, "subreddit": "cscareerquestions", "text": "\"Always take regular PTO time.  Try to \\\"maximize\\\" PTO time in \\\"unlimited\\\" PTO company.\\n\\nMost \\\"unlimited\\\" PTO companies are OK with 4 - 6 weeks of PTO.  Some companies will allow more.  Try to take as much time off as possible.\\n\\nTaking PTO time WILL NOT affect performance.  If you are high performer, you deserve time off to relax.  If you are low performer, there are bigger issues, PTO time will not affect low performance.\\n\\nGo do something interesting and fun.  If not, just sit in a dark room for a week.  Whatever you do, ALWAYS take regular PTO time.\"", "title": "Always take PTO, ESPECIALLY if you have \"unlimited\" PTO.", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/cscareerquestions/comments/129zj0s/always_take_pto_especially_if_you_have_unlimited/"}, {"author": "TreeSkyDirt", "created_utc": 1668894106.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 853, "post_id": "yzmwxt", "score": 2358, "subreddit": "cscareerquestions", "text": "\"Twitter right now is down to 260 employees down from 7,500. \\n\\nIF Elon succeeds in running Twitter, turning it profitable and growing it\\u2026 this could mean very bad news as other companies will clearly see how much bloat there is in tech. There is probably some SVP somewhere thinking about this. What were the other 7000+ employees actually doing to increase the value and revenue of the company? Do you really think Google needs 150,000 employees? Or Meta needing all of their 70k+ employees?  \\n\\nWhat do you guys think! Do you think this is of concern?\"", "title": "Hot take: If Elon succeeds in running Twitter, it could mean very bad news for more layoffs in other companies", "upvote_ratio": 0.85, "url": "https://www.reddit.com/r/cscareerquestions/comments/yzmwxt/hot_take_if_elon_succeeds_in_running_twitter_it/"}, {"author": "Amazing-Put5299", "created_utc": 1695600514.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 907, "post_id": "16rd4b8", "score": 2356, "subreddit": "cscareerquestions", "text": "\"I feel like some people on Reddit don\\u2019t understand getting a 60-75k/year salary job straight out of college is great in most places in America. Obviously big tech pays better but CS is still in demand and offers better jobs than most fields. The doomer posts are unserious.\"", "title": "60k/year straight out of college is great", "upvote_ratio": 0.88, "url": "https://www.reddit.com/r/cscareerquestions/comments/16rd4b8/60kyear_straight_out_of_college_is_great/"}, {"author": "None", "created_utc": 1545922191.0, "link_flair_template_id": "05438160-1232-11e5-b573-0e1422b8b60b", "link_flair_text": "New Grad", "num_comments": 522, "post_id": "a9zsq2", "score": 2349, "subreddit": "cscareerquestions", "text": "\"I\\u2019ve been reading all this job advice from people on this subreddit. Don\\u2019t work at x company for y length...it will kill your resume/reputation or what not. I go on their comment history and low behold they are still taking classes in college and/or they just graduated. Why would you give advice? It\\u2019s so toxic. Like for the love of god can you stop? It doesn\\u2019t help anyone. Sorry for the shitpost/rant, but it\\u2019s caused me a lot of distress and I was stupid enough to turn down some offers/interviews as well because of these guys. I got a job now, but it\\u2019s like come on guys why. I\\u2019m basically done with this subreddit.\\n\\nedit: so I wasn't expecting this much of a response...So I decided to respond myself.\\n\\nTo people saying I was an idiot rejecting offers based on what I read here. You guys are 100% right!!!! I was so fucking stupid, trust me my parents let me know too. Also, I have a job now so I mean luckily it worked out for me in the end. Others might not be so lucky, but that is on them.\\n\\nI thought of a fix from a previous forum I used to use called Arenajunkies(RIP). It was a forum where certain subsections of it only junkies(gladiators in WoW top 1% pvpers of the current season or was it 2400 + current season and rank 1s were allowed to post)! Now you might say meadow that's a game we can't do that here and I say you are right...We can do the next best thing we can have an email confirmation of your workplace and for students their school email(make sure its a work email, not gmail/hotmail/aol...etc) and only those with confirmed work will be allowed to post in certain tags and have flairs (much like team blind/arenajunkies). I.E. Someone puts a flair on a post that says \\\"Senior\\\" only seniors are allowed to respond.\\n\\nTo the people that say new grads have a lot of good advice/sage knowledge about the recruiting process...Well you didn't read my post it was about job advice not the recruiting process although I guess its similar. Either way I looked up half of you and the majority of you were new grads/students go figure.\\n\\nEither way I wish you guys all good luck and happy holidays. I don't expect to posting much here anymore.\"", "title": "As a new grad and students please don’t give job advice it’s so toxic", "upvote_ratio": 0.93, "url": "https://www.reddit.com/r/cscareerquestions/comments/a9zsq2/as_a_new_grad_and_students_please_dont_give_job/"}, {"author": "throwaway982908", "created_utc": 1540587696.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 202, "post_id": "9rolfi", "score": 2350, "subreddit": "cscareerquestions", "text": "\"This is not meant to be a racist post. I am indian-american myself.\\n\\n&#x200B;\\n\\nI am searching for my first job or another internship. I ended up going to an indian buffet with my girlfriend for lunch. I went to a buffet and it was loaded. Naturally the majority of the individuals there were Indians, and they had their badges of the companies they represented. Paypal, HP, Apple, Amazon, McAffe, you name it , it was there. \\n\\nI took my chances in the buffet line looked at the badges and said oh hey you work for so and so, thats my dream company how do you like it there. I ended up walking out with 3 business cards with people willing to give me a referral.\\n\\n&#x200B;\\n\\nSomething different, but best 13 bucks I spent for lunch \"", "title": "Using an Indian buffet as a networking event", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/cscareerquestions/comments/9rolfi/using_an_indian_buffet_as_a_networking_event/"}, {"author": "nyctechofferz", "created_utc": 1611783096.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 505, "post_id": "l6evby", "score": 2343, "subreddit": "cscareerquestions", "text": "\"Hey all - just accepted an amazing offer with a great company and I wanted to share my interviewing experience over the course of the last two months! This post is to serve as a recap for me, and a source of information for you all who are in similar spots. And as always...a little bit of a humblebrag. I'm happy to answer any questions for anybody who has them.  \\n\\nMy first job out of school was for 77k, my second job was 140k -> 165k after a promotion, and my third job is over 300k now.\\n\\nHere are my interview stats from this interview run. Each step marks where the process ended for me, either by being denied or by ending the process myself.\\n\\n**Offers:** \\n\\n1. Microsoft\\n2. Bay Area Tech Startup \\n3. Capital One\\n\\n**On-sites:** \\n\\n1. Amazon (cancelled due to offer)\\n2. Google (cancelled due to offer)\\n3. Spotify (cancelled due to offer)\\n4. Attentive (denied)\\n\\n**Tech Phone Round/Take-home Round:** \\n\\n1. Hudson River Trading\\n2. Robinhood\\n3. Oscar Health\\n4. Capsule\\n5. Audible\\n6. Datadog\\n7. LinkedIn\\n8. Peloton \\n\\n**Recruiter Phone Screen Round:** \\n\\n1. Roblox\\n2. Blend\\n3. Palantir\\n4. Candid\\n\\n**No Interview After Cold Apply/Referral:** 34 companies including Uber/Lyft/FB/Twitter  \\n\\nAnd of the above, below are the companies I got referrals to versus the companies I got in through a recruiter (they reached out to me/I reached out to them)\\n\\n**Referrals:** Facebook, Microsoft, Linkedin, Twitter, Peloton, Spotify\\n\\n**In Through Recruiter:** Google, Amazon, Palantir, Candid, Capital One, Attentive, Instacart, Audible, Datadog\\n\\n***Offer Details:***\\n\\nI accepted an offer from one of the companies I got an offer from. My base is 170k, stock is 150k yearly. \\n\\n***Key Things Learned***:\\n\\n1. No matter who you are, it's a numbers game at the end of the day. Don't take things personally, and do as many interviews as you possibly can \\n2. Network, network, network. I kept a list of former teammates and companies they left for, people I've met online through various forums who work at big companies, IRL friends who work at big companies, etc etc. And when I went to interview, I hit all of them up and asked for a referral. It was a crucial part of the process\\n3. Time your process well. I interviewed with a bunch of \\\"sub-tier\\\" companies to get real world practice after I was done with Leetcode/mock interviews/other practice. I had my Capital One and Attentive onsites before any important ones, and they were crucial in my later onsites. Case in point, I failed my first onsite (Attentive) but passed my next 3 \\n4. For practicing Leetcode, quality > quantity. I did about 70 Leetcodes spread across graphs, trees, dynamic programming, string puzzles, array puzzles, linked lists, LRU cache/binary search/hash map from arrays type questions, etc. If you can't pick up on the general patterns by then, you should work on your approach and question quality\\n5. Work on your resume. Go on resume review sites and pay for reviews. Post every week in this subreddit. It's important\\n6. Know your language. Practice/document all syntax things you will need to do all types of questions. Don't let this be the thing that fails you \\n6. Document all of your Leetcode studying/DS Algo studying/behavorial answer prep in Google drive or something.  Here are my documents:\\n\\nLeetcode: https://filebin.net/nm5uujkzm98nnnia/Leetcode_Question_Categories_and_Approaches_2020.pdf?t=58w84x0r\\n\\nMy General Interviewing Notes:\\nhttps://filebin.net/riz9aw0wpk7xfv7j/2021_All_In_One.pdf?t=fmlz26uh\\n\\nAll My DS Notes/Algo Notes:\\nhttps://filebin.net/ev3xloctvaimslq4/Algos_and_DS___Other_Notes.pdf?t=hosd02ma\\n\\nI highly recommend making stuff like this yourself. It is super helpful in staying organized, keeping stuff fresh and committed to your mind, and it will always be there next time you interview :) \\n\\nLet me know if anybody has career questions, I'd love to help out\"", "title": "Software Engineer 3 Years of Experience - My Path to from 77k TC to 300k+ (70 LC)", "upvote_ratio": 0.93, "url": "https://www.reddit.com/r/cscareerquestions/comments/l6evby/software_engineer_3_years_of_experience_my_path/"}, {"author": "jsjs2626", "created_utc": 1574206118.0, "link_flair_template_id": "05438160-1232-11e5-b573-0e1422b8b60b", "link_flair_text": "New Grad", "num_comments": 618, "post_id": "dysvud", "score": 2327, "subreddit": "cscareerquestions", "text": "\"I am currently at my first job as a software engineer, right out of college. It is one of those two-year rotational programs. I was given the opportunity to apply to this Fortune 500 company through a recruiter, who then invited me to a Woman's Superday they were having. I passed and was given an offer. \\n\\nA few months later, the company asked me and everyone else in my program to fill out a skills and interests survey so that they can match us up with teams. I was put on a team whose technology I had never used nor indicated an interest in. That is fine, and I am learning a lot. However, in a conversation I had with my manager's manager a few months into the job, he told me that I was picked for my team because I was a woman and they had not had one on their team before.\\n\\nFinally, yesterday I was at a town hall and there was a question and answer session at the end. At the end, the speaker asked if no women had any questions, because I guess he wanted a question from a woman!\\n\\nI am getting kind of frustrated at the feeling of only being wanted for my gender. I don't feel \\\"imposter syndrome\\\" - I am getting along great with my team and putting out good work for my experience. I think I am just annoyed with the amount of attention being placed on something I can't change. I wish I was invited to apply based on my developing ability, placed on my team because of my skillset and interests, asked for input because they wanted MY input, not a woman's.\\n\\nDoes anyone relate to what I am saying or am I just complaining to complain? I don't really know how to deal with this. Thanks for reading.\\n\\nEdit: I am super shocked at the amount of replies and conversations this post has sparked. I have read thorough most of them and a lot were super helpful. I\\u2019m feeling a lot better about being a woman in technology. Also thanks for the gold :)\"", "title": "Frustrated as a woman", "upvote_ratio": 0.9, "url": "https://www.reddit.com/r/cscareerquestions/comments/dysvud/frustrated_as_a_woman/"}, {"author": "thereisnosuch", "created_utc": 1592668429.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 857, "post_id": "hcojjv", "score": 2326, "subreddit": "cscareerquestions", "text": "\"As a minority/POC, it does not affect me at all with the words \\\"master\\\" or \\\"slave\\\". \\n\\nTo me what helps to solve racism is to show transparency with their process/company. \\n\\nFor example, publish the salary differences of the \\\"Same Position\\\" of different races. Heck, publish everyone's salaries. i am tired of finding out my coworker of a different race gets paid more than me for the same work. Like I can understand like 10% difference but not more than 35%. Anecdotally i have heard this from several POCs but I can never know for sure until the companies provide the info. \\n\\nOr one action is to completely anonymize the resumes and applications. I personally have tested one of the popular studies where \\\"latino names\\\" gets fewer callbacks than \\\"white names\\\" and I was so surprised that it worked for myself too. Heck even my university completely anonymize my assignments and exams in order to prevent bias from grading. Why can't we do the same in jobs. \\n\\nSorry i just wanted to rant. I am just tired of companies getting praised for \\\"linguistic changes\\\" and not calling them out for not doing actual company changes. I apologize if this is going against the rules but I just wanted to share my thoughts as a POC.\\n\\nEDIT: Wow this blew up. I am so glad that we are having this discussion. \\n\\nJust wanted to add some following points. \\n\\nWhen i said that I am not bothered by the words \\\"Slave or master\\\" I do not mean that all POCs don't mind that. This was just a personal rant. I do not want to define what POCs want. \\n\\nAnd yes removing the slave or master is great and I am not particulary against it to be honest I am pretty indifferent to it. What I am specifically against that people will claim that these linguistic changes WILL LEAD to change. \\n\\nIn my opinion, this will stop further changes because the corporations will think that they have done enough because the public opinion is happy about it. That is where I am frustrated on.\"", "title": "As a minority/POC, I am tired of seeing \"woke\" changes by corporations but not actual changes to fight against racism.", "upvote_ratio": 0.93, "url": "https://www.reddit.com/r/cscareerquestions/comments/hcojjv/as_a_minoritypoc_i_am_tired_of_seeing_woke/"}, {"author": "Greedy_Craft", "created_utc": 1654552675.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 808, "post_id": "v6etf0", "score": 2313, "subreddit": "cscareerquestions", "text": "\"I currently work at a fortune 500 company. I got a job offer at a company much better than the one i'm at now. I despise my manager, he's a complete asshole. We've had such high attrition on my team that i'm literally the only one left from when I started 1.5 years ago. \\n\\nMy next job starts in 3 months (asked for some time off between jobs). I would like to bridge that gap while still getting paid. Like literally do nothing, no work, stop attending meetings etc. Maybe go vacation somewhere in Europe. Then when the start date for my next job comes around, if I somehow haven't been fired by then i'll quit. Does this sound feasible?\"", "title": "How long can you realistically fuck around and not do anything at a job before they fire you?", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/cscareerquestions/comments/v6etf0/how_long_can_you_realistically_fuck_around_and/"}, {"author": "govna389", "created_utc": 1598220167.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 365, "post_id": "ifcc9e", "score": 2305, "subreddit": "cscareerquestions", "text": "\"Title.\\n\\nIf I'm being honest, I got into CS because I do enjoy working with technology. However, I wouldn't exactly say it's something I'm passionate about.\\n\\nFor me, it was just a way to get a typical 8 hour office job that offers good work life balance and little stress. \\n\\nIf I HAD to work in some field, CS would be it. But I wouldn't (and don't) do it in my spare time. I have other hobbies.\\n\\nIs there anyone else like that here? Just works a super chill 8 hours per day and then forgets about work / CS / programming? someone who doesn't grind leetcode or do projects in their spare time?\"", "title": "Is there anyone else who just works 8 hours a day, and doesn't do any leetcode or projects in their spare time?", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/cscareerquestions/comments/ifcc9e/is_there_anyone_else_who_just_works_8_hours_a_day/"}, {"author": "roadrunnerNM", "created_utc": 1607046788.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 387, "post_id": "k6b8nw", "score": 2281, "subreddit": "cscareerquestions", "text": "\"Just went through it with Facebook. Did 100+ hours of prep. Tech problems at the start -- couldn't hear the interviewer at all. Got that sorted, but under interview pressure my wits and even my typing skills deserted me. :P\\n\\nGot a nice email from the recruiter telling me not to be discouraged, and I can apply again in a year. Hey, I'm 55 -- I was surprised when she messaged me on LinkedIn. Surely I'm too old for Facebook. Probably fulfilled a quota to show they don't discriminate based on age. :D\\n\\nI have to say it *is* discouraging to see the DS&A coding interview defended by people saying \\\"it's to see if you're smart enough.\\\" Dude, I have a PhD in mathematics and 9 years of experience as a developer. Anyway, I have no real point to make except that I know I'm not the only one whose been through this, but it does feel kind of bad and I can't help doubting myself at least a little. And I actually love data structures and algorithms -- because it's all really mathematics!\"", "title": "Ouch. Failing a tech screen is painful.", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/cscareerquestions/comments/k6b8nw/ouch_failing_a_tech_screen_is_painful/"}]