[{"author": "Adventurous_Let6435", "created_utc": 1709656840.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 4, "post_id": "1b79s5k", "score": 2, "subreddit": "EngineeringCareers", "text": "\"Hi - I graduated college in 2022 with degrees in Finance and Business Analytics and a minor in Mathematics (so have gotten through diffeq, linear algebra, multivariable, among others), and took intro Physics I my junior year when I was considering the change in college. May not be relevant, but I also received a 5 on the AP Physics 1 exam and 4 on the AP Physics 2 exams in HS. I have been working in finance since and hate it, and have always had this idea in the back of my mind. My sister is an engineer and have lots of friends from HS who have gone on to do so, as well.\\n\\nAny advice would be appreciated on making the switch without having to go back and complete a full UG degree in engineering. I know BU offers a LEAP program for non-engineering majors to get into the field ([https://www.bu.edu/eng/admissions/graduate/leap/](https://www.bu.edu/eng/admissions/graduate/leap/)). Was wondering if anyone had any similar experiences here or other ways to get into the field (hopefully with a master's degree). I am willing to take on the cost, but obviously don't want to pay double if not needed.\"", "title": "Changing Careers from Business into Engineering", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/1b79s5k/changing_careers_from_business_into_engineering/"}, {"author": "determinator94", "created_utc": 1707314668.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 1, "post_id": "1al3nnc", "score": 1, "subreddit": "EngineeringCareers", "text": "\"Context is this - 2021, I finish university in electrical engineering with an emphasis in DSP (originally electronics which I thought was cooler). Almost immediately, thanks to a connection I met at a job fair in my last semester, I interviewed with the company he worked at\\u2026 same day I got a job offer and started that summer. I further cultivated the growth mindset I had in university - that STEM, despite being categorized by different fields, is broadly interconnected. All those electives I didn\\u2019t need to take after fulfilling my requirements built towards my skillset. I furthered it during my time there by using my $$ on FPGAs (I\\u2019ve got a whole collection of them) and Udemy courses to further my skillset, and I dipped my toes into design, testing and environmental stress testing\\u2026\\n\\nThen after 2 years of loyalty, the company was hit with an acquisition and a lot of us including me were laid off in waves. Immediately after I hopped onto the application of other jobs - from a dozen to a few dozen to several dozen a day. First few months I applied and interviewed and got nothing, I was still patient and hopeful. But fast forward to now where I\\u2019m financially bone dry and forced to give up being independent and nothing\\u2019s still panned out\\u2026 I\\u2019m honestly considering just giving up. I\\u2019ve not used my engineering skills in 7 months in any way that matters or counts (ie: professional experience) because I keep getting told I don\\u2019t have enough experience. Like\\u2026 yeah cause I\\u2019m being denied any opportunities. I\\u2019ve even applied for internships and technician roles.\\n\\nI don\\u2019t have time to just wait around. It\\u2019s either I land an engineering job soon or just find something else to get into professionally. Seriously even in an interview, I can converse and show appreciation for the interviewers even taking time outta their busy days to even talk to me, but even that doesn\\u2019t land me a role. \\n\\nThoughts guys?\"", "title": "I’m honestly considering ending my electrical engineering career I don’t think I can even continue it", "upvote_ratio": 0.67, "url": "https://www.reddit.com/r/EngineeringCareers/comments/1al3nnc/im_honestly_considering_ending_my_electrical/"}, {"author": "de2cios", "created_utc": 1705545553.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 1, "post_id": "199fcr1", "score": 4, "subreddit": "EngineeringCareers", "text": "\"Since I\\u2019m majoring in CE, I keep worrying that these internship opportunities only want software engineers or electrical engineers, not seeing much for CE or are companies also looking for CE? Just want to know as I keep stressing out about it!\"", "title": "Computer Engineer here, nervous about the lack of space compared to electrical/software engineers", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/199fcr1/computer_engineer_here_nervous_about_the_lack_of/"}, {"author": "Objective-Buy-9005", "created_utc": 1705010110.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 3, "post_id": "194docq", "score": 1, "subreddit": "EngineeringCareers", "text": "\"Okay so I am a biomedical engineer and I just got by bachelor degree. Rigth now the market is horrible, but I think that I could manage to find a job in the hospital for project management which is the most boring thing ever. \\nI have done a one year specialization in robotics, which I absolutely love, but I don\\u2019t have enough skills to actually get hired no where unfortunately. I have graduated it\\u2019s been a month, I took some vacation and now I am on job search. Also, let\\u2019s keep in mind I will be starting my masters degree in automation engineering this may. So my question here is, should I take like two weeks to do some online courses to boost my profile and wait till I get a robotics job? Or simply settle for the hospital job till my masters start? I feel like even if I will be making money with that option, I won\\u2019t learn anything, and it\\u2019s horrible. But, if I do the other option I am loosing time which I am not getting paid for. \\n\\nI am really lost. Just got out of a breakup too, so I really am not mentally okay to decide if I am being realistic or not. Please, guide me.\"", "title": "Help am I being stubborn?", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/194docq/help_am_i_being_stubborn/"}, {"author": "No_Reindeer9271", "created_utc": 1704998028.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 1, "post_id": "1948stc", "score": 1, "subreddit": "EngineeringCareers", "text": "\"I graduated college with a degree in aerospace engineering in May of 2023. I have been at my job for around 6 months now as a mechanical design engineer, in a small town very far away from home. I have learned I struggle to form innovative solutions and feel like I lack the basic knowledge to form these solutions. When I am in design meetings and everyone is contributing their ideas, I feel extreme anxiety and pressure to have an idea of my own, but nothing ever comes to mind, or if it does, I convince myself it's a dumb idea.\\n\\nI went into engineering because I love math and following a process. I don't think design engineering is the right fit for me, but I don't know what other kind of engineering job would be.\"", "title": "Feeling lost in my engineering career?", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/1948stc/feeling_lost_in_my_engineering_career/"}, {"author": "SportOne1470", "created_utc": 1704824926.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 0, "post_id": "192lnz0", "score": 2, "subreddit": "EngineeringCareers", "text": "\"\\nHello everyone, first time posting on reddit. My dad has been so lost in his desire to rejoining the engineering field, he has a degree in mechanical engineering and has many YOE in management and team member roles. My question is what can he do to \\u201crevamp\\u201d his skills into the present day field of engineering? Any resources or recommended skills that can be provide is much appreciated :). Also what technologies or software should he familiarize himself with?\\n\\nHave a nice day everyone!\"", "title": "Dad, Age 53, Previous Mechanical Engineer w/ 10+ YOE, what can be done to get back into the industry?", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/192lnz0/dad_age_53_previous_mechanical_engineer_w_10_yoe/"}, {"author": "Objective-Buy-9005", "created_utc": 1701922766.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 0, "post_id": "18cn93q", "score": 2, "subreddit": "EngineeringCareers", "text": "\"Hi guys! So I have a biomedical engineering undergrad from Polytechnique Montreal, and I would really like to work into robotics applied to biomedical applications. However, I don\\u2019t have alot of experience in programming/hardware stuff (I coded a bit on ROS\\\\C++, am really good with python\\\\MATLAB) I am graduating in a week, and am having huge ammount of depression because I realize how my degree is not as useful as I tougth, because all the positions in robotics compagny for biomedical tech. are hiring electrical/software engineers. I really want to start working in order to learn about becoming a better roboticist, but no compagny seems to hire somebody with my profile. Do you have any suggestions? Should I just give up job pursuing and go in a computer science\\\\electrical eng. masters? I really am lost about what to do about my future, I really wanted to work..\"", "title": "Biomedical Eng. wanting to specialize in robotics", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/18cn93q/biomedical_eng_wanting_to_specialize_in_robotics/"}, {"author": "Submarine_Steve", "created_utc": 1700919570.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 0, "post_id": "183jyoh", "score": 1, "subreddit": "EngineeringCareers", "text": "\"Has anyone here moved to Australia from the UK for work? I am considering my options as a recently graduated Mechanical Engineer. Can you outline your experience? Are there many engineering opportunities? What are the major industries in Australia for Mechanical Engineers?\\n\\nI have a NZ passport so I believe that I don't need to apply for a work visa, makes this rather enticing.\\n\\nCheers!\"", "title": "UK to Australia - Mechanical Engineering Opportunities", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/183jyoh/uk_to_australia_mechanical_engineering/"}, {"author": "Submarine_Steve", "created_utc": 1700826415.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 1, "post_id": "182qda7", "score": 1, "subreddit": "EngineeringCareers", "text": "\"Morning all,\\n\\nI am a Mechanical Engineer in the early stages of my career within Defence industry. I currently work with Marine applications, but I don't want this to be my whole career. I am keen to move into other areas of Defence throughout my career such as Aerospace stuff (e.g. missile design/jet fighter design) or even industries outside of Defence. I am wondering if this has been anyone else's experience? How much knowledge/experience was applicable to both areas? Did it take much 'extra-curricular' work to transition between different areas of the defence industry? I would love some information on whether this would be possible, how fluid this may be, and how I could get there.\\n\\nAny responses are much appreciated, thanks!\"", "title": "Career transition between different areas within Defence Industry", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/182qda7/career_transition_between_different_areas_within/"}, {"author": "heff-money", "created_utc": 1700407744.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 1, "post_id": "17yzkwt", "score": 1, "subreddit": "EngineeringCareers", "text": "\"So I (39M, mechanical engineering and math) am working as a quality technician at about $60k per year and have been doing so for a little over a year. I'm not really fond of it.\\n\\nMy career went like this: graduated in the naughts with a math degree. Joined the military. Got discarded by the military in a rough way. Ended up working as a security guard for about a decade while going to college again to pick up a mechanical engineering degree about a year and a half ago.\\n\\nAlong the way I completely sacrificed having a social life, and never even started dating. Having a family is out of the question at this point. So my life goals are simply to retire early. Ballpark, at about 50. If I can get one of those $80k engineering jobs, I could probably put about 3k per month in a mutual fund (spending half my life as a college student just got me used to living the impoverished lifestyle so I don't have hobbies either). So I'm mostly just looking for something to put up with for another decade and then ghost.\\n\\nThe catch is I'd need one of those engineering jobs. Can I even use my degrees? The way my time in the military went, it's almost a liability (I'm unemployable by all those defense companies), and rest of my resume doesn't have anything with technical experience either. So I see no reason employers aren't just going to go with fresh college graduates over me.\"", "title": "Which direction is my career even going?", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/17yzkwt/which_direction_is_my_career_even_going/"}, {"author": "Realistic_Ad4889", "created_utc": 1669956055.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 0, "post_id": "zabn41", "score": 3, "subreddit": "EngineeringCareers", "text": "\"Mechanical Engineer in Training in Canada, thinking of transitioning into new career path.\\n\\nI graduated as a high academic achiever, lots of extra curriculars and even won some competitions in school. Needless to say, with 2 years of EIT experience I am fit for engineering work.\\n\\nDuring my EIT jobs I moved away across the country for work, leaving behind family and friends. In each case I found myself doing CAD work, living in cities I didn't like and spending too much time buried in computers, not interacting with people.\\n\\nDoes anyone have any ideas for jobs besides engineering that entail math, problem solving, people skills, not being at a desk 95+% of the time? I've been considering business and forestry. Are there any design job that you get to move around more in? Perhaps a different industry. Would love any feedback chimed in.\\n\\n(P.s. let me know if my question is clear, I'm happy to add more to clarify)\"", "title": "Engineering Career Transition", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/zabn41/engineering_career_transition/"}, {"author": "gtd_rad", "created_utc": 1668815769.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 0, "post_id": "yyydt6", "score": 4, "subreddit": "EngineeringCareers", "text": "\"  have about 10 years of automotive engineering experience and am looking for other domains I can make a smooth but upward career transition. I've only ever heard of expert witness as a job in the medical industry, but not so much in the field of engineering.\\n\\nI'm also very baffled as to why there are so many large-scale engineering frauds these days (eg: Nikola motors and Theranos). Do these investors not hire professional engineers to do due diligence for them before vesting large amounts of money?\\n\\nDo any of the above roles have any career paths and if so, can anyone share their experience and overall pay?\"", "title": "Anyone here have a career as an engineering expert witness / investor due diligence?", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/yyydt6/anyone_here_have_a_career_as_an_engineering/"}, {"author": "Puzzleheaded-Pie-743", "created_utc": 1668817590.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 0, "post_id": "yyz09f", "score": 1, "subreddit": "EngineeringCareers", "text": "\"Curious on others options within cybersecurity. Would you rather be on the auditing/compliance side of things or cyber incidence response?\"", "title": "Cybersecurity auditing or response team", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/yyz09f/cybersecurity_auditing_or_response_team/"}, {"author": "pshermandory", "created_utc": 1667939127.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 4, "post_id": "ypxgj1", "score": 3, "subreddit": "EngineeringCareers", "text": "\"I (25 f) started a new job back in June, completely changed industries. \\nMy reasons for leaving was the role itself, my background is chemical engineering and I wasn't doing that.\\nI moved into a process engineering role at a factory however, currently hate it and want to leave. \\nI was told the role was very chemical engineering focused but, its not. The role itself works with data but, its not technical enough for me. Apart from data analysis, I've done two mass balances. \\n\\nI want to do something within process design that builds on the chemeng basics and I'm struggling to find roles out there that encompass this. I know, I'm not going to do this in this current role. \\n\\nI'm still in my probation period for my new job, there's a lot of interesting roles currently being advertised for Green/sustainable/energy engineering. These roles are advertising design work and pilot plant testing.\\n\\nHow soon is too soon to switch jobs?\"", "title": "Too soon to switch jobs?", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/ypxgj1/too_soon_to_switch_jobs/"}, {"author": "mental_pillness", "created_utc": 1664597498.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 5, "post_id": "xsloyz", "score": 3, "subreddit": "EngineeringCareers", "text": "\"\"", "title": "if anyone wants ravindra babu ravalu's gate cse course dm me", "upvote_ratio": 1.0, "url": "https://v.redd.it/5zh5859gd4r91"}, {"author": "Silver-Fullbuster", "created_utc": 1664324692.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 0, "post_id": "xpxg4t", "score": 2, "subreddit": "EngineeringCareers", "text": "\"Hi, I've just turned 22, live in London and I'm looking for engineering apprenticeships that have a decent/good pay. I'm looking more into the electrical aspects as I've completed my first year of university in engineering but things from my personal life has made me rethink whether a degree would be less of benefit compared to getting an apprenticeship. Much appreciated for any information.\"", "title": "Engineering apprenticeships", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/xpxg4t/engineering_apprenticeships/"}, {"author": "Various-Program-950", "created_utc": 1662477246.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 0, "post_id": "x7d4c4", "score": 1, "subreddit": "EngineeringCareers", "text": "\" I've tried googling but not had much luck!\\n\\nWondering which would match my skillset better and which job to apply for. Any help would be appreciated!\"", "title": "What's the difference between an Integration Engineer and a Product Support Engineer?", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/x7d4c4/whats_the_difference_between_an_integration/"}, {"author": "dookiesmall", "created_utc": 1660753516.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 4, "post_id": "wqtb9s", "score": 4, "subreddit": "EngineeringCareers", "text": "\"I\\u2019m not in any school program right now just want to know what it may be like.\"", "title": "Is there anyway to shadow possible engineering. Jobs to see what they’re like?", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/wqtb9s/is_there_anyway_to_shadow_possible_engineering/"}, {"author": "dookiesmall", "created_utc": 1660583671.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 0, "post_id": "wp55c0", "score": 3, "subreddit": "EngineeringCareers", "text": "\"For various areas, mechanical, electrical, software, etc?\"", "title": "What would you say the pay is like for an engineer in Canada right out of school, vs 5 years experience, and 10 years experience?", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/wp55c0/what_would_you_say_the_pay_is_like_for_an/"}, {"author": "AB232_", "created_utc": 1660297335.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 2, "post_id": "wmh4zf", "score": 1, "subreddit": "EngineeringCareers", "text": "\"So, I currently have my associates in mechanical engineering, and intend on furthering my education.\\nHere\\u2019s the thing, the only way I\\u2019ve paid for school thus far is by working at at fast food restaurant and would very much like to find a job that I actually feel suits my educational aspirations . Furthermore, since getting my associates this summer I have had a tough time finding \\u201cengineering\\u201d jobs that allow for an associates degree as an educational requirement. I would like to know if perhaps anyone could recommend a certain job title or something that would make my job hunt with my educational background easier. If you have any questions that can help answer easier, please ask away, I am tired of working at fast food \\ud83d\\ude02\\nP.S. I am currently actively applying to scholarships and as far as federal/state funded programs, I am not eligible.\"", "title": "Need help finding job with current educational background", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/wmh4zf/need_help_finding_job_with_current_educational/"}, {"author": "RollaToasterTycoon9", "created_utc": 1658973698.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 0, "post_id": "w9ww31", "score": 1, "subreddit": "EngineeringCareers", "text": "\"I recently started a new job as a ME design engineer at a water treatment products company a month ago. This is my second job out of college; my last job was also a ME design engineer role, but for a defense contractor, which I did for 11 years. So yeah, total culture change, lol. That was intentional. \\n\\nAt my new company, myself and my 2 other colleagues are young, mid-level mech. engineers but from totally different manufacturing industries. And there\\u2019s also an mechanical engineering co-op who is a junior in college. Each of us on the team have only been at this new company less than 2 months. \\n\\nTeamwork and collaboration in our product development team is encouraged, and I really support this, but I am not used to it. At my former defense contractor company, everyone worked independently on their own assigned projects, while still helping others here and there. My new manager is optimizing his time, often by showing all 4 of us how to do the same task at the same time, for the same project. These seem like tasks that really only require one person to do the work, so spreading it among 3 of us  I often I feel like I am not being challenged or using my talents/experience wisely.\\n\\nI know that I am very new and I have lots to learn. But I also feel like I am catching on quick, and others have said this to me also. \\n\\nShould I ask my boss politely for more challenging work? Or should I suck it up and wait to see how it goes after a few more months? I want to be a team player, but I also would like to have some ownership of work that matches my experience and skill set.\"", "title": "Not feeling challenged in new role…advice?", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/w9ww31/not_feeling_challenged_in_new_roleadvice/"}, {"author": "alow2016", "created_utc": 1658509975.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 0, "post_id": "w5fvj3", "score": 3, "subreddit": "EngineeringCareers", "text": "\"After almost three years of selling to chemical companies and six years of sales experience, I took a lean six sigma course to get more qualified with our customers and to get a better sense of how to manage our team. I found that I actually enjoy the business process improvement side more than what I currently do and am looking to find something that I can run with from my experience. \\n\\nIs there anything that you can do entry level that would be involved with lean six sigma that would be good to look for?\"", "title": "Does a black belt certificate translate to any entry level jobs?", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/w5fvj3/does_a_black_belt_certificate_translate_to_any/"}, {"author": "Youcrap-andsmile", "created_utc": 1657952847.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 1, "post_id": "w0a00l", "score": 1, "subreddit": "EngineeringCareers", "text": "\"Im from Bangalore, india and I\\u2019m 18F. I\\u2019ve gotten into MIT Manipal for electronics and instrumentation and I think I\\u2019ll probably get into PES for EEE. I really wanted to pursue CSE but with my rank I don\\u2019t think I can do it. Could someone give me some clarity about how the placements will be in EEE and is it advisable to take up a cs course in the side? I was really interested in taking up AI but I don\\u2019t think I\\u2019ll get into any good top colleges with my rankings. And could I also get some clarity about electronics and instrumentation? Is it worth it?\"", "title": "Planning to take EEE but I need clarity", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/w0a00l/planning_to_take_eee_but_i_need_clarity/"}, {"author": "beerelixir", "created_utc": 1657365381.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 5, "post_id": "vuzh8s", "score": 1, "subreddit": "EngineeringCareers", "text": "\"I am a postgrad student in Ireland doing a 1-year MSc in Structural engineering at a university. Typically, 1-year programs are extremely rigorous with very short deadlines for high amount of coursework and exams. Now the point is, I have failed 4 modules in the 2nd semester and 1 in the first semester although I passed the continuous assessment parts with decent marks except in one module. My course director told me that I would have to resit the exams likely next year which I am ok with as ran out of time doing assignments and failed the exams. The transcript would have the indication of me taking the exams on a second attempt as I am told. Can it become a hindrance to me getting hired by a company in their graduate engineer roles? Or would they just not care about the grades as long as I have a degree to show them?   \\n\\n\\nI often hear that marks are not a determinant of lifelong success which I belive to some extent as there are many factors that can make an exam a disaster. Pleas advise me, I feel very unsettled as I recently lost a job offer yesterday after I told them that I can't join them as I cant produce a degree now due to resit exams. Many thanks.\"", "title": "Would marks matter for jobs in Civil/Structural engineering?", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/vuzh8s/would_marks_matter_for_jobs_in_civilstructural/"}, {"author": "phikapp1932", "created_utc": 1657037970.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 7, "post_id": "vs1otw", "score": 1, "subreddit": "EngineeringCareers", "text": "\"Hello all,\\n\\nI\\u2019m (M26) currently a test engineer located in New York. I graduated a few years ago with my BSME, and I\\u2019m realizing 3 years into test engineering work that 1) I do not enjoy what I do, and 2) there is little room for growth as the field is quite siloed.\\n\\nAn engineering friend recommended I look into getting my PE license. My question to you all is, what jobs should I expect to come across that will give me work experience towards PE licensure? I have not taken the FE yet but intend to do so very soon. Thanks for all your help!\"", "title": "What kind of positions should I expect to apply to when pursuing my PE licensure?", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/vs1otw/what_kind_of_positions_should_i_expect_to_apply/"}, {"author": "cybersuitcase", "created_utc": 1656433445.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 10, "post_id": "vmr728", "score": 1, "subreddit": "EngineeringCareers", "text": "\"\\nSo we\\u2019re all aware of the CPI numbers, let alone energy, gas, rent, mortgage rate increases etc. Going into the second half of the second year in a row with these high numbers, just curious to hear how many of you will be bringing up this information come raise time/ how many expect their employers to adjust compensation fairly?\\n\\ncurious as well as to where merit raises belong in the conversation.\"", "title": "How will inflation affect your career decisions this year?", "upvote_ratio": 0.67, "url": "https://www.reddit.com/r/EngineeringCareers/comments/vmr728/how_will_inflation_affect_your_career_decisions/"}, {"author": "harshit_roy_python", "created_utc": 1656243112.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 0, "post_id": "vl2qlr", "score": 1, "subreddit": "EngineeringCareers", "text": "\"\"", "title": "Types of Duplicacy or Redundancy in Database with solution in Hindi for Gate cse", "upvote_ratio": 1.0, "url": "https://youtu.be/QFF_OI_soyo"}, {"author": "AnyAd6894", "created_utc": 1653316488.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 2, "post_id": "uw1mc4", "score": 2, "subreddit": "EngineeringCareers", "text": "\"I graduated with a bachelors in mechanical engineering in 2019. I'm currently working as a field engineer / project manager in the Telecom industry. I want to move on and do something more technical, I want to get into the robotics field. I read that the main programming language they use in robotics is C++. Would it be worth my time to get certified C++? Would it help me get a job in the field? I was thinking about getting the C++ associate certification.\\nhttps://home.pearsonvue.com/cppinstitute\"", "title": "Should I get a certification in C++ to enter the robotics field?", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/uw1mc4/should_i_get_a_certification_in_c_to_enter_the/"}, {"author": "ChickyChickyWingWang", "created_utc": 1652716612.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 1, "post_id": "uqz5ve", "score": 2, "subreddit": "EngineeringCareers", "text": "\"I have been working as a mechanical engineer doing very hands on design work for manufacturing for several years now. I've worked in a wide variety of industries designing process equipment. I have thoroughly enjoyed how much in-depth and hands-on design work I have been able to do in all those jobs. \\n\\nI recently took a job at a large papermill as a project engineer. This job is much more hands-off. All the design work for equipment is contracted out, and I just manage the process. The pay is much better, but I find myself missing the design process. I'm also a little worried about keeping my skills sharp while being in a management position. \\n\\nIs this a normal feeling when moving to management-level positions? What can I do to keep my technical skills sharp and scratch that itch?\"", "title": "How to stay technically relevant after moving to management", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/uqz5ve/how_to_stay_technically_relevant_after_moving_to/"}, {"author": "adcoe", "created_utc": 1649346564.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 4, "post_id": "tyfzvg", "score": 2, "subreddit": "EngineeringCareers", "text": "\" So I'm a new grad. Well almost. I graduate at the end of this month. I've been applying to many jobs around the country to try and secure a spot so I don't have to scramble after graduation. Most of them didn't get back to me, but a few did. I ended up accepting an entry level contracting position at Pfizer that pays a good salary for someone just coming out of college.\\n\\nAs I looked further into the benefits, I saw that the amount of PTO was incredibly low compared to other jobs I had seen: 5 days. I'd think this is completely unreasonable if it wasn't my first job. I just hope my mental health can hold up and pray that I don't get sick. The contracting company has 6 paid holidays. They have no 401K matching and their good medical benefits cost a fortune.\\n\\nI don't plan on being with this contractor forever, maybe for a year before I start trying to work my way in to direct hire. Do you think this is a good idea?\\n\\nTL;DR: Got an entry level engineering job. Good pay for new grad but bare minimum PTO and benefits. Thoughts on working here for a year or so?\"", "title": "new position quesiton", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/tyfzvg/new_position_quesiton/"}, {"author": "swedishmando", "created_utc": 1647788064.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 1, "post_id": "timsko", "score": 0, "subreddit": "EngineeringCareers", "text": "\"Hello everyone. I\\u2019m a mechanical engineer working on mechanical systems within the property and buildings industry but within a firm that does a whole range of professional services consulting. \\n\\nI haven\\u2019t been working for that long. About 10 months. But I feel quite reluctant to specialise in one industry yet. The main goal  of this job was to just get my first professional mechanical engineering role. But now I\\u2019m thinking ahead a bit I don\\u2019t want to be stuck in only one industry yet. I never expected to be in buildings for my whole career. \\n\\nWhat matters more out of these? Or am I overthinking and mech eng is mech eng? \\n\\nThanks\"", "title": "I’m confused what matters more. Job title, industry, degree or something else?", "upvote_ratio": 0.5, "url": "https://www.reddit.com/r/EngineeringCareers/comments/timsko/im_confused_what_matters_more_job_title_industry/"}, {"author": "sandforce", "created_utc": 1647142334.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 2, "post_id": "tcy1i9", "score": 6, "subreddit": "EngineeringCareers", "text": "\"\"", "title": "This sub may soon get a boost", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/tcy1i9/this_sub_may_soon_get_a_boost/"}, {"author": "mseet", "created_utc": 1646960095.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 0, "post_id": "tbdwj0", "score": 1, "subreddit": "EngineeringCareers", "text": "\"FPGA / Embedded, and HW design positions. \\n\\n[https://www.a2etechnologies.com/jobs.html](https://www.a2etechnologies.com/jobs.html)\"", "title": "A2E Technologies hiring many positions - JR / SR roles", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/tbdwj0/a2e_technologies_hiring_many_positions_jr_sr_roles/"}, {"author": "Geologyst1013", "created_utc": 1639494727.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 0, "post_id": "rg9kec", "score": 2, "subreddit": "EngineeringCareers", "text": "\"I have a colleague who will be sitting for her PE in March of next year. Do any of you fine folks know of any online study groups that might be going on in preparation for the spring test?\\n\\nI ask because I found a good PG zoom-based study group over on r/geologycareers so I was wondering if there was anything similar happening on this end.\\n\\nThanks so much!\"", "title": "PE Study Groups", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/rg9kec/pe_study_groups/"}, {"author": "thefuzzynugget1", "created_utc": 1638995829.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 0, "post_id": "rc0dri", "score": 1, "subreddit": "EngineeringCareers", "text": "\" I've been doing systems engineering for my entire career (6 years). I've really enjoyed my job as I get to work on our system and also install/test it in the field. Recently I've been moved to a more static position when I'm doing mainly development and no field work.\\n\\nI think its time for me to move on. Are there any suggestions on fields/jobs I should look at that employ 15-20% field work?\\n\\nFor reference I have my BA in ME and working on my MS in EE/CE. I really enjoy working with drones/uavs/weaps. And I have good experience working with IT and signal processing.\\n\\nthanks!\"", "title": "Jobs that include field testing?", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/rc0dri/jobs_that_include_field_testing/"}, {"author": "CovertEngineering489", "created_utc": 1637428109.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 0, "post_id": "qy9xh5", "score": 1, "subreddit": "EngineeringCareers", "text": "\"I graduated with an associates in Engineering (exact name of my degree). I have well over 100 hours spent in CAD (AutoDesk Inventor, Fusion360, and a small amount in SOLIDWORKS). My resume includes the custom CNC machine I designed for lapping internal surfaces, the fixed wing drone I'm working on now, my time as Engineering Club President at our community college, Eagle Scout, and my work history (non of which is in Engineering)\\n\\nI just began my first engineering related job in Aerospace. I'm working with carbon fiber to produce parts for the Virgin Galactic spaceplane. Next contract my company has is with a well known design firm that produces military fighter jets. However my specific position is manual labor, educated manual labor.\\n\\nI'm now finding I wish I finished a bachelor's degree in mechanical engineering because I'd rather be working in design with CAD and mathematical analysis. The pay is higher and I'm more interested in working with my brain then my hands.\\n\\nWould it be a correct assumption that spending 1-2 years working as a composite technician would be a nice addition to my resume and could land me a future position in design? Or should I save my time and go back to school for a full Bachelor's? Or should I just continue searching for a CAD position with my current experience/resume?\"", "title": "Time spent as composite tech (CF) help get into designing in the future?", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/qy9xh5/time_spent_as_composite_tech_cf_help_get_into/"}, {"author": "ivan_v21", "created_utc": 1635881130.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 1, "post_id": "qlc0zg", "score": 5, "subreddit": "EngineeringCareers", "text": "\"chances of getting a full time at tesla, bmw, mercedes benz, gm, other engineering jobs after a 6 month engineering co-op with cummins?\"", "title": "engineering full time chances", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/qlc0zg/engineering_full_time_chances/"}, {"author": "None", "created_utc": 1634922923.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 3, "post_id": "qdllfn", "score": 3, "subreddit": "EngineeringCareers", "text": "\"A little background, I graduated with a bachelor\\u2019s in mechanical engineering last august and was unemployed for a year. \\nI finally got a job in a manufacturing company In august, I like the company but I\\u2019m not enjoying manufacturing. \\nI feel like I\\u2019m not good at my job, and I get dumped on a lot. \\nAlso the fact that products have to go out monthly, and between the projects for cost improvements and assembling or getting tooling ready for the next job just burns me out. \\nI\\u2019m in SoCal and would like to stay local, any input would be greatly appreciated.\"", "title": "Career advice", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/qdllfn/career_advice/"}, {"author": "JanusOrder", "created_utc": 1634230724.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 2, "post_id": "q83uyu", "score": 1, "subreddit": "EngineeringCareers", "text": "\"Hi, I graduated a year ago with a bachelors in computer science, and have been working for the past year as a SWE. Can\\u2019t really complain about the job all too much, the pay was worth the stress of school and I\\u2019m glad I finally made it out. \\n\\nI\\u2019ve been exploring where I should go with my career and I realized that I don\\u2019t wanna go into management or anything, and I don\\u2019t wanna just write code and build apps. I\\u2019ve been watching tutorials and doing small projects on my own to learn about electronics, circuits and other hardware and exploring the space industry (with the recent success of spaceX and blue origin) as well as robotics and other stuff.\\n\\nMy question is, should I apply for to grad school to continue in a similar subject like computer engineering, or even electrical engineering, or would getting another bachelors degree in say computer engineering be better?\"", "title": "Considering going back to school for a masters degree, or a second Bachelors degree?", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/q83uyu/considering_going_back_to_school_for_a_masters/"}, {"author": "haplesshuman", "created_utc": 1630913353.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 4, "post_id": "piup4o", "score": 4, "subreddit": "EngineeringCareers", "text": "\"Hello Everyone. I am a Mechanical Engineer looking to shift to Computer Science. I am 40 years old. I am a Product Development Professional which means to say that all of my previous jobs (Mechanical Design Engineer, Product Engineer, NPI Engineer, and Project Manager) were all involved in developing, delivering and sustaining electro-mechanical products.\\n\\nI am now working in Singapore and the company I am working for has a toxic culture caused by management\\u2019s values. I want to move to another job but it is difficult because I am a foreigner and there are foreigner quotas here. Also, it seems like the job opportunities for Mechanical Engineers in my field are dwindling and do not pay as much as it used to.\\n\\nI was always interested in coding since high school and I always had excellent or perfect marks in my computer subjects in high school and in college. Even after that, I have taken online coding courses and I found that I enjoyed them. This is one of the reasons I am seriously considering moving to Computer Science. Another reason would be high pay.\\n\\nI do not have specific questions to ask. I just want to know what your ideas and thoughts are on my situation.  However, if you are able to put myself in my shoes, what are you gonna do?\"", "title": "40 yr old Mechanical Engineer looking to shift to Computer Science", "upvote_ratio": 0.84, "url": "https://www.reddit.com/r/EngineeringCareers/comments/piup4o/40_yr_old_mechanical_engineer_looking_to_shift_to/"}, {"author": "Chiliman06", "created_utc": 1630647834.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 4, "post_id": "pgz1h1", "score": 2, "subreddit": "EngineeringCareers", "text": "\"I\\u2019ve been thinking of pursuing a career in Civil engineering but I want to know what the actual day to day is like before I make a decision.\"", "title": "What is the job actually like?", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/pgz1h1/what_is_the_job_actually_like/"}, {"author": "bobbythebee_123", "created_utc": 1630451742.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 1, "post_id": "pfha93", "score": 1, "subreddit": "EngineeringCareers", "text": "\"I am in my last year of high school but I am having trouble on which engineering to pick: Mechatronics or environmental engineering.\\n\\nIn Australia the job market for Mechatronics engineering is not great, so my second option would be to do environmental engineering because Australia has more jobs for civil/environmental engineering. In highschool I dropped out of chemistry and I am worried that if I am not good in chem, will this be a problem with environmental engineering? In uni am I able to catch up with chem if I have no background in it? thanks.\"", "title": "Should I pick mechatronics or environmental engineering?", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/pfha93/should_i_pick_mechatronics_or_environmental/"}, {"author": "MiserableTiger1", "created_utc": 1630341899.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 2, "post_id": "pelxdn", "score": 1, "subreddit": "EngineeringCareers", "text": "\"Hello everybody, I recently interviewed at an oil and pipeline company that sounds pretty interesting to work for. I graduated two months ago with my BSME and minor in medical physics. A big goal i have right now is to get into the medical device field one day, maybe even product design. Like all aspiring engineers i have a couple of dream jobs in mind. With that being said, the company i interviewed at on Friday offered me the job at a decent salary with great room for improvement. My question is, how difficult is it to switch career paths? This is only 1 of 2 interviews i have an offer for after applying to 200+ positions of all types. I'll be accepting this offer later today but i wanted to know if I'm closing doors on myself or if i can take my experience a handful of years down the road and get into medical device development?\"", "title": "Job flexibility?", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/pelxdn/job_flexibility/"}, {"author": "The4Shadowmask", "created_utc": 1629495185.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 1, "post_id": "p8ehi8", "score": 3, "subreddit": "EngineeringCareers", "text": "\"Hello all! I'm not sure if there is a better sub to post this in but I have a dilemma and I'm in kind of an odd situation.\\n\\nI graduated in 2020 with a Computer Science and Engineering Degree but kinda bounced around and didn't really like Com Sci as much as a thought. Anyways, I ended up being a CMM (Coordinate Machine Measurer) for a small business that manufactures aerospace parts. They had an opening for the Quality Engineer Position that I applied to.\\n\\nThey said they are willing to train me, however that want me to be a \\\"trainee\\\" and not give me a raise. Currently, I am making 18.40/hr but the job was advertised as 55k-65k a year, so 26/hr-32/hr roughly. I spoke to the CEO yesterday and said I would need at least the minimum they advertised to do the job, he told me that I was a big risk and lucky they were even willing to train me to begin with. \\n\\nHe said he could increase my wage to 19/hr but I still feel like I was super disrespected and that I'm being taken advantage of. I know that I am a risk and that I have to learn a lot, but I still feel like I should be compensated adequately since I will be doing a QE's work within a few months anyways. \\n\\nThoughts?\"", "title": "My Boss refuses to give me a raise for a new position", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/p8ehi8/my_boss_refuses_to_give_me_a_raise_for_a_new/"}, {"author": "Zealousideal_Buy308", "created_utc": 1625533959.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 2, "post_id": "oekmlu", "score": 5, "subreddit": "EngineeringCareers", "text": "\"I've been out of school for about two years and started a new job almost two months ago. I know I'm still in the learning phase, but I was wondering how to know if I'm doing good enough. Also is it okay to ask my manager how I'm doing?\"", "title": "Am I bad at my job?", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/oekmlu/am_i_bad_at_my_job/"}, {"author": "ForStateDuuude", "created_utc": 1624993417.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 0, "post_id": "oaexd4", "score": 1, "subreddit": "EngineeringCareers", "text": "\"Hello, I have an Associates in Instrumentation, Bachelors in Applied Arts & Science (concentration is Business), two years experience as an I&C Tech and 6 months as a Metrology Tech in a Radiological Instrumentation Lab. Currently Met Lab Tech at a nuclear power plant. I am hoping to pursue my masters one day but not sure exactly what paths are available to me since my BAAS is sort of generic however, my job experience is pretty specialized. Can I be a professor one day after retirement? Can I move into a supervisory or leadership/business role with an Executive MBA or Masters in Engineering management? Help please.\"", "title": "Which graduate degree is for me?", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/oaexd4/which_graduate_degree_is_for_me/"}, {"author": "beerelixir", "created_utc": 1623105761.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 0, "post_id": "nupsc3", "score": 1, "subreddit": "EngineeringCareers", "text": "\"What is the use of an engineering degree being accredited with the Washington Accord? Does it provide easy mobility across the member countries for working engineering jobs? I will be starting my MSc in Structural engineering at Trinity College Dublin which is a member state of WA. Thank you.\"", "title": "Query regardingWashington Accord.", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/nupsc3/query_regardingwashington_accord/"}, {"author": "alwayz_skeptikal", "created_utc": 1622124920.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 1, "post_id": "nm8f14", "score": 1, "subreddit": "EngineeringCareers", "text": "\"I'm in this situation where I have an ok government job. Pays pretty well (53k) given no more than I do plus the retirement match & vacation time, holidays & flexible schedule. However, I have been applying for private sector jobs & got an offer for 65k. It is quite a drive too (60 miles one way). So after taking out $300/month for additional gas, I'd only be making an extra $500/month. Well, student loan deferment will be up in October, & my loan payment is that extra $500/month if I go private  vs if I stayed government I could consolidate for a monthly payment under $300/month & qualify for a Public Loan Service Forgiveness in 10 years. Overall, private industry I would pay back $80k vs government I would pay back $36k-$43k & be forgiven $52k-$43k (I used the loan simulator on StudentAid).\\n\\nAdditional information: I am in debt due outrageous medical bills, which is why I started looking for higher paying jobs in my field (civil engineering). I also am doing soil conservation with little to no design work, whereas the new private job would give me design experience towards my career goals of obtaining my  Professional Engineer license. Plus, I do not like the coworkers in my assigned office (I contemplate calling into work sick or PTO EVERY day) & I have basically been put to the side with little to no work or training. Do you pick experience & mental health or financial stability & less repayment on loans?\"", "title": "Leaving a government job for private industry", "upvote_ratio": 0.66, "url": "https://www.reddit.com/r/EngineeringCareers/comments/nm8f14/leaving_a_government_job_for_private_industry/"}, {"author": "usinjin", "created_utc": 1621571334.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 6, "post_id": "nhk062", "score": 2, "subreddit": "EngineeringCareers", "text": "\"I could use some advice. I recently applied to a few hardware engineering positions with a big tech company in my city. A few days later, I got an email from a recruiter asking me if I would be interested in interviewing for a position. Yes, absolutely. The position is not one that I applied for (it\\u2019s in a different state). The description states that they\\u2019re looking with someone with particular experience using a particular hardware (mostly sensors). The issue is that I actually do have some experience with they\\u2019re looking for, but due to space constraints, it\\u2019s not listed on my resume. I just had my first technical interview today, and I realized that this issue might actually be problematic if I want to move forward. The interviewer asked me about several things on my resume that were less relevant, and I felt compelled to say \\u201cI actually have relevant project experience with what the job is looking for, but isn\\u2019t listed specifically on my resume.\\u201d I went into more detail and the interviewer seemed more interested.\\n\\nI\\u2019m wondering what I could do to help my situation. Should I reach out to the original recruiter and ask if I could submit a more relevant resume? Should I simply upload a new resume to the job portal? Or should I simply tell subsequent interviewers (if there are any) that I have an additional skill that simply isn\\u2019t listed? Honestly I\\u2019m leaning towards the last option, as it seems the most straightforward. What I want to avoid is averting future interviews for the position because someone looks at my resume and says \\u201cwell, they don\\u2019t have experience using -x-.\\u201d\"", "title": "Getting interviewed for a position with the wrong resume", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/nhk062/getting_interviewed_for_a_position_with_the_wrong/"}, {"author": "None", "created_utc": 1620642516.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 1, "post_id": "n918k4", "score": 2, "subreddit": "EngineeringCareers", "text": "\"Is it common for those who work in larger firms to have a work laptop which they can use to learn the various softwares at home like Civil 3D or HydroCAD? I work at a small firm that only has desktops and my only option would be to stay late or show up over the weekend\"", "title": "Work laptops", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/n918k4/work_laptops/"}, {"author": "Jealous-Diamond8750", "created_utc": 1619831204.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 0, "post_id": "n27vam", "score": 2, "subreddit": "EngineeringCareers", "text": "\"I am currently a researcher, studying applications of data science in additive manufacturing, with an MS in materials engineering. Both of these fields are growing rapidly and understaffed as far as I can tell. 1 year of experience in this field outside of school. 2.5 years of experience if you could my degree time, which was in these fields.\\n\\nI've been sending my resume to company I'm interested in working for, asked for interviews. I never thought to specify that I would want to be an engineer (although I would be fine being a data scientist). I got an offer today as a technologist (85k in a medium cost of living area). I'm a bit apprehensive about this, concerned that I am being lowballed with that title. While the salary is not bad, I have known people who got positions at 90k (with insane benefits) out of college. And my current position pays 102k (which is higher than a typical entry level position, I know. I attribute this to the fields I am in... which may not be a correct assumption).\\n\\nThoughts? Are there risks associated with accepting a position as a technologist? I've never heard of the term before but it sounds like a technologist is someone who has a lesser grasp of theory than an engineer, and assists them, which is definitely not the type of experience I have had. Would asking this company about changing my position title be synonymous with asking for higher pay?\"", "title": "Downsides of taking a technologist position?", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/n27vam/downsides_of_taking_a_technologist_position/"}, {"author": "niitgineer", "created_utc": 1616851322.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 0, "post_id": "medp0c", "score": 2, "subreddit": "EngineeringCareers", "text": "\"\"", "title": "GATE Exam Playlist: Most Important and most frequently asked previous years questions covering range of topics. Must Watch, if you are preparing for GATE Exam", "upvote_ratio": 1.0, "url": "https://www.youtube.com/playlist?list=PL1x_rKUkGRRLS2wLcAbUyI27th0_3l20T"}, {"author": "niitgineer", "created_utc": 1616851593.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 0, "post_id": "medrls", "score": 1, "subreddit": "EngineeringCareers", "text": "\"\"", "title": "Karnaugh Map (K-Map) : 2, 3 and 4 Variable K-Maps, MinTerm, MaxTerm, SOP, POS", "upvote_ratio": 1.0, "url": "https://youtu.be/-IGXkBLbF3g"}, {"author": "ballislyfe24", "created_utc": 1616525794.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 3, "post_id": "mblwv9", "score": 2, "subreddit": "EngineeringCareers", "text": "\"Hi there,\\n\\nJust wondering if anybody could share their experience or wisdom on approaching the job search as a new graduate in the civil engineering industry.\\n\\nAs of now I have the option of returning to my previous co-op employer upon graduating this coming Spring. They're a good company with good people and good management. However, their line of work isn't exactly something that I am interested in doing over the long term. It is a mix of office work and site work. But there's quite a lot of traveling for site work, and the work itself on site is exhausting.\\n\\nI am more interested in the design aspects of civil engineering, particularly in structures. I have good grades, but no internship or co-op for design specifically.\\n\\nFor those being in my shoes in the past, what would be an effective way to navigate the job search process to eventually land a design role in the civil engineering industry?\\n\\nShould I return to my co-op employer and stick it out as I perform the job search concurrently? or is performing the job search for design while being unemployed still okay and no too detrimental to my value on the market?\\n\\nI am from Canada, by the way.\\n\\nThank you in advance for reading and thoughts. I really appreciate your insights and wisdom from your personal experiences.\"", "title": "Job Search Advice for Upcoming New Graduate (Civil Engineering)", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/mblwv9/job_search_advice_for_upcoming_new_graduate_civil/"}, {"author": "None", "created_utc": 1615607841.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 1, "post_id": "m3ykdp", "score": 0, "subreddit": "EngineeringCareers", "text": "\"I'm in my sophomore year of ME. Planning on getting my masters though in Finance or Aeronautical Engineering. I really don't care what career path based on happiness. Cause I'd be happy doing either. I have a relative picture of how much the financial career path would net me (my family has been in the business and they've painted me a clear picture).   \\n\\n\\nBut, I have no idea what like entry lvl pay would be for a person like me, Masters in Aeronautical Engineering. Entry lvl? and 5 years? 10 years?\"", "title": "Salary Comparison", "upvote_ratio": 0.5, "url": "https://www.reddit.com/r/EngineeringCareers/comments/m3ykdp/salary_comparison/"}, {"author": "Enginot95", "created_utc": 1614978465.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 7, "post_id": "lylxlx", "score": 1, "subreddit": "EngineeringCareers", "text": "\"Hey all, thanks in advance for your attention. I am attempting to get some career advise and hopefully I'll find some decent insight here.\\n\\nI live in Canada and am a recent (3 years out) graduate of an MET college program. I originally got into MET due to my fascination with mechanical design and manufacturing. I've been blessed with some great opportunities in aerospace manufacturing throughout college co-ops, but always yearning for design work I pushed to be given cad liscences so I could design tooling and shop aids for manufacturing. With more and more trust gifted to me I was given opportunity to design tooling which was recieved well enough to be manufactured and used in production which brought me great joy. After my graduating, I was able to secure a role as a tool designer at the company I had my second co-op at. After about 6 months I was recruited through word of mouth by a cutting tool company who paid me really well and gave me lots of freedom to design solutions for them. When covid hit and the second round of layoffs came around I was laid off from that cutting tool company, who I am still laid off from with the potential to go back. \\n\\nKnowing I have to do whats best for me, I am looking around for different opportunities in mechanical design at companies who don't require an ME degree. I am having trouble marketing myself as someone who is able to tackle mechanical design as most of my industry/design experience is in tooling. As much as it would be great to get back to the cutting tool company I am currently laid of from, Id really like to break out into general mechanical or machine design. \\n\\nAm I reaching too far to think that it's possible to transition from mechanical/Tool designer to general mechanical design?\\n\\nCan anyone give me any pointers on how I might be able to grow my career in this direction?\\n\\nThanks so much for any advice\"", "title": "Breaking Out of Tool Design", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/lylxlx/breaking_out_of_tool_design/"}, {"author": "meeraravi", "created_utc": 1612905949.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 0, "post_id": "lgdwle", "score": 1, "subreddit": "EngineeringCareers", "text": "\"We are a nonprofit looking to connect university students with 3DP and AM industry leaders. If you are a university student looking to get mentored by an industry expert, please sign up here: [Wi3DP Next Gen Mentorship Program](https://docs.google.com/forms/d/e/1FAIpQLSeg6GD3NFzKMDfGZkjwJVuXwIHP7FmXpJ6CHS8n8WK016va0Q/viewform)\"", "title": "Careers in 3D Printing and Additive Manufacturing", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/lgdwle/careers_in_3d_printing_and_additive_manufacturing/"}, {"author": "Barman95", "created_utc": 1609255676.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 0, "post_id": "kmgfro", "score": 1, "subreddit": "EngineeringCareers", "text": "\"Hi all, I am a recent environmental engineering (BS) grad and I was wondering how I could market myself to get into a more design oriented role than many careers offer. The best thing would probably have been to pursue a civil degree, but it seems a lot of water resource positions are design oriented and take on environmental folks.\\n\\nAre they any other civil sub-disciplines that may offer this sort of opportunity to branch out for someone like me? Thanks!\"", "title": "Environmental Design Oriented Careers", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/kmgfro/environmental_design_oriented_careers/"}, {"author": "QuixoticAmbivert", "created_utc": 1606240699.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 0, "post_id": "k0a1os", "score": 1, "subreddit": "EngineeringCareers", "text": "\"Anyone here who is working or worked as an engineer in sneaker industry?There are a lot of people with industrial design and design background, textile engineers  that we usually see working in product development, materials engineer and other related positions. I've come across profiles of few mechanical engineers  in Nike, Adidas who work in product development,  R&D etc.( Tiffany Beers from Nike is a plastics engineer)\\n\\nI am a senior ME student interested in working in this industry. I'd be grateful if anyone can tell me more about what kind of internships or work I can do to build up skills to enter this industry or about any related  programs\"", "title": "Engineer in sneaker industry?", "upvote_ratio": 0.67, "url": "https://www.reddit.com/r/EngineeringCareers/comments/k0a1os/engineer_in_sneaker_industry/"}, {"author": "ForStateDuuude", "created_utc": 1605760497.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 0, "post_id": "jww4z5", "score": 1, "subreddit": "EngineeringCareers", "text": "\"I was invited to apply for a Metrology Specialist position yesterday. I have 2 yrs experience as an instrument tech. Not so much calibrating 754's and hand pumps but more of a step-up role I believe. Writing/editing procedures. Will this set me back as far as troubleshooting skills in the field? Seems like a kush job just not sure I want to leave being an actual I&E technician. It's for a nuclear plant.\"", "title": "Metrology Tech/Specialists here?", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/jww4z5/metrology_techspecialists_here/"}, {"author": "ForStateDuuude", "created_utc": 1605496660.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 0, "post_id": "juzhyq", "score": 1, "subreddit": "EngineeringCareers", "text": "\"Hello, \\n\\nWhat are normally requirements for a position like this? What exactly is this job? Is it mainly behind a computer or is there physical, hands-on, tech work to do? I know what DCS is but is this mostly control loop checking? Using AutoCAD?\\n\\n&#x200B;\\n\\nThanks\"", "title": "DCS/SIS Field Service Engineer job requirements?", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/juzhyq/dcssis_field_service_engineer_job_requirements/"}, {"author": "Accomplished-You-596", "created_utc": 1603216222.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 0, "post_id": "jeuoj5", "score": 1, "subreddit": "EngineeringCareers", "text": "\"Hello everyone, \\n\\nI am kind of in a rough patch. I graduated with my chemical engineering degree in May right during the pandemic which I believe hurt a lot of my chances of getting a good job. In the mean time I have decided to pursue a Masters of Engineering with a concentration in Manufacturing Engineering and a Master of Science in Business Analytics and Project Management. I was also offered a position as a Research and Development Chemist which I happily took since the other choice was unemployment. I am about 3 months in and plan to finish my Master of Engineering in May 2021 and M.S in December 2021. \\n\\nI am struggling to find where I can apply my knowledge and experience in a more engineering/management role. I am not jumping up with joy over my current job but it is ok...for now. I definitely want to move into a process/project engineer role but I am not sure how. I have applied to numerous positions and either was rejected or never heard back. \\n\\nWould anyone be able to give input on where I can go with my experience or any recommendations for job searching? I have interests in data analytics, management and bio-tech which is no where near what I am currently working on.\"", "title": "B.S Chemical engineering career outlook", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/jeuoj5/bs_chemical_engineering_career_outlook/"}, {"author": "ajput123", "created_utc": 1602022226.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 0, "post_id": "j6eria", "score": 1, "subreddit": "EngineeringCareers", "text": "\"I am contemplating moving into industrial engineering (manufacturing and process improvement) and want to know if having a materials science/engineering background would put me at a disadvantage in industry. I have not decided if Im doing a thesis or non thesis option and want to know if theres any advantages/disadvantages to doing the non-thesis option if I dont plan on going into academia or research.\"", "title": "Question about getting M.S. Industrial engineering with a B.S. in Materials science and engineering", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/j6eria/question_about_getting_ms_industrial_engineering/"}, {"author": "ajput123", "created_utc": 1602022047.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 0, "post_id": "j6epnd", "score": 1, "subreddit": "EngineeringCareers", "text": "\"I recently graduated with a B.S in material science and engineering and have been going through a rough time with job hunting. A lot of the positions Im seeing require years of experience or a higher degree than what I have. I have an interview this Friday with a semiconductor company but am worried about being tied down to the semiconductor industry if offered the job  and not being able to branch out. Any materials engineers on here have experience with going from one industry to another? I want to get involved with polymeric materials down the line (Im okay starting off with semiconductors but would like to branch out eventually).\"", "title": "Materials Science and Engineering graduate looking for advice.", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/j6epnd/materials_science_and_engineering_graduate/"}, {"author": "Javi_Areugon", "created_utc": 1602011630.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 0, "post_id": "j6bfsh", "score": 1, "subreddit": "EngineeringCareers", "text": "\"Hi. I'm currently studying Enviro Engineering in Costa Rica. I have found that the job propectives are dwindling so I'm evaluating my options, if should i stay or should i go ( If I go there will be trouble  \\nAnd if I stay it will be double ). So if any of you are or work with a Materials Engineer, i really would like to hear your opinions on the job market. Thanks\"", "title": "Jobs in Materials Engineering", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/j6bfsh/jobs_in_materials_engineering/"}, {"author": "Mcloven2020", "created_utc": 1600999503.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 2, "post_id": "izav5q", "score": 2, "subreddit": "EngineeringCareers", "text": "\"I am in my final yeah middle school currently but I've been very interested in engineering since I was in elementary. I've been looking in to electrical and structural engineering but I'm still not sure what to pick. I'm not the best at math but not the worst at it either. I want to attend Texas A&M university due to it being know for its wide engineering majors. And wanted to know what to look forward to in these two engineering majors and what to avoid. Thank you taking your time to read this! Enjoy the rest of your day!\"", "title": "Hi r/EngineeringCareers members I want to do engineering and wanted to know what there is to know!", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/izav5q/hi_rengineeringcareers_members_i_want_to_do/"}, {"author": "leawood11", "created_utc": 1597584590.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 2, "post_id": "iascnp", "score": 1, "subreddit": "EngineeringCareers", "text": "\"Question.  What are career options for engineers that are not based in an office (sans Covid) \\n\\nMy son excels in robotics, particularly mechanical aspects.  Robotics basically consumes him during season.   He finished Calc his junior year.  \\n\\nHe doesn\\u2019t want to pursue engineering at university since he visited an engineering firm during a school career day. \\n\\nHe spends his free time building props, electrically wired costumes, building computers from found old parts, painting and sculpting. \\n\\nWhat are career possibilities I can introduce him to that are not office bound?\"", "title": "Engineering careers not in an cube farm office", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/iascnp/engineering_careers_not_in_an_cube_farm_office/"}, {"author": "pankaj11", "created_utc": 1597308831.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 0, "post_id": "i8wfhl", "score": 2, "subreddit": "EngineeringCareers", "text": "\" \\n\\nGATE EXAM Notification 2021\\n\\nGraduate Aptitude Test in Engineering\\n\\nClick on the Link to apply:\\n\\nhttps://www.govtjobsportal.in/2020/08/GATE-NOTIFICATION-2021.html\\n\\n\\\\#GATE #GATEEXAM #GATENotification\"", "title": "GATE EXAM 2021 NOTIFICATION IS OUT", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/i8wfhl/gate_exam_2021_notification_is_out/"}, {"author": "marshmallowkid_", "created_utc": 1596509239.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 3, "post_id": "i3bazq", "score": 3, "subreddit": "EngineeringCareers", "text": "\"Do people who focus on having an impact in there job over higher salary regret it later in life. I often think I don\\u2019t have the same emotional attachment to money as some of my peers and would be much more satisfied working in an engineering role that impacts society positively but am I being foolish.\"", "title": "Money vs impact in a job", "upvote_ratio": 0.81, "url": "https://www.reddit.com/r/EngineeringCareers/comments/i3bazq/money_vs_impact_in_a_job/"}, {"author": "auruner", "created_utc": 1593661538.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 2, "post_id": "hjpqfz", "score": 1, "subreddit": "EngineeringCareers", "text": "\"I'm hoping someone here works at the aforementioned. I've always had an interest in space and am lookimg to go back to school for my Master's. Haven't decided if I want to do ME or AE. But I really want to be involved in space exploration. Does anyone have an idea of what qualifications I'd need?\"", "title": "What Does Jacobs or NASA Look For in a Potential Candidate?", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/hjpqfz/what_does_jacobs_or_nasa_look_for_in_a_potential/"}, {"author": "-ThinksAlot-", "created_utc": 1593269697.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 1, "post_id": "hguwuy", "score": 3, "subreddit": "EngineeringCareers", "text": "\"or do you have to be a student?\"", "title": "Can recent graduates apply to internships?", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/hguwuy/can_recent_graduates_apply_to_internships/"}, {"author": "-ThinksAlot-", "created_utc": 1591149901.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 4, "post_id": "gvkyqg", "score": 2, "subreddit": "EngineeringCareers", "text": "\"Hi all, I will be leaning on my physics to apply for jobs in the aerospace/space exploration industry, but I know that I'm at a disadvantage without having an engineering degree. I always kind of planned on going for a master's in engineering though (most likely mechanical).\\n\\nI can see a lot of people saying that I'm underqualified because I don't have the bachelors in engineering, but I have heard that two much education might overqualify a person even though it's in lots of job descriptions.\\n\\nWill people tell me I'm overqualified if and when I get the masters? Has anyone had to deal with that?\"", "title": "Does a master's overqualify you?", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/gvkyqg/does_a_masters_overqualify_you/"}, {"author": "Cass40", "created_utc": 1589347553.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 6, "post_id": "gisov1", "score": 0, "subreddit": "EngineeringCareers", "text": "\" I'm currently a student at Purdue University Northwest for Computer Science. But I'm thinking about switching my major to Mechatronics Engineering Technology which is not only a 4-year degree but is also ABET-accredited and there are even graduate opportunities. I'm also considering going for a Mechanical Engineering degree and while I know the salary for a ME is quite high I was wondering about the possible jobs and salaries a BS MET and an MS MET can possibly have or should I just do Mechanical or Electrical Engineering.\"", "title": "Deciding between Engineering and Engineering Technology", "upvote_ratio": 0.5, "url": "https://www.reddit.com/r/EngineeringCareers/comments/gisov1/deciding_between_engineering_and_engineering/"}, {"author": "_gordon_ramsey_", "created_utc": 1583714722.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 1, "post_id": "ffmbly", "score": 2, "subreddit": "EngineeringCareers", "text": "\"Advice on college for aerospace engineering\\n\\nOk so I\\u2019m currently a US citizen who graduated high school and I\\u2019m considering going out of country for college. The only thing is I want to major in aerospace engineering and I heard that can get tricky if I want to come back and get a job in the US. I just think it would be cool to do because of the lowered tuition and I love to travel as is. Since I would already most likely have to go out of state because there is only one college in my state that offers aerospace engineering, I figured I might as well go out of country as that is something I have thought about and dreamed of doing for a while. The only problem is I know the US is one of the best countries for aerospace engineering for college, so I\\u2019m worried about lack of job opportunities particularly if I want to come back and work in the US, or if my degree would even be recognized. I\\u2019m also worried about less opportunities just by simply going to a lesser known or recognized university. If anyone has any experience working in the aerospace field or anyone that has gone to college out of country that would be able to give advice on if this is a good idea or not it would be great. I have already been accepted to a few decent programs within the US, it just seems so much smarter to go out of country for tuition purposes as well as the fact that I love to travel anyways. The idea of college in general has been a bit nerve wracking, and thinking about going out of country has been the only thing that has made me excited about it. I just don\\u2019t want to jump into anything without considering the downsides such as job placement and going to lesser known universities. Sorry if this is a bit long but any advice would help. Thank you!\"", "title": "Advice on college for aerospace engineering?", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/ffmbly/advice_on_college_for_aerospace_engineering/"}, {"author": "None", "created_utc": 1576447548.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 0, "post_id": "eb5i8s", "score": 1, "subreddit": "EngineeringCareers", "text": "\"AeroWorx Global LLC\\n\\n[aeroworxglobal.com](https://aeroworxglobal.com)\\n\\nProvides outstanding Engineering staffing services! \\n\\nContract to Hire, Direct Hire, Project Consulting, and engineering management resources.\"", "title": "AeroWorx Global LLC", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/eb5i8s/aeroworx_global_llc/"}, {"author": "Shpander", "created_utc": 1572110871.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 0, "post_id": "dngx8s", "score": 1, "subreddit": "EngineeringCareers", "text": "\"Hi all, a job I am applying for requires me to have knowledge of CATIA v5, 3DCOM or 3DExp, but I have none. I've used SolidWorks at uni, is that worth mentioning? Or are they too different to mention? If they are, I thought to bluff and say I was learning CATIA via an online course, then if I get offered an interview, buy the software and actually do the course.\"", "title": "Learn CATIA v5 for job application?", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/dngx8s/learn_catia_v5_for_job_application/"}, {"author": "vonrich2k19", "created_utc": 1568859977.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 3, "post_id": "d67nax", "score": 1, "subreddit": "EngineeringCareers", "text": "\"\"", "title": "Hey everyone, can any person who is in the field of engineering answer a few interview questions for my school assignment? Thank you.", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/d67nax/hey_everyone_can_any_person_who_is_in_the_field/"}, {"author": "games404life", "created_utc": 1568681976.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 1, "post_id": "d59o6i", "score": 1, "subreddit": "EngineeringCareers", "text": "\"Hi guys,\\n\\nIs there anyone who started going for Engineering career in their 30s?\\n\\nI am currently working in a completely unrelated industry as a Sales rep. Been interested in how things worked and understanding underlying principles for my whole life, I always think it's cool to build or create something and get it going(A system or mechanism)\\n\\nBut I would really like to give it a go to change my career, probably going back to Uni to pursue an engineering degree to start with. However I don't have any relevant experience or training background, so starting from scratch in your 30s is quite scary.\\n\\nI am trying to self-taught myself some highschool math and physics as it was more than 10yrs ago last time I did that. I quite enjoyed it but obviously work will be very different. \\n\\nI am thinking about Civil Engineering or Power engineering as I presume the job prospects will be overall better?\\n\\nIs there anyone out there who started out Engineering career as an adult? What is your challenge?\\n\\nThanks guys!\"", "title": "Adult pursuing career in Engineering?", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/d59o6i/adult_pursuing_career_in_engineering/"}, {"author": "AmandaSwinyard", "created_utc": 1567529408.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 0, "post_id": "cz7gam", "score": 1, "subreddit": "EngineeringCareers", "text": "\"\"", "title": "Walmart Labs - Looking for Front End Engineers! (JavaScript/React/Node.js)", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringJobs/comments/cz75a9/walmart_labs_looking_for_front_end_engineers/"}, {"author": "ashlill", "created_utc": 1566330641.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 0, "post_id": "ct4z1v", "score": 1, "subreddit": "EngineeringCareers", "text": "\"\"", "title": "Sales Engineer Job Available | ESAB, Multiple Locations", "upvote_ratio": 1.0, "url": "https://video.digi-me.com/esab/jobs/marketing-sales/sales-engineer/X80001&src=DmRi"}, {"author": "None", "created_utc": 1550683292.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 0, "post_id": "asqy85", "score": 2, "subreddit": "EngineeringCareers", "text": "\"\"", "title": "What are some companies who are hiring robotics / mechatronic engineers in the USA / California?", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/asqy85/what_are_some_companies_who_are_hiring_robotics/"}, {"author": "zzzzyzx", "created_utc": 1543186138.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 0, "post_id": "a0dbkm", "score": 1, "subreddit": "EngineeringCareers", "text": "\"Hi fellow engineers,\\n\\nFirst, let me give a little background.  I'm currently working in the Bay Area with a specialization in imaging systems, which consists of optics, image processing, and camera manufacturing.  I have both a BSEE and MSEE, where the MSEE specialized in optics and imaging.  I've been the imaging industry for about 8 years, and have been in the Bay Area since 2013.  Also, I'm 35 years old.\\n\\nNow for my questions.\\n\\nI'm basically locked into a very niche area, which is imaging optics.  It's too specific and there isn't enough day to day work to keep me busy, and the industry is primarily high tech in Silicon Valley.  So I'm in a very small field, in a very geographically isolated and expensive area.  Given that the work is limited, and the cost of living in the Bay Area is atrociously high (with no sign of slowing down), I'm looking for a career change to broaden my opportunities outside of Silicon Valley.  The field of imaging is practically non-existent outside of a handful of Silicon Valley companies (and a few in the Seattle area).  \\n \\nGiven the considerations listed above, I'd like to go into another field that is more related to my EE roots, and I've been thinking about RF engineering (among other paths) due to the solid EE nature of the field.  Anybody working in the RF field?  Any advice on considering this path?\"", "title": "8 years in to a specialty, too focused and want to switch", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/a0dbkm/8_years_in_to_a_specialty_too_focused_and_want_to/"}, {"author": "Arcadia_X", "created_utc": 1522025024.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 0, "post_id": "87555i", "score": 1, "subreddit": "EngineeringCareers", "text": "\"So to preface this, I\\u2019m a junior in High school and for college I\\u2019m looking into a possible career in engineering. I\\u2019m aware of how broad a field engineering has become and I\\u2019ve been doing research into all different kinds of engineering. Three in particular sound the most interesting/ the best fit for me: Electrical, Computer and Mechatronics (as kind of a bridge between the two). I\\u2019m wondering what are the pros and cons of each type. (Job market, availability, schooling, etc.)  \\n\\nAny insight you could offer would be much appreciated, thank you.\"", "title": "Any thoughts?", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/87555i/any_thoughts/"}, {"author": "Snipesinpe", "created_utc": 1521204397.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 0, "post_id": "84v5a8", "score": 1, "subreddit": "EngineeringCareers", "text": "\"I am currently coming close to finishing my undergrad in civil engineering and have begun looking at potential jobs. Everything seems to revolve around municipal Engineering. I have done several co-ops at consulting firms and realized municipal work is not what i want to base my career around. If anyone has some ideas of positions or company\\u2019s i should be looking for that would be a great help. Thanks. \"", "title": "Need help with civil career options", "upvote_ratio": 0.99, "url": "https://www.reddit.com/r/EngineeringCareers/comments/84v5a8/need_help_with_civil_career_options/"}, {"author": "mitengg", "created_utc": 1520404590.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 0, "post_id": "82m9b7", "score": 3, "subreddit": "EngineeringCareers", "text": "\"Do you know what is the biggest issue with present day engineers, they all face a dire demand of experience to get more experience. Anyone who needs to join the workforce must have some experience before they become a part of corporate crowd. But how can you have experience for something that is being taught to you in class theoretically but least significance is given to practical application of what is being taught. A practical work backdrop has huge significance as you are trying to get into job market. It is more about the cutthroat competition that is existent in all parts of the world. It is not only businesses that are standing against each other need an edge but also professionals working in same field.\\n\\nEven the best friend who graduated with you will turn into a stiff competition for being in same market with you. So, where should you look for gaining experience even before you are paid for earning some. The simplest way is to go for internships. It is for this reason, all engineering colleges in India have mandated professional internship for graduating students. There are several benefits of joining a firm as an intern, for engineering students it can make a huge difference in winning or losing a job opportunity. Here are some more add ons to this argument:\\n\\nFirstly, a good internship session opens you up to excellent exposure and reality of market. You will get to know how real world is different from the world of books. You will harness some knowledge, skills and how to deal with everyday problems. It will teach you the challenges that are presently harassing the complete market. Every new thing that you learn in this aspect will be highly useful and worth treasuring for a lifetime. There are so many people out there who stuck with their regular routines, need to stick to their town and attend the same things again and again. An internship can easily take you to new places and help you meet new people. An internship exposes you to a more stable and controlled atmosphere that helps one understand dynamics of market and profession.\\n\\nThe experience you gain while working as an intern helps shaping your professional opinions about things. It will encourage your personal growth and development proving a stepping stone for the professional inside you. It will expose you to the ins and outs of the world you will be working in  and explore what kind of career lines are available for a person of your kind. \\n\\nA good internship experience would also help in building your network  and getting in touch with other professionals in your line of work. You may give a counter argument by attending a networking event eliminating the need for internship, but it would severely restrict your chances of personally interacting with others. Participation in an internship would allow in establishing more personal relationships than the ones that will be formed at an event. Internships also provide one with multiple opportunities for building connections with professionals that can really benefit your career in coming years. \\n\\nLastly, a job interview may provide you with chances for facing someone one-to-one but your resume will be devoid of that chance. An internship with some good firm can always provide you with some perks over those who never had the chance to do that. It can also land you an interview in your dream firm which otherwise wouldn\\u2019t be possible. \\nURL - http://www.mitaoe.ac.in\"", "title": "Understanding The Significance Of Internship For Engineering Students | MITAOE", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/82m9b7/understanding_the_significance_of_internship_for/"}, {"author": "Suzuki4Life", "created_utc": 1519433007.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 0, "post_id": "7zszz5", "score": 2, "subreddit": "EngineeringCareers", "text": "\"I was recently laid off of my engineering job. I want to make a career change and learn to write code (Javascript). What's the best way to learn? I think I'd prefer a classroom setting but open to suggestions. I have a degree in Mechanical Engineering but very little programming experience\"", "title": "I how should I go about learning Javascript in Seattle?", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/7zszz5/i_how_should_i_go_about_learning_javascript_in/"}, {"author": "vijayinausco", "created_utc": 1518261074.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 0, "post_id": "7wkvvy", "score": 1, "subreddit": "EngineeringCareers", "text": "\"\"", "title": "Pros and Cons of Professional Year in Engineering", "upvote_ratio": 1.0, "url": "https://professionalyearprogram.wordpress.com/2018/02/10/pros-and-cons-of-professional-year-in-engineering/"}, {"author": "None", "created_utc": 1515452872.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 1, "post_id": "7p2m8c", "score": 1, "subreddit": "EngineeringCareers", "text": "\"hey everyone I'm sure this has been posted tons of times before but Im looking at college's at the moment and I really like this one course of mechanical engineering because its all practical work, building stuff with your hands and getting a finished project.  But I then looked at the career options and it looks like most the jobs for this course are desk jobs where your managing a team or designing something with CAD.  I like working in teams but a office meeting doesn't interest me.  I'm just wondering what career should I be looking for.  I want something where I design and build  without too much bureaucracy.  I have a few ideas on products but I don't want to be starting up a full business just to get them made.\\n\\ntl;dr\\nwhat type of career should I look for where I get to design and make a product where I'm not involved in too much office bureaucracy.\\nthanks\"", "title": "should I get into engineering as a career", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/7p2m8c/should_i_get_into_engineering_as_a_career/"}, {"author": "doubleohnicole", "created_utc": 1511902528.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 0, "post_id": "7g7e0r", "score": 1, "subreddit": "EngineeringCareers", "text": "\"I currently work as an entry-level software engineer and I hope to eventually move up to an engineering management level. My employer will pay for a portion of my degree, but the amount I would have to pay would still be very expensive for me. So now I'm trying to decide if the time, effort, and expense of getting an MBA is worth it. \\n\\nIs an MBA necessary for moving up into management at most companies?\\n\\nWould a technical Master's degree be more beneficial to my career?\\n\\nFor those of you who have gotten MBAs, are you actually using it? Do you think you could be where you are in your career without it?\\n\\nThanks in advance!\"", "title": "Considering MBA to move up into management", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/7g7e0r/considering_mba_to_move_up_into_management/"}, {"author": "porkspork", "created_utc": 1506558661.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 0, "post_id": "72wkiv", "score": 1, "subreddit": "EngineeringCareers", "text": "\"So i'm located in Ontario Canada. I never finished my BEng, but got my college degree as a Technologist, am working towards my CET and did Uni EE for a year.\\n\\nI currently work in field service for medical (DI) equipment as well as security XRay equipment for the Canadian govt. I make 59k/year, as well as having a company car and cell phone. The job was exciting to start off, but the last 6 months or so have been really stagnant.\\n\\nWe dont have a ton of medical work left, so im stuck doing mostly security (which im not crazy about) and the future as far as contracts go seems uncertain. All it would take would be losing 1 large contract and there would be layoffs.\\n\\nI also travel frequently. ive put about 100k km on my car in 2 years, and fly frequently. Which isnt the worst, my expenses are always 100% paid, but I have a wife, a house, and a baby coming in january. this doesnt usually leave time for a good work/life balance.\\n\\nI recently got a job offer to work For a mid size company (around 170) that does metal manufacturing for airplanes. I applied to work here 3 years ago and didnt get the job. When i went back in to interview they remembered everything about me, said they wished they hired me etc. \\n\\nThe area of work is a bit outside my expertise, to do calibration/repairs/operation for CNC/CMM. In the interview they mentioned they were restructuring and wanted to get me involved in a lot of areas in the company and move to management eventually.\\n\\nThis is a company thats a 25 minute drive from home, and i would work a scheduled 7-3:30 mon-fri. It seems to have better job security, more potential for growth, work life balance, the only downside is the money is less.\\n\\nI mentioned i couldnt take less than 28/hourly. I was told this might be too much, but they would see what they could do. Company also offers twice yearly bonus'.\\n\\nI just want to know if theres any other information i should ask/consider with this offer? The new job seems better in every single way except the money. Doing research on this job (cmm, PC-DMIS etc even re-ignited the passion for engineering that had faded away over the last while with my current job.\\n\\nThanks so much\"", "title": "Career change (medical to manufacturing)", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/72wkiv/career_change_medical_to_manufacturing/"}, {"author": "JohnnyShadow666", "created_utc": 1506020901.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 0, "post_id": "71lfo4", "score": 1, "subreddit": "EngineeringCareers", "text": "\"Hey guys,\\nI graduated this year with a degree in computer science/ Information technology and work as a performance tester. I know this is very late but i really find the software part of computer science dull and boring. I used to want to become a Aerospace engineer in high school but that dream got buried for..- reasons-. I really want to switch my disciplines either to preferrably mechanical or maybe mechatronics. I really want to build stuff and see it working in real world like flying drones,robots,cars,advance machinery(maybe like LHC or Satellites?) etc.and not sit around typing on a PC all day. I recently turned 22 and I think it is unfair that i have to do something i dont like for next ~40 years just cause i didnt study it for 4 years.\\nI'm thinking of masters in either mechanical (again more preferred) or mechatronics with a Phd if required.\\nNot much to say apart from that i am willing to work as hard as required..\\nI could use some advice though on how to do this, change my discipline from CS to Mech. in masters?Other related advice is also appreciated.\\n\\n~A guy that is lost..\\n\"", "title": "Switching from Computer Science to Mechanical or Mechatronics?", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/71lfo4/switching_from_computer_science_to_mechanical_or/"}, {"author": "theevilhillbilly", "created_utc": 1503460779.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 6, "post_id": "6vghmy", "score": 2, "subreddit": "EngineeringCareers", "text": "\"I had an interview today and they asked my salary range, I said 60-65k a year and he said that it was a little high.\"", "title": "Mechanical engineers, how much did you start off at salary wise?", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/6vghmy/mechanical_engineers_how_much_did_you_start_off/"}, {"author": "FermatRamanujan", "created_utc": 1463667125.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 0, "post_id": "4k2mt6", "score": 5, "subreddit": "EngineeringCareers", "text": "\"\"", "title": "Mechanical (or similar) engineers of this subreddit: what does your work consist of?", "upvote_ratio": 0.86, "url": "https://www.reddit.com/r/EngineeringCareers/comments/4k2mt6/mechanical_or_similar_engineers_of_this_subreddit/"}, {"author": "Hero878", "created_utc": 1454318909.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 1, "post_id": "43nqyj", "score": 7, "subreddit": "EngineeringCareers", "text": "\"Hi there\\n\\nI am currently working as an engineer in the energy industry. I just don't think its for me. I don't like my work environment/surroundings. The work can get very technical at times and I feel out of my depth...like an imposter at work lol.\\n\\nWhen I feel like an imposter at work I just nod and say yes. Looks to others like I totally understand...I go away and end up doing whatever it is that I need to do somehow anyway lol. But i don't like it.\\n\\nI wish I worked in a nice office block in the city centre and not some engineering building in the middle of an industrial estate. Sorry if this sounds pretentious. \\n\\nSo which leads me on to the numerous stories I have heard whereby engineers move into industries like IT where the work isn't as hard and they get to work in shiny offices and look like professionals.\\nDoes anyone have any advice or info on such career moves?\\n\\nThanks\"", "title": "Not sure I want to stay in engineering...how to make the move to another industry without pay cut/retraining? i.e. IT", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/EngineeringCareers/comments/43nqyj/not_sure_i_want_to_stay_in_engineeringhow_to_make/"}]