[{"author": "ZadarskiDrake", "author_flair_text": null, "clicked": false, "created_utc": 1707574312.0, "distinguished": null, "edited": false, "id": "1anh74l", "is_original_content": false, "is_self": false, "locked": false, "name": "t3_1anh74l", "num_comments": 627, "over_18": false, "permalink": "/r/jobs/comments/1anh74l/if_this_isnt_the_truth_lol/", "saved": false, "score": 37953, "spoiler": false, "stickied": false, "text": "", "title": "If this isn’t the truth lol", "upvote_ratio": 0.94, "url": "https://i.redd.it/tha95en4nrhc1.jpeg"}, {"author": "maximagent", "author_flair_text": null, "clicked": false, "created_utc": 1706806767.0, "distinguished": null, "edited": false, "id": "1agfpy0", "is_original_content": false, "is_self": false, "locked": false, "name": "t3_1agfpy0", "num_comments": 731, "over_18": false, "permalink": "/r/jobs/comments/1agfpy0/red_bull_declined_my_job_application_so_i_sent/", "saved": false, "score": 28682, "spoiler": false, "stickied": false, "text": "I couldn’t resist.", "title": "Red Bull declined my job application, so I sent this snazzy response", "upvote_ratio": 0.95, "url": "https://i.redd.it/fmcgtlot80gc1.jpeg"}, {"author": "Secure-Marionberry80", "author_flair_text": null, "clicked": false, "created_utc": 1704566509.0, "distinguished": null, "edited": false, "id": "1906s4k", "is_original_content": false, "is_self": false, "locked": false, "name": "t3_1906s4k", "num_comments": 680, "over_18": false, "permalink": "/r/jobs/comments/1906s4k/thank_you_for_all_your_hard_work_and_dedication/", "saved": false, "score": 27133, "spoiler": false, "stickied": false, "text": "", "title": "“Thank you for all your hard work and dedication to the team”", "upvote_ratio": 0.9, "url": "https://i.redd.it/3i1fgqod7vac1.jpeg"}, {"author": "couchtater12", "author_flair_text": "Data Analytics", "clicked": false, "created_utc": 1705066323.0, "distinguished": null, "edited": false, "id": "194v4rm", "is_original_content": false, "is_self": false, "locked": false, "name": "t3_194v4rm", "num_comments": 4448, "over_18": false, "permalink": "/r/jobs/comments/194v4rm/poop_on_your_own_time_dammit/", "saved": false, "score": 20306, "spoiler": false, "stickied": false, "text": "Is this legal?  Does anyone know the Cleveland Clinic’s standard time for a BOW (bowel 🤭) movement?  Imagine getting written up or dinged on your review because you didn’t relax your sphincter and pinch it off quick enough😬 \n\nI get it, these policies stem from people who fuck around and waste time in the bathroom during the workday - but at what point are organizations crossing the line?", "title": "Poop on your own time, dammit! 🤭", "upvote_ratio": 0.94, "url": "https://i.redd.it/7czo3a9lh0cc1.jpeg"}, {"author": "thequirkyquacker", "author_flair_text": null, "clicked": false, "created_utc": 1687240956.0, "distinguished": null, "edited": 1687279087.0, "id": "14e2mvn", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_14e2mvn", "num_comments": 2888, "over_18": false, "permalink": "/r/jobs/comments/14e2mvn/i_was_told_there_is_a_shortage_of_trade_workers/", "saved": false, "score": 19893, "spoiler": false, "stickied": false, "text": "  I was told by everyone how there is a massive shortage of of trade workers these days (with a healthy sprinkle of \"kids don't wanna work hard these days\" obviously) . So here I am 2 years into my electrical apprenticeship and I totally get why no one wants to do this. \n\n  I have worked with 5 separate mechanics in my time and every one of them it's the same story. It's a old guy who's been doing this for years and forgets I just started and don't know what im doing. Instead of training me ( you know, like they are supposed to) I get screamed and yelled at for not understanding everything right off the bat. This is usually followed by a lengthy tirade about \"back in my day when men really worked\" and then more verbal abuse. I have been threatened with physical violence ( \"you keep fucking up I'll beat your ass\" ) and some good old fashioned reminiscing like \" I remember when you could hit your apprentices, those where the good days\". \n\n  Overall, 2 years in and I'm sick of this super macho old school mentality and feel like my progress in regards to actually learning the trade is going nowhere. I'm curious if I just have a unique skill in finding crappy places to work or if others in the trades have experienced similar things.\n\nEdit: I'm truly overwhelmed by the response and it's good to know I'm not alone in this. Thank you everyone for the advice I will definitely try to see if this can be worked out. I will say that my situation is a bit complicated because the guy I work with is partial owner of the company so it makes \"going above his head\" a non possibility.", "title": "I was told there is a shortage of trade workers and now I know why", "upvote_ratio": 0.94, "url": "https://www.reddit.com/r/jobs/comments/14e2mvn/i_was_told_there_is_a_shortage_of_trade_workers/"}, {"author": "rolgriff", "author_flair_text": null, "clicked": false, "created_utc": 1703285217.0, "distinguished": null, "edited": false, "id": "18or2xq", "is_original_content": false, "is_self": false, "locked": false, "name": "t3_18or2xq", "num_comments": 2200, "over_18": false, "permalink": "/r/jobs/comments/18or2xq/happy_holidays_from_my_department/", "saved": false, "score": 19663, "spoiler": false, "stickied": false, "text": "Candy cane was broken and the mix was ripped, they spent more on shipping 🤦‍♂️", "title": "Happy holidays from my department", "upvote_ratio": 0.95, "url": "https://i.redd.it/g6bzn82gdx7c1.jpeg"}, {"author": "LilyPadLover_26", "author_flair_text": null, "clicked": false, "created_utc": 1686052134.0, "distinguished": null, "edited": false, "id": "142dgpf", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_142dgpf", "num_comments": 2202, "over_18": false, "permalink": "/r/jobs/comments/142dgpf/pto_denied_but_im_not_coming_into_work_anyway/", "saved": false, "score": 15755, "spoiler": false, "stickied": false, "text": "My family has a trip planned that will require me take off 1.5 days. I put in the request in March for this June trip and initially without looking at the PTO calendar my boss said “sure that should work”. My entire family got the time approved and booked the trip. She then told me too many people (2 people) in the company region are off that day, but since our store has been particularly slow lately she might be able to make it work but she wouldn’t know until a week before. So I held out hope until this week and she told me there’s no way for it to work. By the way, I’m an overachieving employee that bends over backward any chance I get to help the company. This family vacation is already booked. My family and I discussed it and we think I should just tell her “I won’t be in these days. We talk about a work/life balance all the time and this is it. When it comes between work or time with family, family will always win. I am willing to accept whatever disciplinary action is appropriate, but I will not be coming into work those days.”\n\nThoughts?", "title": "PTO denied but I’m not coming into work anyway", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/jobs/comments/142dgpf/pto_denied_but_im_not_coming_into_work_anyway/"}, {"author": "None", "author_flair_text": null, "clicked": false, "created_utc": 1705333016.0, "distinguished": null, "edited": false, "id": "197bkas", "is_original_content": false, "is_self": false, "locked": false, "name": "t3_197bkas", "num_comments": 2507, "over_18": false, "permalink": "/r/jobs/comments/197bkas/putting_in_a_notice_is_this_acceptable/", "saved": false, "score": 14943, "spoiler": false, "stickied": false, "text": "", "title": "Putting in a notice, is this acceptable?", "upvote_ratio": 0.93, "url": "https://i.redd.it/a5c9qwslimcc1.jpeg"}, {"author": "Beta_Nerdy", "author_flair_text": null, "clicked": false, "created_utc": 1703168787.0, "distinguished": null, "edited": 1703253740.0, "id": "18no8a8", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_18no8a8", "num_comments": 1748, "over_18": false, "permalink": "/r/jobs/comments/18no8a8/my_crazy_boss_has_given_me_a_formal_warning_for/", "saved": false, "score": 14707, "spoiler": false, "stickied": false, "text": "I have been formally warned my job is at risk for having terrible odors!\n\n(If you click on my user name on the Reddit page you will see that I have lots of crazy- but true- stories about a boss that wants me gone.)\n\nI need to hold out 9 more months with the company to get my pension!  If I leave before then my pension will be cut by 50% or more.\n\nIn his latest effort to get rid of me, the boss has pulled me into his office and showed me an official written warning about my bad body odor and bad breath.  He tells me that a number of employees have come to him and complained and said it is nearly impossible to be in the same room as me.  The Facility Human Resources Director was also in the meeting and started to lecture me about personal hygiene.\n\nI told both of them that my personal hygiene, appearance and health is very important to me.  I shower ever day, use high quality soap and deodorant, brush my teeth four times a day  (YES!) and use mouth wash.  I wash my clothes with high quality laundry detergent in a new washer/dryer and don't wear my clothes more than once between washings. They just rolled their eyes and said they don't believe me.\n\nI asked friends and family in and out of the office if I had body odor and bad breath and they said absolutely not.\n\nMy lawyer says we need to demand a formal workforce investigation where an outside neutral party would interview staff to see if there is any truth to my bad breath and body odor.  And look into the toxic workplace I am facing with my boss constantly screaming at me.  My situation gets worse every day!", "title": "My crazy boss has given me a formal warning for having bad breath and body odor!", "upvote_ratio": 0.9, "url": "https://www.reddit.com/r/jobs/comments/18no8a8/my_crazy_boss_has_given_me_a_formal_warning_for/"}, {"author": "fancyfroyo5117", "author_flair_text": null, "clicked": false, "created_utc": 1705640112.0, "distinguished": null, "edited": false, "id": "19ab08r", "is_original_content": false, "is_self": false, "locked": false, "name": "t3_19ab08r", "num_comments": 1298, "over_18": false, "permalink": "/r/jobs/comments/19ab08r/disappointed_after_asking_for_a_raise/", "saved": false, "score": 12790, "spoiler": false, "stickied": false, "text": "I have been with my company for almost 3 years and have not had one yearly review or raise.\n\nFor context, I work in a specialists medical office and I’ve worked in all positions from front desk to verifying insurances to rooming patients and translating. \nAt some point we were extremely short staffed and I (along with two other girls who are no longer with the company) busted my ass working multiple positions and overtime for this office. \nWhen I went on my maternity leave, I worked remotely for them to help catch up on work because they were severely understaffed, especially with me gone. \nAfter my maternity leave ended, I wound up in a position where I needed to move out of state. I ended up staying with the same company and continued working remotely verifying insurances which I am still doing now. \n\nRecently, we have had changes in staff and new management, but the partners and owners of the company have not changed. \nI decided to finally ask for a raise to $20/hr as I feel I’ve been a huge asset to the company and have gone above and beyond to prove my worth. \nI emailed my manager with a letter outlining all of my duties and accomplishments, and how I feel I’ve earned a pay raise especially after three years of never asking for anything. I asked her to please consider my value to the company and give me a raise that will better allow me to meet my financial obligations. \n\nAnd her response honestly feels like a spit in the face. I feel disappointed and honestly disrespected. I understand working remotely has its benefits, but for the amount of work I do, and by myself since I am the only person in the whole office in my position, I would have thought they’d realize how invaluable I am to the company. \n\nThe first screenshot is her response giving me two “options”. The second screenshot is my draft of a response/two week resignation notice.  \n\nI cannot continue working with this company and being undervalued and unappreciated. \nI have two other jobs lined up right now so I definitely have a plan, but I really wanted to stay in the position I’m in.\n\nDo you think my response is okay? Should I change anything about it?\nAny thoughts and advice welcome. TYIA", "title": "Disappointed after asking for a raise", "upvote_ratio": 0.97, "url": "https://www.reddit.com/gallery/19ab08r"}, {"author": "Secretsweetheart1313", "author_flair_text": null, "clicked": false, "created_utc": 1703079683.0, "distinguished": null, "edited": false, "id": "18muutw", "is_original_content": false, "is_self": false, "locked": false, "name": "t3_18muutw", "num_comments": 1244, "over_18": false, "permalink": "/r/jobs/comments/18muutw/the_person_whos_training_me_sent_me_this_text/", "saved": false, "score": 12626, "spoiler": false, "stickied": false, "text": "I clocked in 4 minutes before I was supposed to and she got mad at me she threw down her stuff. Which definitely raises two red flags. One being clocking in 4 minutes early is such an issue and the fact you are so worried the manager will get on to you. Like how bad is the manager????", "title": "The person who's training me sent me this text", "upvote_ratio": 0.92, "url": "https://i.redd.it/g9fdurfaeg7c1.jpeg"}, {"author": "ItsAllOver12345", "author_flair_text": null, "clicked": false, "created_utc": 1683734461.0, "distinguished": null, "edited": 1683743533.0, "id": "13duzbn", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_13duzbn", "num_comments": 5419, "over_18": false, "permalink": "/r/jobs/comments/13duzbn/why_is_it_so_difficult_to_make_over_65000_in_the/", "saved": false, "score": 12376, "spoiler": false, "stickied": false, "text": "It’s insanely difficult to make money, I can barely fathom the competence, stress tolerance, and intelligence required for some of these $150,000+ jobs when it’s nearly impossible to even make $65,000. \n\nHow do people do it?", "title": "Why is it so difficult to make over $65,000 in the US?", "upvote_ratio": 0.86, "url": "https://www.reddit.com/r/jobs/comments/13duzbn/why_is_it_so_difficult_to_make_over_65000_in_the/"}, {"author": "fitchaber10", "author_flair_text": null, "clicked": false, "created_utc": 1691068501.0, "distinguished": null, "edited": 1691125576.0, "id": "15h3yru", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_15h3yru", "num_comments": 2876, "over_18": false, "permalink": "/r/jobs/comments/15h3yru/this_is_absolutely_the_trashiest_job_market_i/", "saved": false, "score": 11064, "spoiler": false, "stickied": false, "text": "I have a masters and 10 years of experience and am struggling since a layoff on 3/31. I get interviews, but apparently companies are getting so many applicants it doesn't matter.\n\nAnyone else feel this way? I last looked for a job unemployed during the great recession and not even that was this bad...\n\nConstant ghosting, internal picked over me or no one hired and position still \"open\" months later.\n\nFuck this job market. The only jobs that exist are low pay trash jobs no one wants.", "title": "This is absolutely the trashiest job market I have seen in my 34 years alive.", "upvote_ratio": 0.93, "url": "https://www.reddit.com/r/jobs/comments/15h3yru/this_is_absolutely_the_trashiest_job_market_i/"}, {"author": "Responsible-Plenty64", "author_flair_text": null, "clicked": false, "created_utc": 1699384956.0, "distinguished": null, "edited": false, "id": "17q23jb", "is_original_content": false, "is_self": false, "locked": false, "name": "t3_17q23jb", "num_comments": 347, "over_18": false, "permalink": "/r/jobs/comments/17q23jb/boss_text_me_when_i_was_5_minutes_late_for_my/", "saved": false, "score": 10771, "spoiler": false, "stickied": false, "text": "They baited me with $19/hr, had me running a whole kitchen in a busy restaurant after they trained me on half of it, and refused to pay more than $17/hr because I “needed more training, and needed to be louder with people about portioning” but refused to train me.\n\n(I’m in Ontario, Canada, minimum wage is $16.50/hr, with the hours I was getting I was making $14/wk more than minimum wage, after tax)", "title": "Boss text me when I was 5 minutes late for my shift, I text back 20 minutes later", "upvote_ratio": 0.94, "url": "https://www.reddit.com/gallery/17q23jb"}, {"author": "jayy_tw", "author_flair_text": null, "clicked": false, "created_utc": 1702004560.0, "distinguished": null, "edited": false, "id": "18dd1p0", "is_original_content": false, "is_self": false, "locked": false, "name": "t3_18dd1p0", "num_comments": 1825, "over_18": false, "permalink": "/r/jobs/comments/18dd1p0/having_a_fever_and_feeling_unfit_to_make_it_in/", "saved": false, "score": 10448, "spoiler": false, "stickied": false, "text": "I was feeling fine at work today, but as I drove home. I rapidly started sweating and having a throbbing headache so I took a test. I sent this picture letting him know I could not make it tomorrow. For context, the reason for the “bad timing” statement is the fact he texted me off work hours just before I took this test and when I was already feeling unwell. Is it me being unreasonable to excuse myself so I can care for my health? Will I really disappoint because so much of the team do rely on me for a lot of information and getting work done? I don’t feel he respects my personal needs or simply does not have the awareness, but also i truthfully don’t want to let the team down if possible. \n\nI did inform both a general manager and second-hand manager who were both understanding. (They’re quite occupied with lots of matters so mention to consider this guy i’m texting “My Boss”.\n\nHow should I even respond to him or this case? Should I just go straight to HR? What are your guys’ opinions?", "title": "Having a fever and feeling unfit to make it in. “Boss” responded with this. What do I even say in this case?", "upvote_ratio": 0.95, "url": "https://i.redd.it/bvkzck0elz4c1.jpg"}, {"author": "KarmaKarmaChameIeon", "author_flair_text": null, "clicked": false, "created_utc": 1689185514.0, "distinguished": null, "edited": false, "id": "14xw4zi", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_14xw4zi", "num_comments": 2649, "over_18": false, "permalink": "/r/jobs/comments/14xw4zi/we_made_a_mistake_on_your_job_offer_20_pay_cut/", "saved": false, "score": 9875, "spoiler": false, "stickied": false, "text": "So I recently signed a job offer with a giant company and once I looked at my actual salary in the system it did not match my offer letter. I pointed this out to the HR department (supported with evidence in my offer letter) and basically they said that they made a mistake and my compensation is 20% lower! I don’t think I have the money or the patience to sue a giant multinational corporation. Nor do I stand a chance. My supervisor just sort of acts like we are all at the mercy of HR and it’s not like HE made the mistake. Plus I still want to work for them! It’s a well paying job even after the 20% cut. Anything I can do besides just take it?!", "title": "“We made a mistake on your job offer” - 20% pay cut after accepting and onboarding with giant company. Anything I can do?", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/jobs/comments/14xw4zi/we_made_a_mistake_on_your_job_offer_20_pay_cut/"}, {"author": "OlympicAnalEater", "author_flair_text": null, "clicked": false, "created_utc": 1696038658.0, "distinguished": null, "edited": false, "id": "16vuahk", "is_original_content": false, "is_self": false, "locked": false, "name": "t3_16vuahk", "num_comments": 340, "over_18": false, "permalink": "/r/jobs/comments/16vuahk/finding_a_job_in_2023_be_like/", "saved": false, "score": 9803, "spoiler": false, "stickied": false, "text": "", "title": "Finding a job in 2023 be like:", "upvote_ratio": 0.98, "url": "https://i.redd.it/q8bwh6iptarb1.png"}, {"author": "headab0vewat3r", "author_flair_text": null, "clicked": false, "created_utc": 1694457007.0, "distinguished": null, "edited": false, "id": "16g32s4", "is_original_content": false, "is_self": false, "locked": false, "name": "t3_16g32s4", "num_comments": 764, "over_18": false, "permalink": "/r/jobs/comments/16g32s4/is_it_legal_for_my_boss_to_tell_me_im_resigning/", "saved": false, "score": 9585, "spoiler": false, "stickied": false, "text": "I work for a medical facility. I was made aware that people who were contagious were made to come into work. I expressed my concern as I have a compromised family member. Was told that clinic policy requires you to find coverage UNLESS you are febrile, so despite being contagious since management wouldn't find coverage for them they would have to work. I said to this \"I understand you have policies for a reason and have to uphold them. That being said I do not see there being any positive outcome to this conversation so I am removing myself\". We use WhatsApp for work communication. I simply removed myself from the conversation. My boss is very toxic and I was not going to make my mental health worse over it. I then received this message (see attached screenshot). I know Texas does not have many employee protections but would it have been considered wrongful termination to have told me that I'm resigning?", "title": "Is it legal for my boss to tell me I'm resigning (Texas)", "upvote_ratio": 0.96, "url": "https://i.redd.it/r1yto3dm6onb1.png"}, {"author": "penguincrackers2019", "author_flair_text": null, "clicked": false, "created_utc": 1703301220.0, "distinguished": null, "edited": false, "id": "18owas7", "is_original_content": false, "is_self": false, "locked": false, "name": "t3_18owas7", "num_comments": 394, "over_18": false, "permalink": "/r/jobs/comments/18owas7/company_gifted_us_all_a_25_doordash_credit_for/", "saved": false, "score": 9027, "spoiler": false, "stickied": false, "text": "The deadline to use the credit was today. Now they are pushing it back til the 26th in hopes they “fix the issue”…", "title": "Company gifted us all a $25 DoorDash credit for Christmas. This is what happens when we try to use it.", "upvote_ratio": 0.98, "url": "https://i.redd.it/jidwnj51py7c1.jpeg"}, {"author": "manofandonamission1", "author_flair_text": null, "clicked": false, "created_utc": 1683208319.0, "distinguished": null, "edited": false, "id": "137lbn6", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_137lbn6", "num_comments": 1705, "over_18": false, "permalink": "/r/jobs/comments/137lbn6/why_do_employers_force_you_to_work_in_office_all/", "saved": false, "score": 8826, "spoiler": false, "stickied": false, "text": "I work as a digital marketer and I have to work Monday-Friday, 9-5 in office. Yesterday I was sick, and since our boss is away and the second in command was out, I was allowed to work from home. The difference in quality of life is incredible. I signed into Canva on my computer, pulled up the company software and image database, logged into my email, and boom I was set for the day.\n\nI worked a flawless day from the comfort of my own home. I was able to run to Petco to grab some supplies for my pets, run to get some lunch without feeling rushed, and eat peacefully in my kitchen instead of surrounded by phones ringing and customers walking around. Today I'm back in office surrounded by my annoying coworkers, having to deal with all their nonstop talking, loud sounds, pointless questions, and coffee making. I've been here for 50 minutes and I'm already way more miserable.\n\nAnd it just begs the question, why do employers force employees who can easily do their job at home to come into the office all week? Seems nonsensical.", "title": "Why do employers force you to work in office all week for a job that can easily be done at home?", "upvote_ratio": 0.9, "url": "https://www.reddit.com/r/jobs/comments/137lbn6/why_do_employers_force_you_to_work_in_office_all/"}, {"author": "kkkan2020", "author_flair_text": null, "clicked": false, "created_utc": 1703432921.0, "distinguished": null, "edited": false, "id": "18pxpbm", "is_original_content": false, "is_self": false, "locked": false, "name": "t3_18pxpbm", "num_comments": 205, "over_18": false, "permalink": "/r/jobs/comments/18pxpbm/your_salary_wont_be_very_good_starting_out/", "saved": false, "score": 8339, "spoiler": false, "stickied": false, "text": "", "title": "your salary won't be very good starting out...", "upvote_ratio": 0.96, "url": "https://i.redd.it/bs1y9jnkk98c1.png"}, {"author": "txlario", "author_flair_text": null, "clicked": false, "created_utc": 1690482112.0, "distinguished": null, "edited": 1690491003.0, "id": "15b9a1s", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_15b9a1s", "num_comments": 1572, "over_18": false, "permalink": "/r/jobs/comments/15b9a1s/i_was_fired_after_walking_in_on_my_boss_watching/", "saved": false, "score": 8149, "spoiler": false, "stickied": false, "text": "I was through a temp agency. I walked in on my boss watching porn and today they fired me. This happened a couple of weeks ago and I didn’t know what to do.\n\nMy mistake was confiding in 2 of my coworkers and asking them for advice on who I should go to. I decided to just bury the event and was later fired today and I guess they’ve been trying to replace me for awhile now.\n\nI didn’t feel 100% comfortable after this event and am trying to look at this as a positive but just feel so shitty that they didn’t even get my side of the story or see if i was okay. \n\nFrom what i hear they tried to say I was spreading rumors (i’m guessing the 2 coworkers i asked for advice spoke about it later on) but I just feel so sad that no one decided to see if i was okay, and why isn’t my boss getting reprimanded for literally watching porn in an open office in front of his employees.\n\nedit: i also wanted to add i brought it up to my coworkers due to my boss shifting attitudes after i caught him. he was cold and dismissive and when i needed help or info he would avoid me or ignore me. So i asked them for advice on what i should do since ive never been in that situation before.\n\nNot saying my actions were right i just wanted to give a little more context.", "title": "I was fired after walking in on my boss watching porn", "upvote_ratio": 0.93, "url": "https://www.reddit.com/r/jobs/comments/15b9a1s/i_was_fired_after_walking_in_on_my_boss_watching/"}, {"author": "Some-Cat-3454", "author_flair_text": null, "clicked": false, "created_utc": 1694649159.0, "distinguished": null, "edited": false, "id": "16i2z7f", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_16i2z7f", "num_comments": 717, "over_18": false, "permalink": "/r/jobs/comments/16i2z7f/i_tested_positive_for_cocaine_during_a/", "saved": false, "score": 7724, "spoiler": false, "stickied": false, "text": "I had a hair drug test for a state job and I received a letter in the mail that said I failed. I have never even seen cocaine in real life let alone used it. I asked if I could see the results and was told that they don’t do that. I thought that since it would be considered medical records, I would be entitled to it. Because of this, I don’t believe that I failed. Does anyone know if I have any legal recourse or is there a reason that I would fail even though I have never used it?", "title": "I tested positive for Cocaine during a pre-employment drug test", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/jobs/comments/16i2z7f/i_tested_positive_for_cocaine_during_a/"}, {"author": "BlueberryPancakes5", "author_flair_text": null, "clicked": false, "created_utc": 1683290279.0, "distinguished": null, "edited": false, "id": "138kfe0", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_138kfe0", "num_comments": 706, "over_18": false, "permalink": "/r/jobs/comments/138kfe0/i_love_my_95_office_job/", "saved": false, "score": 7447, "spoiler": false, "stickied": false, "text": "My job isn't extravagant and the pay isn't great but after working in retail for 10 years I love working in an office.\n\nI have my own cubicle to myself, I don't have managers hovering over me and micromanaging me all day. I have a set schedule every week which makes it so much easier to plan things. I know I'll have Saturday Sunday off every week and I never have to close again. I can go to the bathroom whenever I want for as long as I want, I can have coffee at my desk, or I can eat snacks at my desk. I can wear cute clothes to work instead of a uniform.\n\nI know a lot of people hate the standard 9-5 job but I just wanted to give a different perspective. I feel like after working in retail for so long it really makes me appreciate it so much more.", "title": "I love my 9-5 office job", "upvote_ratio": 0.94, "url": "https://www.reddit.com/r/jobs/comments/138kfe0/i_love_my_95_office_job/"}, {"author": "Mountain_Molasses769", "author_flair_text": null, "clicked": false, "created_utc": 1691299231.0, "distinguished": null, "edited": 1691300171.0, "id": "15jh5bv", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_15jh5bv", "num_comments": 1000, "over_18": false, "permalink": "/r/jobs/comments/15jh5bv/reasons_why_this_job_market_is_horrible/", "saved": false, "score": 7194, "spoiler": false, "stickied": false, "text": "1. **Skeleton Crews.** Basically, if one person is doing the work of three people with the same pay why hire more?  Who cares if that person is stressed out? Business is still running as usual and will hold out as long as they can. By not hiring more and keeping the headcount low, profit goes up and whoever is in the upper management gets a nice bonus.\n2. **False Hiring and PPP Loans.** Ranging from small businesses to large corporations, many have received Payment Protection Program (PPP) Loans that were supposed to be used for payroll and other expenses during the pandemic. However, many of the loans were abused and pocketed by owners and then later forgiven. A condition for these loans to be forgiven is if a company is \"actively\" trying to hire but cannot fulfill these positions. That's why people are struggling to get interviews as well as seeing jobs being posted over and over again. They had no intention to hire in the first place. Basically, it was a huge money transfer and the top ate well.\n3. **Everyone is hiring.** No, they are not. Only retail and fast food positions that barely pay a living wage and high stressed are only hiring is what they mean. Not the comfy white-collar jobs with good benefits cause who would give that up? Even then, these places are running on skeleton crews as well.\n4. **Mass Layoffs.** You have now a lot of people including whom have more than 12+ years of experience looking for jobs now. A good chunk of them are willing to take lower-paying jobs because they have no choice but to put food on the table and pay bills. Now the entry-level or junior-level position you are applying for has become more competitive. Employers have the luxury to be picky and want a unicorn to be a yes man, a bootlicker, someone who does not talk back, who is overqualified, and willing to take a pay cut as well. Also, a lot of these companies have a \"monkey see monkey do\" mentality. Once a couple of companies started doing layoffs, then other companies started doing it only because \"it must be the right thing to do right now\"\n5. **The Feds actually want unemployment to go up.** They want it to go up because the justification is that no job = no money = reduction in savings = lower purchasing power = reduction in inflation. Higher interest rates would lead more people to hold off on purchases they do not need which put less money in circulation and bring down inflation according to the federal government. Also, Powell said it is to \"discipline labor\" as well. But of course, there isn't a problem with corporations making record profits during high periods of inflation. It is estimated that 70% of inflation came from price gouging in which corporations raised the price more than they needed to and mask it as inflation. Anything but to tax the rich right? I'm sure trickle-down will happen anytime soon.\n6. **Anti- WFH Propaganda.** Throughout the pandemic, multiple reports proved that WFH has increased productivity and worker well-being that has not been seen pre-pandemic. WFH was positively received. But all of a sudden Return-to-Office was necessary as WFH wasn't working even though as long you have a computer, desk, and WI-FI, the same work that can be done at the office, can be done better from home in most people's cases. This is later revealed that a lot of bigger players are tied up in real-estate investment of these corporate buildings and that tax revenue around the surrounding areas has decreased as well which the local government does not like.  If you WFH, there is no need to buy food on the way to work or buy expensive lunch downtown, and then waste money on gas. However, with the big RTO push, a lot of employees are either resigning or outright refusing because why would you go backward on quality of life?  I even was disqualified from an interview for asking about remote policy but it is what it is. Remote work is in hot demand yet employers refuse to acknowledge it.\n\nThere's more to why the job market is trash right now of course but this is JMO from all the reports and posts I have been reading. Feel free to add or even counter any of the points I made. Any comments are appreciated", "title": "Reasons why this job market is horrible.", "upvote_ratio": 0.94, "url": "https://www.reddit.com/r/jobs/comments/15jh5bv/reasons_why_this_job_market_is_horrible/"}, {"author": "kumakuma1212", "author_flair_text": null, "clicked": false, "created_utc": 1706656798.0, "distinguished": null, "edited": false, "id": "1af2n9f", "is_original_content": false, "is_self": false, "locked": false, "name": "t3_1af2n9f", "num_comments": 513, "over_18": false, "permalink": "/r/jobs/comments/1af2n9f/this_just_happened_to_me_not_a_95_increase_but_36/", "saved": false, "score": 7191, "spoiler": false, "stickied": false, "text": "", "title": "This just happened to me. Not a 95% increase but 36%. I am laughing sooooo hard", "upvote_ratio": 0.98, "url": "https://i.redd.it/cqew4egounfc1.png"}, {"author": "Raspberry_Anxious", "author_flair_text": null, "clicked": false, "created_utc": 1685562758.0, "distinguished": null, "edited": 1685626246.0, "id": "13ww59x", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_13ww59x", "num_comments": 829, "over_18": false, "permalink": "/r/jobs/comments/13ww59x/my_interviewer_is_1_hour_late_should_i_just_leave/", "saved": false, "score": 6973, "spoiler": false, "stickied": false, "text": "I have a job interview and arrived on time. His staff told me he is running late, so I have been sitting alone in a back room for an hour. \n\nShould I stay, try to reschedule, or just leave? Because this feels very unprofessional.\n\nI’m 22, haven’t had many interviews before. Is this normal?\n\n\nUpdate: just had the interview, this guy doesn’t apologize for being late, just tells me “thanks for waiting”. \n\nHe didn’t mention a single thing about the job, my pay, or even what I’d be doing. Then offers me the job immediately. I said no and left.\n\n\n\nEdit: Wow this blew up like crazy! I see a lot of questions so I’ll try to answer some here. \n\nPrior to this interview I had a zoom one with two ladies. They were both professional and respectful, which is the main reason I waited so long for this one. \n\nI was already skeptical waiting, but decided to stick it through because I had already spent like 40 mins sitting there. After I met the guy, I immediately knew I didn’t want to work for him. That’s why I didn’t ask any questions about pay, hours, etc. \n\nThe interview in total lasted maybe 10 mins. He asked for my availability, and the basic “what are your skills, how can they apply here” type of questions. But that was really it, nothing about the actual job, pay, or what I’d be doing. He asked if I had any questions to which I said no. Then said they are looking to hire immediately and asked if I wanted the job.", "title": "My interviewer is 1 hour late. Should I just leave?", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/jobs/comments/13ww59x/my_interviewer_is_1_hour_late_should_i_just_leave/"}, {"author": "Baby_Hippos_Swimming", "author_flair_text": null, "clicked": false, "created_utc": 1684698378.0, "distinguished": null, "edited": 1684761965.0, "id": "13o4cot", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_13o4cot", "num_comments": 626, "over_18": false, "permalink": "/r/jobs/comments/13o4cot/i_hate_researching_a_company_for_interviews_and/", "saved": false, "score": 6762, "spoiler": false, "stickied": false, "text": "Anyone else? Or do I just have a particularly bad attitude?\n\nEDIT - Wow, I didn't expect my petty little complaint to get so many upvotes. I guess many of you found this relatable. \n\nTo those of you saying \"why don't you only apply to companies you are passionate about?\" I'm a GenXer, my generation has a good work ethic but mostly sees employment as a transactional relationship. It's extremely rare that I'm going to be passionate about any major corporation. They're not passionate about me, they'll lay my ass off in a heartbeat if it increases shareholder value.", "title": "I hate researching a company for interviews and pretending like I'm so enthusiastic about what they do when 9 times out of 10 I couldn't care less.", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/jobs/comments/13o4cot/i_hate_researching_a_company_for_interviews_and/"}, {"author": "notABadGuy3", "author_flair_text": null, "clicked": false, "created_utc": 1689844882.0, "distinguished": null, "edited": false, "id": "154lxsz", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_154lxsz", "num_comments": 634, "over_18": false, "permalink": "/r/jobs/comments/154lxsz/i_walked_out_of_a_job_interview/", "saved": false, "score": 6510, "spoiler": false, "stickied": false, "text": "This happened about a year ago. I was a fresh computer science graduate looking for my first job out of university. I already had a years experience as I did a 'year in industry' in London. I'd just had an offer for a London based job at £44k but didn't really want to work in London again, applied hoping it was a remote role but it wasn't.\n\nAnyway, I see this job for a small company has been advertised for a while and decided to apply. In the next few days I get a phone call asking me to come in. When I pull into the small car park next to a few new build houses converted to offices, I pull up next to a gold plated BMW i8. Clearly the company is not doing badly.\n\nGo through the normal interview stuff for about 15mins then get asked the dreaded question \"what is your salary expectation?\". I fumble around trying to not give exact figures. The CEO hates this and very bluntly tells me to name a figure. I say £35k. He laughed. I'm a little confused as this is the number listed on the advert. He proceeded to give a lecture on how much recruitment agencies inflate the price and warp graduates brains to expect higher salaries. I clearly didn't know my worth and I would be lucky to get a job with that salary. I was a bit taken aback by this and didn't really know how to react.\nSo I ask how much he would be willing to pay me. After insulting my github portfolio saying I should only have working software on there he says £20k.\nAt this point I get up, shake his hand, thank him for the time and end the interview.\n\nI still get a formal offer in the form of a text message, minutes after me leaving. I reply that unfortunately I already have an offer for over double the salary offered so will not be considering them any further. It felt good.", "title": "I walked out of a job interview", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/jobs/comments/154lxsz/i_walked_out_of_a_job_interview/"}, {"author": "targlo", "author_flair_text": null, "clicked": false, "created_utc": 1689710722.0, "distinguished": null, "edited": false, "id": "1538ter", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1538ter", "num_comments": 2263, "over_18": false, "permalink": "/r/jobs/comments/1538ter/new_coworker_keeps_farting_in_the_cubicle_next_to/", "saved": false, "score": 6450, "spoiler": false, "stickied": false, "text": "Basically the title. It’s gross and I can smell it. Somtimes it’s pretty loud too like he isn’t hiding it. It’s so disturbing.\n\nBackground: I work as a programmer in tech. Our office has many programmers in cubicles next to one another. It’s a nice place and I like the job, bosses, and everyone. \n\nWe recently got a new programmer. There are other personality traits I don’t particularly favor, but they are tolerable and can be overlooked.\n\nBut the farting is really getting to me.\nIt’s gross and seems to happen always at the end of the day when there are less people in the office. I’m directly behind him and I can hear and smell the farts. \n\nI don’t know what to do, tell my boss? Confront him and ask if he could stop? LOL. It’s so weird I don’t even know how to approach it.\n\nIt’s comes to the point I just leave the room when he farts becuase why would I want to smell his farts.\n\nThis isn’t a joke post, I really don’t know what to do", "title": "New coworker keeps FARTING in the cubicle next to me.", "upvote_ratio": 0.92, "url": "https://www.reddit.com/r/jobs/comments/1538ter/new_coworker_keeps_farting_in_the_cubicle_next_to/"}, {"author": "veshterka", "author_flair_text": null, "clicked": false, "created_utc": 1704875172.0, "distinguished": null, "edited": false, "id": "1933ihi", "is_original_content": false, "is_self": false, "locked": false, "name": "t3_1933ihi", "num_comments": 1605, "over_18": false, "permalink": "/r/jobs/comments/1933ihi/is_it_just_me_or_is_this_the_most_passive/", "saved": false, "score": 6429, "spoiler": false, "stickied": false, "text": "", "title": "Is it just me? or is this the most passive aggressive job rejection email ever?", "upvote_ratio": 0.95, "url": "https://i.redd.it/5ly1jhz6pkbc1.jpeg"}, {"author": "MrIrrelevant-sf", "author_flair_text": null, "clicked": false, "created_utc": 1706040031.0, "distinguished": null, "edited": 1706110402.0, "id": "19dxf5t", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_19dxf5t", "num_comments": 718, "over_18": false, "permalink": "/r/jobs/comments/19dxf5t/my_coworker_share_her_screen_accidentally_showing/", "saved": false, "score": 6302, "spoiler": false, "stickied": false, "text": "We were in teams meeting. I was assisting and she was sharing a document on her screen. She accidentally showed her chat window where she and another lady were chatting about how I have a very thick accent and my English is “broken”.\n\nI have been in the United States for 24 years. Graduated from Virginia tech with a dual masters degree. I am by no means perfect by damn I can’t do nothing about my accent.\n\nI wish I haven’t seen that chat. I actually really liked this lady and she is nothing but sweet to me when we talk on the phone. \n\nI don’t plan on even acknowledging I saw the chat. I guess I am just sad. My job is super stressful and difficult and I am doing the best I can.\n\nETA: wow this blew up. Thanks y’all. The support of this community made my day. \n\nETA2: I reported this to my employer. Thanks everyone for your kind comments, I am trying to read them all. Thank you so much.\n", "title": "My coworker share her screen accidentally showing chats between her and others disparaging me.", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/jobs/comments/19dxf5t/my_coworker_share_her_screen_accidentally_showing/"}, {"author": "Alarming-Divide3659", "author_flair_text": null, "clicked": false, "created_utc": 1683669731.0, "distinguished": null, "edited": false, "id": "13d7kco", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_13d7kco", "num_comments": 1987, "over_18": false, "permalink": "/r/jobs/comments/13d7kco/first_office_job_this_is_depressing/", "saved": false, "score": 6112, "spoiler": false, "stickied": false, "text": "I just sit in a desk for 8 hours, creating value for a company making my bosses and shareholders rich, I watch the clock numerous times a day, feel trapped in the matrix or the system, feel like I accomplish nothing and I get to nowhere, How can people survive this? Doing this 5 days a week for 30-40 years? there’s a way to overcome this ? Without antidepressants", "title": "First office job, this is depressing", "upvote_ratio": 0.87, "url": "https://www.reddit.com/r/jobs/comments/13d7kco/first_office_job_this_is_depressing/"}, {"author": "cousingregg", "author_flair_text": null, "clicked": false, "created_utc": 1688833007.0, "distinguished": null, "edited": 1688843880.0, "id": "14u8dad", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_14u8dad", "num_comments": 664, "over_18": false, "permalink": "/r/jobs/comments/14u8dad/just_got_my_first_6_figure_job_offer_just_wanted/", "saved": false, "score": 6047, "spoiler": false, "stickied": false, "text": "Hi everyone! I don't have too many people I can talk about this with, so I just wanted to share the news with someone. I work in software, and my current pay is $75k per year. The short version of my past few years is that I dropped out of college and have been making $45k/ year for a while pre-COVID. From there, 2020 hit me really hard. I was unemployed for about 6 months. I was looking for $18/hour jobs, then I got an opportunity in software sales. I started at a base salary of $50k per year. I got promoted once and then moved over to operations within my company, and my salary went up to $75k (where it is now).\n\n&#x200B;\n\nHaving been at my current company for 3 years, I've known that I was underpaid compared to the market for a while, so I started looking a few months ago. I applied to this job that's a manager-level position, which is one level above my current role. I had my final round interview at this company last week and it went pretty well. \n\n&#x200B;\n\nThe hiring manager set some time with me yesterday afternoon. When we hopped on the call, we talked for a few minutes before she offered me the job! $120k per year! In the moment, I didn't react much outwardly or inwardly beyond being pleasant and expressing thankfulness and excitement about the offer. I was trying to keep my hand close to my vest I suppose. I ended up thanking her and agreeing to follow up on Monday after I had the weekend to think about it (as I was in the process of a few other interviews as well). \n\n&#x200B;\n\nFor the hour after we hopped off Zoom, I didn't feel much. Then the offer letter hit my inbox. Seeing $120,000 in black and white is when it hit me. $10,000/month. I broke down and started crying. That's more money than I've ever made before by a long shot. I wanted to call my dad and tell him because I know that he'd be proud. He died in 2020, so I got hit with a wave of emotions from excitement to relief, to grief hitting me super hard. I've had a lot of money stress over the past few years, and this feels like a game changer. I'm hoping that this will accelerate my ability to build up savings and I want to be smart with it.\n\n&#x200B;\n\nAnyway, that's my ramble. Thanks for listening. Today I'm excited and am looking forward to accepting on Monday. I still wish I could call my dad up and tell him though; I know he'd be happy.\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\nEdit: wow, I appreciate all the love! The positivity is really great to see.", "title": "Just got my first 6 figure job offer! Just wanted to share with someone", "upvote_ratio": 0.92, "url": "https://www.reddit.com/r/jobs/comments/14u8dad/just_got_my_first_6_figure_job_offer_just_wanted/"}, {"author": "RealPrinceZuko", "author_flair_text": null, "clicked": false, "created_utc": 1693944105.0, "distinguished": null, "edited": 1694044926.0, "id": "16ayf5l", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_16ayf5l", "num_comments": 940, "over_18": false, "permalink": "/r/jobs/comments/16ayf5l/absolutely_sick_of_the_return_to_office_hit_pieces/", "saved": false, "score": 5926, "spoiler": false, "stickied": false, "text": "Seriously, everyone needs to be fully aware of this. The majority of data does not support in office work vs remote work. Companies were the most profitable they have ever been during the pandemic. Yes, that was also caused by an endless supply of helicopter money, but also because worker engagement was up a ridiculous amount. For me personally, I have never worked as hard as I have during the last few years, and I am fully remote.\n\nThe REAL reason for all these stupid articles is the commercial real estate situation. Companies are losing money (on paper) because their real estate values have all declined. Forcing employees back to the office would create more demand for surrounding homes/businesses, and affectively raise their portfolio value.\n\nThe other reason is control. The C-Suites job is to \"inspire\". They don't feel a sense of purpose without having you, the worker bee, around for them to view. They want to see you building their pyramid for them, even if it can be done remotely and more efficiently. It's a psychological thing that sociopaths in the C-Suite need. They're losing control, and they want to have it back to be more valuable since their perceived value is about steering the ship and not contributing anything meaningful.\n\nJust wanted to share and vent because I'm sick of this narrative. Remember the truth and ALWAYS bring it up.\n\nEDIT: Wow...I didn't expect to get this many responses. I just wanted to add that yes, there is frustration in my voice. I'm tired. I'm tired of the constant squeeze corporations apply to all of us daily. It's always happened throughout history, but it is MUCH worse now. Profit over People has never been more rampant then it is now. \n\nThe truth is, I believe this country is in desperate need of a workers rights movement. I would LOVE to see every talented individual out there push back against this RTO narrative that is solely based off \"a gut feeling\" from a handful of people. I'm just tired of being lied to, and it's a constant fight to keep the truth alive.\n\nAlso, to everyone that is saying things like \"suck it up and deal with it\", you're part of the problem. That dismissive attitude means you aren't open to change, and just accept things the way they are. You can change anything you want in this world, you just have to get enough people to say \"No\".\n\nTake care", "title": "Absolutely sick of the return to office hit pieces", "upvote_ratio": 0.91, "url": "https://www.reddit.com/r/jobs/comments/16ayf5l/absolutely_sick_of_the_return_to_office_hit_pieces/"}, {"author": "euphoricunknown", "author_flair_text": null, "clicked": false, "created_utc": 1699210585.0, "distinguished": null, "edited": false, "id": "17oiv65", "is_original_content": false, "is_self": false, "locked": false, "name": "t3_17oiv65", "num_comments": 1066, "over_18": false, "permalink": "/r/jobs/comments/17oiv65/last_texts_from_my_toxic_ex_boss_lol/", "saved": false, "score": 5881, "spoiler": false, "stickied": false, "text": "Can you believe this guy? The whole thing reminds me of my dad going off through text lol. It was a trash job and at tge end there wasn't anything to be smiling about so he's got me there. His staff was so unfriendly literally wouldn't move out of the way when I'd pass by with a tub of glasses. Also why would I tell them my coworker wasn't coming in? Do I look like a manager go fuck yourself lol. We all quit lol I was the last standing until he pulled that little girl shit lol.", "title": "Last texts from my toxic ex boss lol", "upvote_ratio": 0.9, "url": "https://www.reddit.com/gallery/17oiv65"}, {"author": "None", "author_flair_text": null, "clicked": false, "created_utc": 1684634860.0, "distinguished": null, "edited": false, "id": "13nfwqb", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_13nfwqb", "num_comments": 1405, "over_18": false, "permalink": "/r/jobs/comments/13nfwqb/since_when_did_having_any_bachelor_degree_become/", "saved": false, "score": 5816, "spoiler": false, "stickied": false, "text": "Every. Single. Job. \n\nCould be sticking labels on boxes in a rat infested warehouse.\n\n• Educated to Bachelor degree level \n\n??? \n\nFor entry level positions… literally run of the mill administrative positions. To send emails they want you to have a marketing degree ? \n\nWhat in the flying fu*k is going on. \n\nAm I supposed to just cease to exist or take on 50K+ debt to never earn enough to pay it off but earn just enough to have it deducted from my pay every month???? Whilst the bar raises every year??? And so does the interest. \n\nIt was Age 16 level qualifications then Age 18. Now graduate level… next they’ll want you to have lectured for 10 years in finance at Harvard, Yale, Oxford and Cambridge, interned across 5 major global players and prevented economic disasters to input numbers on a fu*king spreadsheet. \n\nWho’s writing up these person specifications? God?!!?!?!!!", "title": "Since when did having *any* bachelor degree become the base standard for entry level positions?", "upvote_ratio": 0.94, "url": "https://www.reddit.com/r/jobs/comments/13nfwqb/since_when_did_having_any_bachelor_degree_become/"}, {"author": "ItsAllOver12345", "author_flair_text": null, "clicked": false, "created_utc": 1685815680.0, "distinguished": null, "edited": false, "id": "13zkmfl", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_13zkmfl", "num_comments": 2272, "over_18": false, "permalink": "/r/jobs/comments/13zkmfl/how_does_everyone_on_reddit_make_so_much_money/", "saved": false, "score": 5746, "spoiler": false, "stickied": false, "text": "Everyone in my career field that posts on Reddit tells me I’m “underpaid” yet when I go out and look for jobs and get offers it’s for amounts they say shouldn’t be happening. I make 60k almost 4 years after graduating college and they insist that’s way underpaid yet I only see the opposite in the real world. \n\nI see people on here talking about making 150-200k and I don’t even understand how someone can offer you that much money.", "title": "How does everyone on Reddit make so much money?", "upvote_ratio": 0.91, "url": "https://www.reddit.com/r/jobs/comments/13zkmfl/how_does_everyone_on_reddit_make_so_much_money/"}, {"author": "funtonite", "author_flair_text": null, "clicked": false, "created_utc": 1703290655.0, "distinguished": null, "edited": false, "id": "18osz99", "is_original_content": false, "is_self": false, "locked": false, "name": "t3_18osz99", "num_comments": 217, "over_18": false, "permalink": "/r/jobs/comments/18osz99/merry_christmas_from_my_work/", "saved": false, "score": 5723, "spoiler": false, "stickied": false, "text": "Everyone at my job got a Christmas cake!", "title": "Merry Christmas from my work", "upvote_ratio": 0.98, "url": "https://i.redd.it/hw9djh3ltx7c1.jpeg"}, {"author": "Beta_Nerdy", "author_flair_text": null, "clicked": false, "created_utc": 1702311631.0, "distinguished": null, "edited": 1702367791.0, "id": "18fya29", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_18fya29", "num_comments": 3409, "over_18": false, "permalink": "/r/jobs/comments/18fya29/boss_yelled_screamed_and_swore_at_me_in_red_faced/", "saved": false, "score": 5651, "spoiler": false, "stickied": false, "text": "How does one react when your boss yells, screams and swears at you in a red faced anger?\n\nYes, the typical response is to walk away or quit on the spot.  That would not work in my case.  I now only have 9 months to survive at this job before I am eligible for a full pension of about $70K a year.  If I leave before that date or am fired my pension will be cut by 2/3rds.  Also I could not walk away because he blocked the path to the door.\n\nI have tried to be super polite, work twice as hard and keep my head down but that just gets him angrier, so more yelling and screaming.\n\nThe boss wants me to quit and is trying hard to find a reason to fire me but he was told to stand down after my lawyer worked with the senior management at the parent company.  Now he is trying to unnerve me and psyche me out so I quit.  Physiological warfare!\n\nHis boss and the local HR Director are of no help and senior management at our small office want me gone too.  The only thing helping me survive now is an effective Attorney who helped me submit a formal workplace grievance and oversight by the main corporate office Vice President of HR.\n\nWhat would you do if you were in my shoes?", "title": "Boss yelled, screamed and swore at me in red faced anger for 15 minutes! (Dumbfounded!)", "upvote_ratio": 0.94, "url": "https://www.reddit.com/r/jobs/comments/18fya29/boss_yelled_screamed_and_swore_at_me_in_red_faced/"}, {"author": "Musc3", "author_flair_text": null, "clicked": false, "created_utc": 1690141163.0, "distinguished": null, "edited": false, "id": "157o2hs", "is_original_content": false, "is_self": false, "locked": false, "name": "t3_157o2hs", "num_comments": 1567, "over_18": false, "permalink": "/r/jobs/comments/157o2hs/what_do_yall_think_of_this_kind_of_job_posting/", "saved": false, "score": 5588, "spoiler": false, "stickied": false, "text": "", "title": "What do y'all think of this kind of job posting? Necessary or cringe?", "upvote_ratio": 0.94, "url": "https://i.redd.it/uq4eyb9fprdb1.png"}, {"author": "Falahil", "author_flair_text": null, "clicked": false, "created_utc": 1685372695.0, "distinguished": null, "edited": false, "id": "13uxdwu", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_13uxdwu", "num_comments": 394, "over_18": false, "permalink": "/r/jobs/comments/13uxdwu/i_found_a_remote_job_in_2_months_using_ai_tools/", "saved": false, "score": 5571, "spoiler": false, "stickied": false, "text": "I was laid off a few months ago (together with almost half the people in my company). I was a little bit in panic mode by then. During the first 2-3 months I applied to literally every single PM job offer I saw but I didn’t even pass the second interview. Then a friend explained to me the 3-stage process she used to find her job. She also recommended a few AI tools that ended up being very useful. \n\nAfter 2 months of following her guidelines, I was offered 2 positions! 1 of them with a higher salary than the one I had in my previous company (ironically I took the other one, but for different reasons).   \nI learned that finding a new job is a job in itself. You improve with practice and by failing. So the 3-stage process is designed to iterate fast. In every stage, I focused on “Mastering that stage only” and improving on 1 metric:\n\n**Stage 1 Iterate my Resume**\n\nMy main focus in this stage was to improve the conversion rate of my resume. The metric I used was the % of responses I received. I kept refining and tweaking my resume until I achieved a solid ratio. I started with less than a 5% response rate (from *resume sent* to *first interview scheduled*). \n\nIn a shell I did this:\n\n* Adapt my resume for every position (I used a few tools, mostly kickresume explained below).\n* When describing my previous experience, rephrase it using the exact key words used in the job offer. A lot of companies use software to filter resumes, so if they don’t find certain keywords, you are automatically rejected.\n* Create a cover letter “template” and leave some paragraphs to modify depending on each company.\n* I created a notion page with a more detailed resume, with links to previous projects and a lot of details about me. I added this when asked for a “Website URL” (asked in many offers).\n\nOnce I started getting first interviews with HR managers or hiring managers (1st interview), I shifted my attention to preparing and improving my interview skills.  \n\n\n**Stage 2 First interviews (usually with HR)**\n\nIn this stage, I aimed to increase the number of second interviews or technical exercises I was offered. This was a critical step in progressing further in the hiring process. I made sure to thoroughly prepare for these initial interviews, showcasing my skills and experiences effectively and I used a few tools (below) to practice my interviews.\n\nYou’ll be asked the same questions again and again in these interviews with HR. With Otter you can transcript the meetings. So I created a document with \"Hard Questions in Job Interviews\" as a quick reference during interviews. I have the answers written there for all the typical questions. If you do online meetings, you can keep the doc open on your second screen 😛\n\n  \n **3 Use case (or technical exercise)**\n\nMy metric here was the number of job offers I received. This stage varies a lot depending on your role. I was applying for Product Manager, in case you are also applying for this role let me know and I can give you some examples of exercises I prepared in advance\n\n&#x200B;\n\n Here are the tools that played a significant role in that process: \n\n **1 ChatGPT - Turned into a job interview trainer** \n\n You start by training ChatGPT on your resume. You can use this prompt:\n\n>As ChatGPT, you’ll be participating in an interview simulation for the position of Product Manager at \\_\\_\\_\\_. I’ll provide you with your Resume in an upcoming message. Following that, you’ll receive the interview questions along with guidelines on how to respond. \n\n&#x200B;\n\n Then you copy&Paste your CV on ChatGPT. And you give it this new prompt:\n\n>The focus of this interview will be on your soft skills. When answering questions be clear and concise, using everyday language. Create convincing responses that an interviewer would appreciate even if they are fictional. However, ensure that your answers align with the experiences mentioned in your resume. \n\nThen ask ChatGPT the interview questions you may get and it will be generating perfect responses to any question.\n\n&#x200B;\n\n **2 kickresume.com**  \n\nUse it to improve your resume. You can do several things with it. Start your resume from scratch or modify one, create your cover letter with AI (it uses ChatGPT on the backend), or ask for feedback on your resume. I still needed to do a lot of manual changes in the version it creates but it is a great start. For cover letters, which can be quite a hassle to customize for each job application, it was a real-time-saver. Another option is Rezi, I haven’t tried it yet but it looks promising. \n\n&#x200B;\n\n **3 Wave.ai** \n\nIt provided a written conversation with a real human coach, utilizing AI to offer guidance and assistance. The coaching sessions helped me develop habits for finding the right jobs and mentally preparing for interviews. I used it a lot in stage 2. I would go to Wave with the answers I replied on every interview and they would help me improve them with feedback. Ultimately, they also helped me negotiate the offers. I’m so bad at facing conflict and asking for a higher salary, that my first instinct when I was offered the first job was to say OMG OF COURSE. I was able to raise the salary a bit and also the stock options they gave to me. \n\n&#x200B;\n\n **4 Otter.ai** \n\nYou can use it during your online meetings to take notes. During job interviews, it is not only important the content of your answer, but also how your answer is structured. And the only way to improve this is by practicing. With this tool,  I could review the questions asked and my responses, allowing me to refine and better structure my answers. Write down your answers and then use ChatGPT to improve them and structure them in a way that is easier to understand! \n\n&#x200B;\n\n **5 Interview Warmup (from Google)** \n\nSimilar use to the first one with ChatGPT but in this case they ask you the questions. It simulates a real interview and gives you personalized feedback based on your responses. It can help you identify areas where you need to improve. Also, by practicing with these tools, I felt more confident and prepared for those higher-stakes real interviews.\n\n \n\nI hope this is helpful to you!\n\nAny other tool I should add?", "title": "I found a remote job in 2 months using AI tools and a 3-stage preparation process", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/jobs/comments/13uxdwu/i_found_a_remote_job_in_2_months_using_ai_tools/"}, {"author": "PersonMan42", "author_flair_text": null, "clicked": false, "created_utc": 1705794762.0, "distinguished": null, "edited": false, "id": "19bpn65", "is_original_content": false, "is_self": false, "locked": false, "name": "t3_19bpn65", "num_comments": 242, "over_18": false, "permalink": "/r/jobs/comments/19bpn65/red_flag_phrases_in_job_posts/", "saved": false, "score": 5506, "spoiler": false, "stickied": false, "text": "", "title": "Red flag phrases in job posts", "upvote_ratio": 0.97, "url": "https://i.redd.it/cn58fyycgidc1.jpeg"}, {"author": "errorloadin", "author_flair_text": null, "clicked": false, "created_utc": 1704222912.0, "distinguished": null, "edited": false, "id": "18wxjwa", "is_original_content": false, "is_self": false, "locked": false, "name": "t3_18wxjwa", "num_comments": 517, "over_18": false, "permalink": "/r/jobs/comments/18wxjwa/i_just_want_a_job/", "saved": false, "score": 5381, "spoiler": false, "stickied": false, "text": "😭 like cmon now", "title": "I just want a job", "upvote_ratio": 0.96, "url": "https://i.redd.it/yqcchuxot2ac1.jpeg"}, {"author": "Present-Amoeba-326", "author_flair_text": null, "clicked": false, "created_utc": 1687394504.0, "distinguished": null, "edited": false, "id": "14fomea", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_14fomea", "num_comments": 448, "over_18": false, "permalink": "/r/jobs/comments/14fomea/in_tears_over_doubling_my_income/", "saved": false, "score": 5394, "spoiler": false, "stickied": false, "text": "Just wanted to post my achievement here. I’m going to jump from making ~$35k/year to ~$60k/year in a months’ time. Things are going to be okay.", "title": "In tears over doubling my income.", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/jobs/comments/14fomea/in_tears_over_doubling_my_income/"}, {"author": "vando_commando", "author_flair_text": null, "clicked": false, "created_utc": 1702498611.0, "distinguished": null, "edited": false, "id": "18hq1pj", "is_original_content": false, "is_self": false, "locked": false, "name": "t3_18hq1pj", "num_comments": 327, "over_18": false, "permalink": "/r/jobs/comments/18hq1pj/boss_canceled_our_christmas_party_cause_this/", "saved": false, "score": 5293, "spoiler": false, "stickied": false, "text": "I found out we had canceled the yearly Christmas party / bonus. A multi store owner within a large corporate chain food company allowed our management to instead do this for the staff of say 60 employees per store. Upon completing this project along with a few other miscellaneous gifts (donuts, Doritos, and [get this] oranges,) he told us this gesture was “breaking the bank.” 🙃 love it here.", "title": "Boss canceled our Christmas party cause this broke the bank.", "upvote_ratio": 0.97, "url": "https://i.redd.it/xr27pdnge46c1.jpg"}, {"author": "Hairy-System9153", "author_flair_text": null, "clicked": false, "created_utc": 1706142068.0, "distinguished": null, "edited": false, "id": "19evxmr", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_19evxmr", "num_comments": 904, "over_18": false, "permalink": "/r/jobs/comments/19evxmr/a_year_ago_today_i_made_a_mistake_that_ruined_my/", "saved": false, "score": 5222, "spoiler": false, "stickied": false, "text": "Throwaway since my friends know my Reddit. A year ago I was making good money working for a small tech startup. CEO was an ass but I usually didn’t have to deal with him and I loved my coworkers. I also had just bought a house and spent a chunk of savings on renovations. \n\nA recruiter hits me up and mentions a big salary increase at their company. I figured sure why not talk to them. I had 2 calls and next was to be with the founder. Turns out the founder knew the CEO of my company. He called my CEO and said I was looking around. I was immediately fired with no severance. \n\nSince then I’ve sent out thousands of applications and had tons of interviews. Most companies had 4+ rounds. 3 months later I get an offer but instead of remote like they initially said, they wanted me to work in their office on the other side of the country for six months before going remote. I turned it down figuring another offer would come soon. It didn’t. \n\n I’ve dealt with horrible hiring managers, a couple examples is one asked me about my parents occupations and then turned me down saying they wanted someone who grew up around success so they knew what it looked like. one company had me write a blog as part of the process and months after being ghosted by them I found my blog on their website. I won’t even get into being ghosted, hiring managers showing up late or not at all. \n\nI thought my journey finally came to an end. I accepted an offer. It was 40% less than what they originally said they would pay. I’d also have to travel by train 2 hours each day but I was desperate so I took it. \n\nOn Friday I was informed my offer was rescinded due to restructuring and they won’t reimburse me on my $300 a month train package I had just bought to travel to work. \n\nMy old company is thriving and my old colleagues are still doing well in spite of the market. \n\nMeanwhile I’m out of savings and unemployment ran out a while ago. My house that I was very proud of is now up for sale. my wife who was initially supportive has also now left me saying I can’t provide for her and doesn’t understand how it could be so hard to get a job. \n\nTomorrow I have an interview at a gas station.", "title": "A year ago today I made a mistake that ruined my life", "upvote_ratio": 0.91, "url": "https://www.reddit.com/r/jobs/comments/19evxmr/a_year_ago_today_i_made_a_mistake_that_ruined_my/"}, {"author": "Deathrider66", "author_flair_text": null, "clicked": false, "created_utc": 1707229339.0, "distinguished": null, "edited": false, "id": "1akavw5", "is_original_content": false, "is_self": false, "locked": false, "name": "t3_1akavw5", "num_comments": 142, "over_18": false, "permalink": "/r/jobs/comments/1akavw5/happens_all_the_time/", "saved": false, "score": 5269, "spoiler": false, "stickied": false, "text": "", "title": "Happens all the time.", "upvote_ratio": 0.98, "url": "https://i.redd.it/91myxogc5zgc1.jpeg"}, {"author": "LonelyBiochemMajor", "author_flair_text": null, "clicked": false, "created_utc": 1690568213.0, "distinguished": null, "edited": false, "id": "15c4wzd", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_15c4wzd", "num_comments": 1066, "over_18": false, "permalink": "/r/jobs/comments/15c4wzd/two_separate_interviewers_asked_me_if_i_lived_at/", "saved": false, "score": 5092, "spoiler": false, "stickied": false, "text": "I thought it was a red flag the first time it happened. That company actually ended up offering me a job, but I declined (there were numerous other red flags). \n\nThen in an interview yesterday, the interviewer asked me if I lived with my parents. She then asked if I was interviewing with anyone and whether I’d declined any offers. I said I had. She asked why. I tried to give a non committal answer, but she kept pushing. \n\nAre they even allowed to ask me these questions?? It always makes me uncomfortable, but I’m a recent grad and it’s my first time job hunting like this, so I’m not really sure.", "title": "Two separate interviewers asked me if I lived at home with my parents????", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/jobs/comments/15c4wzd/two_separate_interviewers_asked_me_if_i_lived_at/"}, {"author": "Hater_Magnet", "author_flair_text": null, "clicked": false, "created_utc": 1703367496.0, "distinguished": null, "edited": false, "id": "18pfq6x", "is_original_content": false, "is_self": false, "locked": false, "name": "t3_18pfq6x", "num_comments": 375, "over_18": false, "permalink": "/r/jobs/comments/18pfq6x/from_a_principal_to_the_teachers/", "saved": false, "score": 5000, "spoiler": false, "stickied": false, "text": "So fucking proud of herself that she pulled kids out of class to help her tie ribbons and help her distribute to staff.", "title": "From a principal to the teachers", "upvote_ratio": 0.96, "url": "https://i.redd.it/dzu7yes3648c1.jpeg"}, {"author": "BigBlackCrocs", "author_flair_text": null, "clicked": false, "created_utc": 1680410368.0, "distinguished": null, "edited": false, "id": "129a6t1", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_129a6t1", "num_comments": 408, "over_18": false, "permalink": "/r/jobs/comments/129a6t1/for_the_love_of_all_that_is_holy_please_stop/", "saved": false, "score": 4957, "spoiler": false, "stickied": false, "text": "Entry level game design job: Oops sorry but you need 5 years of AAA experience to work for our small indie company for 20 dollars an hour. It’s the bare minimum I can’t believe you don’t have that experience yet even though you didn’t even graduate college yet. Kids these days… \n\nVery frustrating. Bloated searches \n\nI still apply. Lol", "title": "For the love of all that is holy PLEASE stop putting jobs up as “entry” level and then ask for 3-5 years of experience.", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/jobs/comments/129a6t1/for_the_love_of_all_that_is_holy_please_stop/"}, {"author": "cacaoho", "author_flair_text": null, "clicked": false, "created_utc": 1699079958.0, "distinguished": null, "edited": false, "id": "17nfrim", "is_original_content": false, "is_self": false, "locked": false, "name": "t3_17nfrim", "num_comments": 1005, "over_18": false, "permalink": "/r/jobs/comments/17nfrim/guy_had_a_lot_to_say_after_i_accepted_another_job/", "saved": false, "score": 4901, "spoiler": false, "stickied": false, "text": "", "title": "Guy had a lot to say after I accepted another job", "upvote_ratio": 0.97, "url": "https://i.redd.it/uhhn9kt11ayb1.jpg"}, {"author": "Old-Entertainer3676", "author_flair_text": null, "clicked": false, "created_utc": 1706543737.0, "distinguished": null, "edited": 1706544043.0, "id": "1adyk9a", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1adyk9a", "num_comments": 578, "over_18": false, "permalink": "/r/jobs/comments/1adyk9a/im_deaf_my_boss_might_fire_me_because_i_illegally/", "saved": false, "score": 4871, "spoiler": false, "stickied": false, "text": "I use a speech to text app on my phone which is government funded to allow deaf people to be able to communicate, and it creates a transcript of every call I make. To my knowledge there is no setting to turn off the transcript feature, and it's a separate phone number that people call as opposed to the number that they generally text me at. \n\nIn one of those calls my boss asked that I disclose a private medical issue to the office in order to relieve concerns from people I do not even work with. I was very bothered by this, because he implied that it would improve my performance rating and bonus structure if I were to do so. I complained to HR and showed her the transcript of the call, and now he's saying that it was illegal for me to record that conversation without his consent.\n\nI am already getting a lawyer but I'm very anxious. Am I wasting my money here? He knows that I'm functionally deaf and in fact, he approved my accommodations when I requested a transcription software for in person meetings. How could he not have known our conversation was being recorded?", "title": "I'm deaf. My boss might fire me because I \"illegally\" recorded our phone conversations.", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/jobs/comments/1adyk9a/im_deaf_my_boss_might_fire_me_because_i_illegally/"}, {"author": "kewladria", "author_flair_text": null, "clicked": false, "created_utc": 1683120292.0, "distinguished": null, "edited": 1683121599.0, "id": "136kh70", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_136kh70", "num_comments": 1004, "over_18": false, "permalink": "/r/jobs/comments/136kh70/unlimited_or_flexible_pto_policies_suck_if_your/", "saved": false, "score": 4834, "spoiler": false, "stickied": false, "text": "Rant - I started a job about 10 months ago with a \"flexible\" PTO policy. Essentially, I have unlimited time off, to use at my discretion, up to 2 weeks at a time. I understand the other arguments against these open-PTO policies but something else has become abundantly clear to me having been with this job for about a year now.\n\n&#x200B;\n\nThe problem is, my immediate teammates (there are 5 of us) NEVER take time off. So what ends up happening is, I am the \"slacker\" of the team. I do not hesitate to take a random Friday off if work is slow, and I plan to take whole weeks off for various trips and vacations coming up this summer and fall. All in all, I will probably take 4 weeks of total PTO this year.\n\n&#x200B;\n\nI get my work done on time and am generally well-liked with the company and team, but I feel like an ass because in comparison to the rest of my teammates, I take a lot of time off. I want to be there for my team and pick up some of their work when they take their own time off, but they (as mentioned above) rarely or never take time off, so I have yet been able to prove my ability to be a good teammate. I speak with folks from other departments and they regularly take time off, sharing fun stories about the trips they've taken and the places they've seen - yet another thing I do not get to share with my team because they are too caught up working to speak about anything else besides work.\n\n&#x200B;\n\n/end rant. I am not necessarily looking for any advice here, maybe just some affirmations or similar stories from other people with PTO policies like this. This too could also be used as a point of consideration for anyone weighing the pros/cons of 2 jobs with different PTO policies, I guess.", "title": "\"Unlimited\" or \"Flexible\" PTO policies suck if your teammates never take time off.", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/jobs/comments/136kh70/unlimited_or_flexible_pto_policies_suck_if_your/"}, {"author": "iluvlibras", "author_flair_text": null, "clicked": false, "created_utc": 1691164061.0, "distinguished": null, "edited": false, "id": "15i3lzt", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_15i3lzt", "num_comments": 957, "over_18": false, "permalink": "/r/jobs/comments/15i3lzt/im_fully_employed_but_doing_a_job_search_as_i/", "saved": false, "score": 4829, "spoiler": false, "stickied": false, "text": "Very fortunately, I got an internship with a large company my senior year of college. My interview for this position was 11 minutes long. Now, I’m sure there were some preconceived notions about me that the employer had, but still an 11 minute interview. \n\nI got hired on full-time for this company after graduation, so I did not need to interview at all. Fast forward some months, a chunk of the marketing team is wiped and a bunch of us are jobless at the beginning of 2023. \n\nAgain, fortunately I get a new job that was recommended to me by a connection. This interview was a quick phone interview, and then an in person interview that was max 20 minutes.\n\nNow, I hate this job. It pays the bills, but everyone here hates one specific person that cannot be fired due to them being a family member of the owner (this is a very small company). I just can’t take it anymore and there’s no benefits so it doesn’t feel worth my distress. Only good thing is that it’s the same salary as my previous job.\n\nI’ve been applying to jobs, getting the typical ghosting and rejection emails at 12am from being filtered out by a computer. I encountered something weird today. I got kicked off the candidate list during a second round interview as a no-show. However, they scheduled a time that was outside of my given availability, and I told them twice before the interview that I could not make that time and they just ignored my emails. They asked me to reapply, which NO I AM NOT. \n\nWhy is hiring so WEIRD right now?", "title": "I’m fully employed, but doing a job search as I hate my current job. Why is the hiring/interview process so bad these days?", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/jobs/comments/15i3lzt/im_fully_employed_but_doing_a_job_search_as_i/"}, {"author": "oswaldp333", "author_flair_text": null, "clicked": false, "created_utc": 1690806322.0, "distinguished": null, "edited": 1690806821.0, "id": "15eery0", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_15eery0", "num_comments": 517, "over_18": false, "permalink": "/r/jobs/comments/15eery0/updatemy_new_boss_that_ive_never_met_asked_me_to/", "saved": false, "score": 4664, "spoiler": false, "stickied": false, "text": "First off I want to thank everyone for their advice. It was extremely helpful to have others chime in to validate that this whole situation was extremely odd and inappropriate. It made made me feel confident that I could put a boundary in place that my safety was non negotiable. \n\nNow on to what happened next-Like I said in my previous post I stated I felt unsafe to the owner, they then replied that they could get me a ride to their home (costing close to $200 which gets rid of the theory they didn’t want to rent a space due to money concerns). \nI declined the ride and then repeated my concern about safety going to their home and asked if we could do the training remotely or if we could meet in a public space where I could possibly bring someone. I thought this would make them second guess their behavior because surely any rational person wouldn’t want to make a potential employee feel unsafe? \n\nNOPE that’s not how this went. They sent me long email back telling me that essentially the only way I could have this job is if I go to the owners house. They stated that they cannot hold meetings anywhere but their house due to “information privacy” concerns (please keep in mind this is not a government job or anything where sensitive confidential information would be exchanged). \nThey then went on to say that I could absolutely NOT bring anyone. So bottom line-I would have to show up to their home, alone. The kicker is they then stated that they’re second guessing me as a candidate because I voiced these concerns and they only want “likeminded” “collaborative” employees…\n\nMoral of the story is listen to your gut and stay safe when searching for jobs. I’m not sure what is going on here but I’m happy that I didn’t go. I’m not sure if I should reach out to the job posting site that I originally applied on to let them know about this. I just don’t want anyone else to end up in an unsafe situation because they need a job.  \nThanks again everyone!!", "title": "UPDATE-My new boss that I’ve never met asked me to come to their home.", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/jobs/comments/15eery0/updatemy_new_boss_that_ive_never_met_asked_me_to/"}, {"author": "holdonaminute2023", "author_flair_text": null, "clicked": false, "created_utc": 1682595071.0, "distinguished": null, "edited": false, "id": "130iz1r", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_130iz1r", "num_comments": 451, "over_18": false, "permalink": "/r/jobs/comments/130iz1r/ive_stopped_caring_at_my_admin_assistant_job/", "saved": false, "score": 4645, "spoiler": false, "stickied": false, "text": "I used to respond to all emails. Complete every task by its deadline. Work late into the night to do so. Now I find myself doing the 9 to 5 and not caring about what doesn’t get done during that time \n\nSupervisors know I am overwhelmed. Im no longer fussed by deadlines. \n\nI feel like something broke in me and Im a totally different work/person.  I used to care so much.   Im so done. \n\nIs this normal? A sign of burnout?", "title": "I’ve stopped caring at my admin assistant job after 4 years. I don’t recognize myself anymore and it’s scary.", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/jobs/comments/130iz1r/ive_stopped_caring_at_my_admin_assistant_job/"}, {"author": "peanutbutterndnutela", "author_flair_text": null, "clicked": false, "created_utc": 1707389740.0, "distinguished": null, "edited": false, "id": "1alt3qe", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1alt3qe", "num_comments": 373, "over_18": false, "permalink": "/r/jobs/comments/1alt3qe/i_was_just_100_honest_at_a_job_interview/", "saved": false, "score": 4726, "spoiler": false, "stickied": false, "text": "So I just woke up and I had a phone interview with starling bank. I am so tired of lying in phone interviews just for a minimum wage job when everyone tells me “just be yourself” but that’s not true! Anyway I’m so fed up with interviews so I decided today is the day I fully test the be yourself theory. \nSo I’m sat with a coffee in a cafe- “why would you like to work with starling bank?” - well I need a job “what do you know about starling bank” - to be honest not much other than they’re a bank in my town , “what do you think the role involves” - answering phone calls and live chat “. “How would you do deal with emotive customers” - listen and understand and not add fuel to the fire but other than that there’s not much else I can do . \n“What attracts you to this role” - I need a reliable income\nShe ended the interview with “well I’ve got other interviews today so I’ll let you know” \nAyway I actually enjoyed it, it felt very uncomfortable and everyone in the cafe is staring at me but for fuck sake it’s minimum wage, I’m tired of selling myself - it’s humiliating to do continuously for minimum wage.", "title": "I was just 100% honest at a job interview", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/jobs/comments/1alt3qe/i_was_just_100_honest_at_a_job_interview/"}, {"author": "Lijey_Cat", "author_flair_text": null, "clicked": false, "created_utc": 1692690225.0, "distinguished": null, "edited": false, "id": "15xylec", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_15xylec", "num_comments": 299, "over_18": false, "permalink": "/r/jobs/comments/15xylec/i_have_autism_and_im_weird_i_had_no_idea_i_had/", "saved": false, "score": 4636, "spoiler": false, "stickied": false, "text": "My boss said to me today, \" (My name), thank you for always making me smile and laugh. You are a bright spot to the day.\"\n\n\n\nI work from home. So, all of our communications for my company and team are done through Microsoft Teams Chat. Honestly, working from home has been a huge boost to my career development.\n\nFor some reason, I feel so much more confident when people aren't staring at me in person. Honestly, that extra confidence makes me really want to help others and put smiles on their faces. \n\nI guess my boss noticed. I didn't know people actually enjoyed the things I said. I figured they just thought I was a weirdo. That's how most people think of me anyway.\n\nAutism comes with its challenges. The world doesn't see me in the ways that I wish it would. Hearing this from my boss really made my day.\n\nSocializing doesn't come naturally for me. But when I work from home, I don't have to think about it nearly as much as I do when I'm in person. It's such a relief.", "title": "I have autism and I'm weird. I had no idea I had this effect on other people.", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/jobs/comments/15xylec/i_have_autism_and_im_weird_i_had_no_idea_i_had/"}, {"author": "TunbridgeWellsGirl", "author_flair_text": null, "clicked": false, "created_utc": 1684002705.0, "distinguished": null, "edited": false, "id": "13gp1jd", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_13gp1jd", "num_comments": 738, "over_18": false, "permalink": "/r/jobs/comments/13gp1jd/linkedin_is_bad_for_your_mental_health/", "saved": false, "score": 4633, "spoiler": false, "stickied": false, "text": "Studies have shown that frequent use of LinkedIn is associated with increased depression and anxiety.\n\n&#x200B;\n\nLinkedIn really creates that fear of missing out. You feel pressurised to post something in case you’re forgotten and it’s just not sustainable IMHO.\n\n&#x200B;\n\nPlus there is so much content that can have a negative impact on your mental health including:\n\n&#x200B;\n\n* Toxic positivity posts\n* Humble brags\n* Look at me selfies\n* Vanity metric showoffs\n* Burnout braggers etc\n\n&#x200B;\n\nAnd spending too much time on LinkedIn isn't good for your mental health either.\n\n&#x200B;\n\nDon't become a LinkedIn addict. Get a life!\n\n&#x200B;\n\nAnd if you need a break, have one. You don't need to justify yourself either.\n\n&#x200B;\n\nPlease put your mental health first:\n\n&#x200B;\n\n* Post when you can\n* Build a supportive network\n* Cultivate a feel-good feed\n\n&#x200B;\n\nHow does LinkedIn make you feel?", "title": "LinkedIn is bad for your mental health", "upvote_ratio": 0.94, "url": "https://www.reddit.com/r/jobs/comments/13gp1jd/linkedin_is_bad_for_your_mental_health/"}, {"author": "ceiling_fanzz", "author_flair_text": null, "clicked": false, "created_utc": 1694388463.0, "distinguished": null, "edited": 1694408253.0, "id": "16ffcdi", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_16ffcdi", "num_comments": 356, "over_18": false, "permalink": "/r/jobs/comments/16ffcdi/i_got_a_job_at_a_dildo_factory/", "saved": false, "score": 4597, "spoiler": false, "stickied": false, "text": "The closest factory with decent pay that was hiring was doc Johnson dildo factory. Pay started at $20 an hour with good health care benefits.\n\nI'm what you call the dildo dipper, after the dildos are made, it goes down the line where I dip the tip of the dildos on red paint and move it down the line. Then on the weekend I do quality control for overtime and I inspect and make sure the dildos are in great shape. It's a fun job", "title": "I got a job at a dildo factory", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/jobs/comments/16ffcdi/i_got_a_job_at_a_dildo_factory/"}, {"author": "BUR6S", "author_flair_text": null, "clicked": false, "created_utc": 1706200581.0, "distinguished": null, "edited": 1706226294.0, "id": "19fdfr0", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_19fdfr0", "num_comments": 485, "over_18": false, "permalink": "/r/jobs/comments/19fdfr0/my_corporation_just_laid_off_a_ton_of_employees/", "saved": false, "score": 4593, "spoiler": false, "stickied": false, "text": "The C-Suites started the call with a VERY brief note that they had to lay off a ton of employees in another department, and that today was a day of “raw emotion.” And then, I shit you not, they immediately went into “let’s not let this stop us from having an extremely profitable Q4, get out there and sell!”\n\nThis is why I refuse to work past 5. This is why I don’t attend company events outside of work hours. This is why I don’t take work stress home with me.\n\nYou are a number. You are replaceable. They don’t care about you. Do not give unto them what they refuse to give to you. Know your worth. Show no loyalty to a company.\n\nI really feel for those that lost their jobs today, because they have families. They’re people, they have lives. They matter. Our company has made record profits the last few years, completely on the backs of those laid off.\n\nI’m just disgusted.\n\nEDIT: my company’s FY starts 4/1 for some reason. So Q4 ends 3/31.", "title": "My Corporation just laid off a ton of employees, and scheduled a company-wide call the same afternoon…", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/jobs/comments/19fdfr0/my_corporation_just_laid_off_a_ton_of_employees/"}, {"author": "organictamarind", "author_flair_text": null, "clicked": false, "created_utc": 1692975161.0, "distinguished": null, "edited": 1693025564.0, "id": "1611h0q", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1611h0q", "num_comments": 412, "over_18": false, "permalink": "/r/jobs/comments/1611h0q/why_do_recruiters_act_so_shocked_we_stand_up_for/", "saved": false, "score": 4465, "spoiler": false, "stickied": false, "text": "I had 4 calls this past week thaat made me MAD 😡\nFrom 3 different companies\n\nSo if I ask for a hike that they promised in the Ad- They are shocked\n \n*Edit to add context*: the job said X on the listing and on call they said, the max we can offer is X minus 50% .. We just put X cause that's the range in the market \n\nIf I say I would like to work within 90 minutes one way.of commute they are shocked\n\n*Edit to add context*: literally it was beyond city limits. The company listing said City A , and the role was based on the outskirts of City A and B . \n\nIf I say I won't interview if I don't have a proper Job Description they are shocked\n\n*Edit to add context*: He actually said, come in for the interview then we will discuss the role...the \"Role is based on your experience \n(( I'm in Supply chain, and roles differ wildly based on product and service or which part of the chain you sit in (Ops, Quality, procurement etc) ))\n\nIf I don't make myself available for an interview within an hour as per their convenience they are shocked\n\n*Edit to add context*: I was in office, recruiter calls for a zoom meeting in an hour, I tell him I can I'm at work, he's literally like \" why can't you be available go into a conference room or something \" like BITCH I am at my JOB \n\nAnd then these same companies leaders put up LinkedIn posts on how they're fighting a War to get Talent in ..", "title": "Why do recruiters act so SHOCKED we stand up for ourselves", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/jobs/comments/1611h0q/why_do_recruiters_act_so_shocked_we_stand_up_for/"}, {"author": "A1steaksauceTrekdog7", "author_flair_text": null, "clicked": false, "created_utc": 1687619870.0, "distinguished": null, "edited": false, "id": "14hvjxw", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_14hvjxw", "num_comments": 1018, "over_18": false, "permalink": "/r/jobs/comments/14hvjxw/most_people_alive_today_will_work_until_they_die/", "saved": false, "score": 4427, "spoiler": false, "stickied": false, "text": "[YouTube video](https://youtu.be/4X2droxtGbQ)", "title": "Most people alive today will work until they die", "upvote_ratio": 0.91, "url": "https://www.reddit.com/r/jobs/comments/14hvjxw/most_people_alive_today_will_work_until_they_die/"}, {"author": "AlmightyXan", "author_flair_text": null, "clicked": false, "created_utc": 1705886845.0, "distinguished": null, "edited": false, "id": "19cjpbb", "is_original_content": false, "is_self": false, "locked": false, "name": "t3_19cjpbb", "num_comments": 335, "over_18": false, "permalink": "/r/jobs/comments/19cjpbb/it_was_blank_and_it_forced_me_to_answer_like_what/", "saved": false, "score": 4424, "spoiler": false, "stickied": false, "text": "", "title": "It was blank and it forced me to answer like what else could I say?😭", "upvote_ratio": 0.95, "url": "https://i.redd.it/0zjszq7f9wdc1.png"}, {"author": "DarthBanEvader42069", "author_flair_text": null, "clicked": false, "created_utc": 1706626917.0, "distinguished": null, "edited": false, "id": "1aeqed9", "is_original_content": false, "is_self": false, "locked": false, "name": "t3_1aeqed9", "num_comments": 541, "over_18": false, "permalink": "/r/jobs/comments/1aeqed9/one_way_interview_gtfo_here/", "saved": false, "score": 4431, "spoiler": false, "stickied": false, "text": "", "title": "One way interview; GTFO here.", "upvote_ratio": 0.96, "url": "https://i.redd.it/xide9fexdlfc1.png"}, {"author": "Outrageous_Fig_3105", "author_flair_text": null, "clicked": false, "created_utc": 1705972391.0, "distinguished": null, "edited": false, "id": "19dc5b3", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_19dc5b3", "num_comments": 579, "over_18": false, "permalink": "/r/jobs/comments/19dc5b3/my_coworker_accidental_sent_a_group_message_to/", "saved": false, "score": 4345, "spoiler": false, "stickied": false, "text": "I’ve been at this job about three months now. Shortly after starting, my supervisor warned me to be careful around a coworker “Karen” because of her attitude. \n\nKaren is one of the most passive aggressive and unpleasant people I’ve ever been around. I try to keep my distance but she’s always trying to micromanage me because I’m new. No she’s not a manager, we are on the same level. This morning, Karen confirmed with me that I would go to lunch at 11am. Something personal came up later so I asked another coworker “Pam” if we could switch lunch times so I could go at 12pm. Pam agreed and had no issues switching. Well, when I came back from lunch, I saw a message Karen meant to send to another coworker that she’s friends with but accidentally sent to our entire department. Something along the lines of: \n\n“I just think it’s funny how OP confirmed she would go to lunch at 11 but then turned around and switched lunch times. I guess you can do whatever you want when you’re friends with the supervisor.”\n\nShe quickly deleted the message but not before me and 15 other people saw it. No I’m not “friends” with the supervisor, we are distantly related by marriage but have never been around each other outside of work. \n\nI heard she was turned into HR last year for bullying a girl into quitting but nothing came of it. I’m on the fence of reporting her behavior to HR or just quitting for my peace. But good paying jobs are hard to find these days. :/", "title": "My coworker accidental sent a group message to our entire department gossiping about me", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/jobs/comments/19dc5b3/my_coworker_accidental_sent_a_group_message_to/"}, {"author": "Harpocretes", "author_flair_text": null, "clicked": false, "created_utc": 1682374875.0, "distinguished": null, "edited": false, "id": "12xypxg", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_12xypxg", "num_comments": 831, "over_18": false, "permalink": "/r/jobs/comments/12xypxg/do_new_hires_not_understand_how_to_negotiate/", "saved": false, "score": 4173, "spoiler": false, "stickied": false, "text": "I’m in charge of hiring engineers for my division.  We made an offer last week with an exchange that went something like this:\n\n1. Us: Great interview, team likes you. How about a base salary of 112k plus benefits?\n2. Them: oh jeez that sounds good but I was really hoping for 120k.\n3. Us: how about 116k and when you get your license (should be within a 12 months or less) automatic 5k bump?\n4. Them: sounds great\n5. I prep offer, get it approved and sent out the next day. \n6. Them: hey I was thinking I’d rather have 121k. \n\nThat isn’t how you negotiate! The key time to negotiate was before we had settled on a number- coming back higher after that just irritates everyone involved. Or am I off base?", "title": "Do new hires not understand how to negotiate??", "upvote_ratio": 0.9, "url": "https://www.reddit.com/r/jobs/comments/12xypxg/do_new_hires_not_understand_how_to_negotiate/"}, {"author": "n4iurnv9y285y", "author_flair_text": null, "clicked": false, "created_utc": 1689031210.0, "distinguished": null, "edited": false, "id": "14w9uo0", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_14w9uo0", "num_comments": 1122, "over_18": false, "permalink": "/r/jobs/comments/14w9uo0/sooo_i_and_my_team_but_mostly_me_just_destroyed_a/", "saved": false, "score": 4162, "spoiler": false, "stickied": false, "text": "Basically title.\n\nI destroyed a piece of machinery by using it improperly. I've only been at my current workplace for 3 months, and had about a year of experience in this specific field. Though i have 5 years experience in immediately adjacent fields. I'm the most junior person on the team (25m), and i was shown how to use this thing on day one. I've used it wrong every time since then. I wasn't sure if i was using it wrong or not, and i repeatedly asked for guidance on it, but whenever i did the answer was always along the lines of, \"well that is technically wrong, but i do it like that all the time, I wouldn't worry about it.\"\n\nWell using it improperly as i had been, combined with some stars aligning outside of my immediate control, resulted in the complete and utter destruction of this machine. total loss, completely unrecoverable. No one was hurt, but everyone in the shop got hell of an adrenaline drop, it was pretty violent.\n\nJustifiably, the CEO of the company want to meet with the whole crew in person. No one here has even met the CEO in person, all we know is that he has 70 years old, and has 50 years experience doing what we do, and is actually bit of a local legend, both for his sheer competency, and his epic temper. (although he has significantly mellowed out, if rumors hold true)\n\nI'm really scared what he's going to say, i don't want to lose this job, its definitely the best I've ever had. Im just looking for some advice on what i can say that will let me thread the needle of keeping this job and not just blaming everyone but myself.", "title": "Sooo... I and my team, but mostly me, just destroyed a $100k piece of machinery today. CEO of the company wants to have a meeting tomorrow with all of us. What should I expect going into this/what should i do to prepare?", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/jobs/comments/14w9uo0/sooo_i_and_my_team_but_mostly_me_just_destroyed_a/"}, {"author": "guacislife12", "author_flair_text": null, "clicked": false, "created_utc": 1698680371.0, "distinguished": null, "edited": false, "id": "17jw9b2", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_17jw9b2", "num_comments": 224, "over_18": false, "permalink": "/r/jobs/comments/17jw9b2/corporate_math_is_making_people_take_pto_when/", "saved": false, "score": 4137, "spoiler": false, "stickied": false, "text": "Last week, I and quite a few other people tried to WFH because we were ill. We were told to take PTO or come in. Well, the sickness has spread and now too many people are sick and if they all took PTO our company literally wouldn't be able to function. \n\nMy boss told the 3 team members who are sick on my team to WFH this week since she sits by them and doesn't want to get sick (but also because if they all took off then the company would shut down). I should note that we are hybrid and everyone has the setup at home to WFH, there is absolutely no reason why anyone would actually need to come in while sick. \n\nMaybe if they just let sick people WFH in the first place we wouldn't be dealing with the entire office being sick!", "title": "Corporate math is making people take PTO when sick instead of WFH.. then having to change policy because the entire office is sick", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/jobs/comments/17jw9b2/corporate_math_is_making_people_take_pto_when/"}, {"author": "patovc", "author_flair_text": null, "clicked": false, "created_utc": 1707736760.0, "distinguished": null, "edited": false, "id": "1aoxqyc", "is_original_content": false, "is_self": false, "locked": false, "name": "t3_1aoxqyc", "num_comments": 144, "over_18": false, "permalink": "/r/jobs/comments/1aoxqyc/would_do_you_leave_a_job_like_this/", "saved": false, "score": 4248, "spoiler": false, "stickied": false, "text": "", "title": "Would do you leave a job like this?", "upvote_ratio": 0.94, "url": "https://i.redd.it/jlp2e8d525ic1.jpeg"}, {"author": "Sebt1890", "author_flair_text": null, "clicked": false, "created_utc": 1691588076.0, "distinguished": null, "edited": false, "id": "15mfif7", "is_original_content": false, "is_self": false, "locked": false, "name": "t3_15mfif7", "num_comments": 316, "over_18": false, "permalink": "/r/jobs/comments/15mfif7/i_guess_the_first_200_werent_good_enough_huh/", "saved": false, "score": 3988, "spoiler": false, "stickied": false, "text": "", "title": "I guess the first 200 weren't good enough, huh?", "upvote_ratio": 0.97, "url": "https://i.redd.it/mftja60u73hb1.jpg"}, {"author": "fancyfroyo5117", "author_flair_text": null, "clicked": false, "created_utc": 1705722425.0, "distinguished": null, "edited": false, "id": "19b2kay", "is_original_content": false, "is_self": false, "locked": false, "name": "t3_19b2kay", "num_comments": 250, "over_18": false, "permalink": "/r/jobs/comments/19b2kay/update_disappointed_after_asking_for_a_raise/", "saved": false, "score": 3931, "spoiler": false, "stickied": false, "text": "Hey everyone! I’m here to give y’all an update on my manager’s response to my resignation email. \n\nSo I went ahead and sent in my resignation notice \nbecause I have a secure offer with another company for more money + benefits. I honestly couldn’t even be bothered to try telling them I have another offer for more money because my manager’s attitude is already bad, I know I’d just be met with more pettiness and disrespect. \n\nFirst screenshot is my resignation email, second is my manager’s response. \nI reworded my email a bit and the response I got was underwhelming and not genuine, but expected.\n\nSo oh well, for the next two weeks I will be doing the bare minimum of my job and will act my wage. \n\nHopefully the next position will open up more opportunities for my future.\n\nThank you so much to everyone who offered any advice or input, good or bad. I really appreciate your help!", "title": "[UPDATE] Disappointed after asking for a raise", "upvote_ratio": 0.97, "url": "https://www.reddit.com/gallery/19b2kay"}, {"author": "NotSoFluent123", "author_flair_text": null, "clicked": false, "created_utc": 1687174501.0, "distinguished": null, "edited": 1687284760.0, "id": "14dc5gm", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_14dc5gm", "num_comments": 287, "over_18": false, "permalink": "/r/jobs/comments/14dc5gm/after_5_months_of_unemployment_ive_finally_been/", "saved": false, "score": 3922, "spoiler": false, "stickied": false, "text": "So, after around 100 job applications, 12/13 interviews and 5 months without a paycheque and extreme mental stress, I’ve been offered a brilliant job today with a brilliant company\n\nI just wanted to post this because I know it’s cliche, but for anyone else going through a stressful time with unemployment or a job hunt in general, please keep going - it’s the only way and you will get there in the end \n\nNo matter how difficult things are, if you’ve gotten one job before, you can definitely do it again. We all just need a bit of luck on our side ☺️\n\nWishing everyone the best of luck in finding the careers they want!\n\nEDIT: I wasn’t expecting this post to do so well and receive so many congratulatory message from everyone! \n\nThank you to everyone again, and thank you to everyone I haven’t responded to saying thanks. I have tried, but there’s just too many of you 😆❤️", "title": "After 5 months of unemployment, I’ve finally been offered a job 🥲", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/jobs/comments/14dc5gm/after_5_months_of_unemployment_ive_finally_been/"}, {"author": "_squeeee", "author_flair_text": null, "clicked": false, "created_utc": 1706712929.0, "distinguished": null, "edited": false, "id": "1afjo4z", "is_original_content": false, "is_self": false, "locked": false, "name": "t3_1afjo4z", "num_comments": 512, "over_18": false, "permalink": "/r/jobs/comments/1afjo4z/the_audacity/", "saved": false, "score": 3913, "spoiler": false, "stickied": false, "text": "I don’t know what flair this falls under. Back in October I was laid off. Fast forward to now, the HR director email me for the password to a USB token for Global Sign.\n\nShould I even respond? I’m not getting paid to answer the email pertaining to my old job after they laid me off. \n\nYes, I know the password.", "title": "The Audacity", "upvote_ratio": 0.97, "url": "https://i.redd.it/t8bj8kmshsfc1.jpeg"}, {"author": "mubeen9", "author_flair_text": null, "clicked": false, "created_utc": 1681640298.0, "distinguished": null, "edited": false, "id": "12o3tgr", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_12o3tgr", "num_comments": 2356, "over_18": false, "permalink": "/r/jobs/comments/12o3tgr/i_lied_on_a_interview_about_my_salary_now_theyre/", "saved": false, "score": 3890, "spoiler": false, "stickied": false, "text": "Hi everyone, i lied to HR about my salary inflated salary by 50% for what receive right now. Now HR is asking me to produce salary slip to verify my payment. I paid below standards of the market rate. So telling the true amount will make them take advantage of my situation and underpay me. What should i do please help", "title": "I lied on a interview about my salary now they’re asking for proof what to do?", "upvote_ratio": 0.94, "url": "https://www.reddit.com/r/jobs/comments/12o3tgr/i_lied_on_a_interview_about_my_salary_now_theyre/"}, {"author": "Beta_Nerdy", "author_flair_text": null, "clicked": false, "created_utc": 1706782839.0, "distinguished": null, "edited": 1706795922.0, "id": "1ag7ugw", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1ag7ugw", "num_comments": 1547, "over_18": false, "permalink": "/r/jobs/comments/1ag7ugw/fired_without_warning_escorted_out_by_security/", "saved": false, "score": 3899, "spoiler": false, "stickied": false, "text": "A great employee at my office was FIRED yesterday.  Everyone was in total shock.  Jerry had been there for years and had a history of hard work, success, technical expertise and got along with everyone.  He worked in Purchasing and was a college educated professional making about 80K a year for a large organization.\n\nA new boss came in and was aloof to Jerry but never told him his performance was substandard.  But yesterday the new boss and HR called Jerry into his office and fired him.  Told Jerry it was not a good fit.  There was no history of warnings or poor performance appraisals.  No misconduct was brought up during the termination.  This was not a reduction in force or layoff There was no severance, no warning, no apology.  Jerry was escorted out by Security.\n\nJerry sent his friends an email to say good by.  He claimed this was a complete shock and there had been no warning at all.  Just a broad claim of lack of fit during the brief termination meeting.\n\nCan this be true?  Is it common that managers will fire someone who had been with the company for over five years without warning or reason?  Or is Jerry lying to us all?\n\n(Yes, **employment at will is legal and people can be fired for no reason.**  But what impact will such actions have on morale or turnover?  Lots of Jerry's coworkers now assume the same thing will happen to them, so they are updating their resumes.)\n\nHave you seen a sudden termination without warning or real reason happen where you work?", "title": "FIRED! WITHOUT WARNING- Escorted out by Security!", "upvote_ratio": 0.91, "url": "https://www.reddit.com/r/jobs/comments/1ag7ugw/fired_without_warning_escorted_out_by_security/"}, {"author": "Money-Low1290", "author_flair_text": null, "clicked": false, "created_utc": 1690392112.0, "distinguished": null, "edited": false, "id": "15abvgy", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_15abvgy", "num_comments": 986, "over_18": false, "permalink": "/r/jobs/comments/15abvgy/i_have_been_employed_steadily_since_i_was_14_yrs/", "saved": false, "score": 3806, "spoiler": false, "stickied": false, "text": "I have always had a job and the last two were careers. I was a employee and business owner of 15 years that employed 12-16 employees in the restaurant bar industry. I recently left CDCR after 8 years as I had family issues with elderly parents arise and needed a change. I know have been applying to jobs of indeed here in California with no luck. I have found that if I find a posting but go to the actually company website I can apply and actually get an interview. That being said after the interviews I get ghosted or the dreaded “We have moved on in the hiring process” rejection email. I have applied to a private for profit Nursing school as an attempt to get into a stabile career that I could possibly use to enhance my current retirement savings and work in as my last career. I am nuts, doing something wrong, or under estimating what really going on in the job market? Or is it me? I keep hearing that the workforce is lacking qualified workers, but I can’t even get an entry level job after 5 months!", "title": "I have been employed steadily since I was 14 yrs old. Now 44 and unemployed since March. Is the job market really this bad or does indeed suck?", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/jobs/comments/15abvgy/i_have_been_employed_steadily_since_i_was_14_yrs/"}, {"author": "sweaty_yoda", "author_flair_text": null, "clicked": false, "created_utc": 1691748422.0, "distinguished": null, "edited": 1691928559.0, "id": "15o4qi5", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_15o4qi5", "num_comments": 902, "over_18": false, "permalink": "/r/jobs/comments/15o4qi5/how_can_i_explain_that_i_cannot_work_full_time_in/", "saved": false, "score": 3790, "spoiler": false, "stickied": false, "text": "For context I have an invisible chronic illness which heavily restricts my ability to most things. I'm a 25 yo woman so I almost always get the \"but you don't look ill\" stare whenever I mention I'm disabled. I have tried working 20-25 hours a week before and it has not been sustainable.\n\n I have applied and been interviewed for quite a few jobs in the last 6(ish) months, each advertised as 12-16 hours per week. In each of these interviews I have been asked what my other commitments are/why I'm applying for part time work and I have been honest and said that I have a chronic illness which restricts my availability. Each time I've gotten \"the stare\" from the interviewer and I have rarely even got a reply from them regarding my interview. All of these jobs are basic retail jobs that I am more than qualified for.\n\nHow can I answer these types of questions without jeopardising my chances by mentioning my disability?\n\nEDIT: thank you for all the responses! My biggest fear/issue is that when filling out paperwork at the interview stage, employers give out a timetable for a week (monday morning, afternoon, evening etc) and ask to tick when I'm available. Of course, I could work at any time or day, but not more than the part time hours. I worry that employers will see that I'm available and expect me to be able to work whenever they need. My previous retail jobs have done the same. I think I need to overcome the anxiety I get when I'm asked and learn to be more stern with my answers", "title": "How can I explain that I cannot work full time in a job interview?", "upvote_ratio": 0.91, "url": "https://www.reddit.com/r/jobs/comments/15o4qi5/how_can_i_explain_that_i_cannot_work_full_time_in/"}, {"author": "SeaEquipment3090", "author_flair_text": null, "clicked": false, "created_utc": 1699281691.0, "distinguished": null, "edited": false, "id": "17p48oc", "is_original_content": false, "is_self": false, "locked": false, "name": "t3_17p48oc", "num_comments": 420, "over_18": false, "permalink": "/r/jobs/comments/17p48oc/im_so_embarrassed_but_me_and_all_my_coworkers_had/", "saved": false, "score": 3719, "spoiler": false, "stickied": false, "text": "also i don’t even wanna go to work now 😭 (i hope i picked the right flair)", "title": "I’m so embarrassed but me and all my coworkers had taken snacks. How did I handle this?", "upvote_ratio": 0.94, "url": "https://i.redd.it/e4lzqagwoqyb1.jpg"}, {"author": "therealpicard", "author_flair_text": null, "clicked": false, "created_utc": 1681560046.0, "distinguished": null, "edited": 1681560370.0, "id": "12n00ua", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_12n00ua", "num_comments": 500, "over_18": false, "permalink": "/r/jobs/comments/12n00ua/ive_interviewed_and_hired_hundreds_of_people/", "saved": false, "score": 3722, "spoiler": false, "stickied": false, "text": "I stumbled across this channel and read some of the posts and it occurred to me that there are a lot of questions and opinions being floated but I haven't seen any actionable advice. I have seen some bad advice. \n\nFirst: Who am I? I work these days in technology but I've been a carpenter, I've worked in the marine industry as a boat captain and various scut work jobs, Ive been a graphic designer, and I have been a Product Management leader for 25+ years with VP, SVP and CPO titles. I've worked at huge companies, mid-sized companies and I've founded four companies, two of which I was the CEO. \n\nSo at the risk of pontificating, I thought I'd share some thoughts:\n\nFirst: People are looking for coworkers - meaning people who they like, who are at the same level of *competence* as the rest of the team (not experience), who get things done, who are reliable, and who are creative problem solvers. Even at unsophisticated jobs, being a creative problem solver is a huge plus. You have to come across as likable. And ideally you want the interviewer to start rooting for you to be successful. \n\nSo how do you do that? You have to arrive at an interview ready to tell stories that capture the interviewer's attention and illustrate your value. Most interviewers are not good at interviewing, so you need to help them along. \n\nThese days I screen for 4 things when I hire.  I believe these things are universally desirable and necessary in order to be successful at any job: Grit, Integrity, Empathy and Creativity. \n\nI believe that if you can exhibit and illustrate these four traits in an interview, you have a much better chance of being hired.  So what do these things mean, and how do you illustrate them?\n\n1. Grit:  this is the ability to get a task or project done, even if you run into obstacles. You need to illustrate that you have initiative, that you can identify and solve problems that are blocking you (sometimes this means asking for help, especially if you're junior), but mostly it means you keep on trying even if things get hard. \n\nSo have a story queued up that you can use to illustrate your grit. Tell a story about a really hard problem you had to solve. Summarize the background, explain what obstacles you ran into, and how you solved them. For a first job or if you're junior (1-3 years) telling a story that isn't work related is okay.  Or a situation where you recognized a problem beyond your skill level and escalated to get help from your boss or a senior colleague, and then completed the project. Sometimes showing that you're a team player and that you have the humility to ask for help is better than struggling alone. However, if you're more senior, showing that you know how to get things done independently is probably more important.\n\n2. Integrity: Are you trustworthy and reliable? Illustrate that you have integrity by telling about a time you had a moral or ethical quandary and had to make the hard decision to do the right thing. Or if you're brave, a time you did the wrong thing but learned from that failure. To be clear, I'm not talking about a time you made a mistake, I'm talking about the time you failed, the time you did the wrong thing, you knew it, you made the decision, and faced some consequences. Of course it's important that if you go down that path that your focus is on what you learned and why you won't make that mistake again. This can be really important if you have anything in your background that could become visible through a simple social media search or background check. Showing vulnerability in an interview, especially around integrity, can be the thing that gets an interviewer to start rooting for your success. \n\n3. Empathy: This is the ability to put yourself in someone else's shoes, walk around, see things from their perspective, and make decisions based on that insight. I would tell a story about a time when you struggled to work with someone else, perhaps you didn't even like that person, perhaps you disliked that person. But then you suddenly had an insight into why they were acting the way they were, or what was driving them, you developed a sense of empathy for them, and were able to work through the issues. Maybe you forged a great relationship, or maybe you just found a way to get by with a difficult coworker. Either way this will illustrate empathy and the ability to collaborate with people even if they are difficult.\n\n4. Creativity: This one is a bit trickier. When I interview candidates, I ask a question designed to elicit a story about creativity. So be careful about how you interject this in the conversation. Tell a story about a time you figured out a solution to something difficult in a creative way, maybe talking about a business you started, even something as simple as a lawnmowing business as a kid or a project you did at church or a summer project.  I ask the person to tell me an idea they've had for a company or a product or a nonprofit or service and what is exciting about it to them. Then I ask them to think through several aspects of the idea and expand on it until they finally either prove that they can think things through and to end, or they run into a wall at some point. Either way, it's very illuminating as an interviewer.\n\nI hope this is helpful. Just remember, hiring managers are looking for team members. They're figuring out if they like you as well as if you're qualified. So it's really important that you let them look at you, the real you, so they can assess you for who you actually are. I've Filled people out of an interview process because they were too guarded and weren't letting me get to know them.\n\nOne last thing. As much as you are being interviewed, you should be interviewing them. Show up with good questions, do research about the company before you show up, and have a good reason for why you want to work there. If you discover that you don't like the people interviewing you , find out if they are someone you will have to work with every day or if they are not someone you will work with every day. It may not be worth it to take the job if you don't like the people.", "title": "I've interviewed and hired hundreds of people.", "upvote_ratio": 0.94, "url": "https://www.reddit.com/r/jobs/comments/12n00ua/ive_interviewed_and_hired_hundreds_of_people/"}, {"author": "hypoconsul", "author_flair_text": null, "clicked": false, "created_utc": 1689950507.0, "distinguished": null, "edited": false, "id": "155pydt", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_155pydt", "num_comments": 866, "over_18": false, "permalink": "/r/jobs/comments/155pydt/people_dont_understand_just_how_torturing_and/", "saved": false, "score": 3727, "spoiler": false, "stickied": false, "text": "6 months and counting here.\n\nI've done everything you're supposed to do. I have a (supposedly) competitive MSc from a (supposedly) top uni. I have technical skills. I have internships with big names on my CV and good references. I speak languages. I know people. I apply left and right. I use keywords. I have a CV that's been professionally reviewed. I engage with people on LinkedIn. Job searching is a full time job by this point. And still I have nothing to show for it.\n\nIt's completely soul shattering. I have no money and no savings left. My friends and acquintances have a life, do things, get married, make plans, give birth to kids, start mortgages, book trips. I can't do anything, because I don't have money and I am depressed because I feel like I have no future. And it's a self growing vicious feedback loop: I get constant rejections, so I get depressed, so I don't even bother applying because I will get rejected anyways, so I don't progress, so I get even more depressed.\n\nI spend every waking minute waiting for that email that could turn things around. Days go by painfully slowly. Some hiring manager that will care about me and give me a chance. But it never happens. And when Friday afternoon comes I get that oppressing sense of dread that comes from knowing yet another week has passed and now it's the weekend and no one will reply anyways, and then Monday will come and another week will pass and so on and so forth. It's a torture. It's exhausting.\n\nI am at the end of my rope. Not only I cannot find a skilled job, but I won't get considered for an unskilled one because I'm too old and qualified - not that a random unskilled job would help matters anyway since I'd barely have money to feed myself (my mom has to pay for my food right now) and I still wouldn't be building anything resembling a future and a career for myself, so I'd still be in the same place as I am now.\n\nI have studied for years and went repeatedly out of my comfort zone and now this.\n\nI've had an actual disease in the past. I still felt better than I feel now. At least I had something to be positive about. I had hope it would end. I knew that if I followed medical advice I'd come out the other side. Now it's out of my control. I can't control hiring managers deciding on a whim against advancing me to the next stage. I can't control the fact that even if I do a great interview there might still be something that I do worse than someone else. I cannot control the fact that each time there might be even just one single applicant who's slightly better than me. I can't control anything. I can't *do* anything.", "title": "People don't understand just how torturing and soul crushing long-term unemployment can be.", "upvote_ratio": 0.94, "url": "https://www.reddit.com/r/jobs/comments/155pydt/people_dont_understand_just_how_torturing_and/"}, {"author": "Thatgirlhere", "author_flair_text": null, "clicked": false, "created_utc": 1691417415.0, "distinguished": null, "edited": false, "id": "15klu0g", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_15klu0g", "num_comments": 341, "over_18": false, "permalink": "/r/jobs/comments/15klu0g/i_quit_and_was_placed_on_the_do_not_rehire_list/", "saved": false, "score": 3661, "spoiler": false, "stickied": false, "text": "I just quit a job at a retail pharmacy because of how toxic my manager was. It was so disorganized. The drink coolers are full of mold and I also had been out for about a month because of surgery and recovery. My manager harassed me every week asking when I was returning. She said she “wasn’t” aware I submitted FMLA (Family medical leave act) but when I resubmitted it she got an email and questioned me about it? She’s narcissistic and loves to throw things in your face. I let her know I may be calling off work more often due to my surgery and the unpredictability of when I’m not feeling well. Last week I got so sick to the point I was throwing up and she had the nerve to tell me not to call off because she has plans. After I quit she kept saying I ruined her plans and not once during my recovery did she even check on me to see if I was ok. I stayed longer than I should have. I filed a complaint against her and I’m encouraging my coworker to do the same since she’s made racist remarks towards him (he’s black, shes white)", "title": "I quit and was placed on the do not rehire list.", "upvote_ratio": 0.93, "url": "https://www.reddit.com/r/jobs/comments/15klu0g/i_quit_and_was_placed_on_the_do_not_rehire_list/"}, {"author": "littlemissyA", "author_flair_text": null, "clicked": false, "created_utc": 1694923022.0, "distinguished": null, "edited": 1694971057.0, "id": "16kquvl", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_16kquvl", "num_comments": 349, "over_18": false, "permalink": "/r/jobs/comments/16kquvl/watched_coworker_die_at_work/", "saved": false, "score": 3621, "spoiler": false, "stickied": false, "text": "Our office is small. 7 people small, now 6. Last Tuesday I witnessed my coworker suffer from a ruptured brain aneurysm in my managers office. I called 911. Everyone was panicking. It was traumatic to say the least. \n\nIt was horrible and I keep replaying it in my head. I haven’t been back to the office but we will return Monday. I’m sure time will soften the pain, but I’m afraid our happy workplace will be very difficult for a while. \n\nMy boss and manager say that I can take all the time I need to process it/ get help/therapy. I’m not sure what advice I’m looking for but has this happened to anyone else? I’m afraid I won’t be able to concentrate, and keep picturing the incident of her seizing on the floor. Being wheeled out. Hearing the moans and the scared calls for help from my manager. Feeling the heavy emptiness of the cubicle beside me sounds very overwhelming right now.\n\nEdit: thank you everyone for your kind words. I am calling my therapist and will set up emdr as soon as I can get in. Work does offer an employee assistance program as well. For some reason I thought I could just shake it away and not think about it but professional help is needed. \n\nI think I just needed validation that is was traumatic (duh should be obvious) but I’m just in shock I think. \n\nThank you", "title": "Watched coworker die at work", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/jobs/comments/16kquvl/watched_coworker_die_at_work/"}, {"author": "Deathrider66", "author_flair_text": null, "clicked": false, "created_utc": 1707668293.0, "distinguished": null, "edited": false, "id": "1aobng9", "is_original_content": false, "is_self": false, "locked": false, "name": "t3_1aobng9", "num_comments": 207, "over_18": false, "permalink": "/r/jobs/comments/1aobng9/ill_get_to_it_eventually/", "saved": false, "score": 3669, "spoiler": false, "stickied": false, "text": "", "title": "I'll get to it eventually", "upvote_ratio": 0.97, "url": "https://i.redd.it/l0olgzykezhc1.jpeg"}, {"author": "Sea_Yogurtcloset7522", "author_flair_text": null, "clicked": false, "created_utc": 1692230613.0, "distinguished": null, "edited": false, "id": "15t6ou3", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_15t6ou3", "num_comments": 675, "over_18": false, "permalink": "/r/jobs/comments/15t6ou3/i_got_slapped_on_the_arm_by_a_customer_today/", "saved": false, "score": 3570, "spoiler": false, "stickied": false, "text": "I work at a bank. I had a customer come in today already sporting and attitude. She threw her card at me and asked if her overdraft was available. After checking her account it was not available as our back office took it off her account. I told her that they had not reinstated her overdraft just yet. I held her card out to her as I was telling her for her to take it back. Once I finished my sentence she slammed her hand down on my wrist which in turn slammed my hand down on the table, grabbed her card from me and started yelling at me. My knuckles were red from slamming into our counter and my wrist was red with a mark from where she hit me. It wasn't as hard as she could have done it but hard enough to hurt. My manager watched the situation play out. She did not talk to the customer, close their account or even make a report about it. Do I need to report it to HR? I don't think I should go into work and be hit for anything. My manager said she isn't reporting it because \"the customer probably wont come back when I'm there anyway, so there's no point.\" This doesn't feel right to me. Do I report it?", "title": "I got slapped on the arm by a customer today.", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/jobs/comments/15t6ou3/i_got_slapped_on_the_arm_by_a_customer_today/"}, {"author": "AZNM1912", "author_flair_text": null, "clicked": false, "created_utc": 1681240641.0, "distinguished": null, "edited": false, "id": "12iuc58", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_12iuc58", "num_comments": 300, "over_18": false, "permalink": "/r/jobs/comments/12iuc58/abandoned_during_on_site_interview/", "saved": false, "score": 3527, "spoiler": false, "stickied": false, "text": "I went through three phone screenings and finally landed an on site interview with a beverage company in my area. I was expected to stay all morning since I was scheduled to meet with three people. I get there at 9:00am, the HR rep brings me to a conference room, talks to me for about 15 minutes, and leaves saying next person will be in at 9:30am. Ok, awkward but fine. Maybe it’s a test. Nobody ever came. I called the HR rep at 9:45am and the call went right to voice mail. I left a message. The person who was suppose to be there at 10:00am and the person scheduled for 10:30am never came either. During that period I left the HR rep two more voice mails. I finally left and much to my amazement the HR rep calls me at 2:00pm asking me how the interview went. I was a bit aggravated since I took the day off my current job since this seemed like a cool company, so I told her exactly how it went. Guess I won’t be hearing back from them.", "title": "Abandoned during on site interview", "upvote_ratio": 0.99, "url": "https://www.reddit.com/r/jobs/comments/12iuc58/abandoned_during_on_site_interview/"}, {"author": "QwertyQueen21", "author_flair_text": null, "clicked": false, "created_utc": 1684450645.0, "distinguished": null, "edited": false, "id": "13ldna2", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_13ldna2", "num_comments": 247, "over_18": false, "permalink": "/r/jobs/comments/13ldna2/i_got_the_830430_job/", "saved": false, "score": 3501, "spoiler": false, "stickied": false, "text": "After five long years in retail, I finally got the job offer of my current dreams. A big girl, full time, weekends and holidays off, paid traveling, three days in office, two days at home, and with great benefits job. I did three interviews and was let known today that I was selected. I cannot wait for this new chapter of my life. To those actively searching, best of luck and keep on to the hope! The job is out there and manifestation along with perseverance is powerful.", "title": "I got the 8:30-4:30 job!!", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/jobs/comments/13ldna2/i_got_the_830430_job/"}, {"author": "deemirrorball", "author_flair_text": null, "clicked": false, "created_utc": 1706695804.0, "distinguished": null, "edited": 1706696422.0, "id": "1afelba", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1afelba", "num_comments": 790, "over_18": false, "permalink": "/r/jobs/comments/1afelba/im_hourly_i_was_told_to_put_company_email_on_my/", "saved": false, "score": 3469, "spoiler": false, "stickied": false, "text": "Am I right? I’m not getting paid extra to answers emails off the clock and my company is not paying me a stipend for the use of my data on my phone. They keep pushing me to do this. My husband says absolutely not.", "title": "I’m hourly. I was told to put company email on my phone to answers incoming emails when I’m not at work. I said no", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/jobs/comments/1afelba/im_hourly_i_was_told_to_put_company_email_on_my/"}, {"author": "Own-Nectarine3401", "author_flair_text": null, "clicked": false, "created_utc": 1700875430.0, "distinguished": null, "edited": false, "id": "1837wdo", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1837wdo", "num_comments": 598, "over_18": false, "permalink": "/r/jobs/comments/1837wdo/dont_work_at_amazon/", "saved": false, "score": 3362, "spoiler": false, "stickied": false, "text": "To anyone wondering or second guessing if they should start working at Amazon, don’t go. ESPECIALLY during the holidays. They just hit me with mandatory overtime, 12 hours A DAY FOR 5 DAYS. On your feet at all times, and they have no sympathy nor empathy for you. If you can handle that by all means go, but if you can’t or just don’t want to be physically torn down, you please please don’t go. I’m only going bc I’m in a bad financial situation, but even then, there are better alternatives. Please heed my warning. Please.", "title": "DONT WORK AT AMAZON", "upvote_ratio": 0.93, "url": "https://www.reddit.com/r/jobs/comments/1837wdo/dont_work_at_amazon/"}, {"author": "Mumford_and_Dragons", "author_flair_text": null, "clicked": false, "created_utc": 1707127980.0, "distinguished": null, "edited": false, "id": "1ajd7fb", "is_original_content": false, "is_self": false, "locked": false, "name": "t3_1ajd7fb", "num_comments": 239, "over_18": false, "permalink": "/r/jobs/comments/1ajd7fb/job_hunting_unemployed/", "saved": false, "score": 3221, "spoiler": false, "stickied": false, "text": "", "title": "Job Hunting Unemployed.😐😐😐😐", "upvote_ratio": 0.98, "url": "https://i.redd.it/6ltzjnxlrqgc1.png"}, {"author": "Concept-Genesis", "author_flair_text": null, "clicked": false, "created_utc": 1695845240.0, "distinguished": null, "edited": false, "id": "16tujkx", "is_original_content": false, "is_self": false, "locked": false, "name": "t3_16tujkx", "num_comments": 323, "over_18": false, "permalink": "/r/jobs/comments/16tujkx/even_recruiters_and_career_coaches_say_this_job/", "saved": false, "score": 3176, "spoiler": false, "stickied": false, "text": "", "title": "Even recruiters and career coaches say this job market is NOT NORMAL", "upvote_ratio": 0.98, "url": "https://i.redd.it/ztekyrrhuuqb1.jpg"}, {"author": "None", "author_flair_text": null, "clicked": false, "created_utc": 1684436283.0, "distinguished": null, "edited": false, "id": "13l7jyr", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_13l7jyr", "num_comments": 471, "over_18": false, "permalink": "/r/jobs/comments/13l7jyr/no_one_wants_to_work_anymore_because_no_one_wants/", "saved": false, "score": 3161, "spoiler": false, "stickied": false, "text": "It’s funny, I had a shower thought this morning. Some Indeed posts for very basic jobs require prior experience with specific software. I’m not talking about experience with Excel or Salesforce. I’m talking experience with software in a niche industry. For example, I apply to a lot of general clerical positions in healthcare. They want someone with YEARS of prior use in a particular optical-specific program used only in optometry offices, etc. Same goes for other smaller practices/offices. \n\nI know usually those are not difficult to learn. The most basic 2 week training is all that’s required to learn all these programs. I know because I’ve managed to learn many of them quickly for different jobs. You don’t need to be a genius to catch on, especially if applying for an entry level position. \n\nSeeing these ridiculous requirements makes me laugh and makes me think of employers who claim “no one wants to work anymore”. I can say the same thing for employers - none want to train anymore. Not even a measly 2 weeks. \n\nSo sick of posting after posting paying $18 an hour with several years experience required. Get out of here with that. No one is going to invest in applying to your job posting filling out an outdated application form, if you don’t invest in new hires.", "title": "“No one wants to work anymore”, because no one wants to train anymore.", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/jobs/comments/13l7jyr/no_one_wants_to_work_anymore_because_no_one_wants/"}, {"author": "Tiredworker27", "author_flair_text": null, "clicked": false, "created_utc": 1694532523.0, "distinguished": null, "edited": false, "id": "16gucxp", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_16gucxp", "num_comments": 222, "over_18": false, "permalink": "/r/jobs/comments/16gucxp/by_now_i_am_convinced_that_companiesbosses_dont/", "saved": false, "score": 3124, "spoiler": false, "stickied": false, "text": "Entered this company a year ago as an office allrounder. From moment one I was overwhelmed with work. Most months I did 20-30 hours of overtime because there was so much work (all-in contract so no overtime payment). Several times I told my superior that I needed a colleague to help me.\n\nThis was frequently ignored and more work dumped on me. It was always claimed that I didnt have so much to do and that getting x done requires just one email - getting y done requires just half an hour. Two weeks ago I was fired because \"I didnt do enough work and it wasnt thorough enough\"....\n\nNow guess who has been trying to reach me for the past few days? My old a-hole boss. Turns out I was the only one doing like 5 important tasks that no one else had a clue about. They now want my contacts and work progress reports etc.\n\nOf course I wont respond - but its comical how they just fired me - and now they realized that I have been doing important stuff. That I was the only on doing this important stuff.\n\nBosses/companies have absolutely no idea what their employees are doing huh?", "title": "By now I am convinced that companies/bosses dont have a clue what their employees are actually doing", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/jobs/comments/16gucxp/by_now_i_am_convinced_that_companiesbosses_dont/"}, {"author": "cblguy82", "author_flair_text": null, "clicked": false, "created_utc": 1693240139.0, "distinguished": null, "edited": 1693251281.0, "id": "163qpkr", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_163qpkr", "num_comments": 1243, "over_18": false, "permalink": "/r/jobs/comments/163qpkr/farmers_insurance_11_2400_layoff_announced_this/", "saved": false, "score": 3111, "spoiler": false, "stickied": false, "text": "Just got notice that Farmers Insurance is letting go of 11%, 2400 people this morning.\n\nand yippee, I am one of them.  fuuuuuuuuuuuuuuuuucckkkkkkkkkkkk", "title": "Farmers insurance 11%, 2400 layoff announced this morning", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/jobs/comments/163qpkr/farmers_insurance_11_2400_layoff_announced_this/"}, {"author": "mangolipgloss", "author_flair_text": null, "clicked": false, "created_utc": 1690726678.0, "distinguished": null, "edited": false, "id": "15dmq5h", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_15dmq5h", "num_comments": 827, "over_18": false, "permalink": "/r/jobs/comments/15dmq5h/why_do_employers_say_theyll_keep_you_on_file_and/", "saved": false, "score": 3058, "spoiler": false, "stickied": false, "text": "This has happened to me probably a dozen times now and it baffles. A potential employers will go through the interview process, it'll seem to go really well, but then they let me know that they went with someone else. Whatever, that's life. They say they'll keep me on file for consideration in the future. Great, maybe the other choice won't work out. Then boom, a week later or a month later, the same position is reposted by the same company. If they didn't feel it was a good fit, why not just say that it wasn't a good fit? Why lie and pretend that you have some stockpile of qualified candidates to call back when you're just gonna go to the job boards every other week looking for fresh meat? No, seriously? Can anyone shed some light on this practice?", "title": "Why do employers say they'll keep you on file and then never actually reach out again?", "upvote_ratio": 0.94, "url": "https://www.reddit.com/r/jobs/comments/15dmq5h/why_do_employers_say_theyll_keep_you_on_file_and/"}, {"author": "Amazondriver23", "author_flair_text": null, "clicked": false, "created_utc": 1685643308.0, "distinguished": null, "edited": false, "id": "13xoyzl", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_13xoyzl", "num_comments": 863, "over_18": false, "permalink": "/r/jobs/comments/13xoyzl/blue_collar_jobs_always_say_their_hiring_but/", "saved": false, "score": 3046, "spoiler": false, "stickied": false, "text": "I’m 25, and wasted my previous years working BS fastfood/retail jobs. I’m trying to start a career in the blue collar field, but every time I mention I have no experience. They never hire me.", "title": "Blue collar jobs always say their hiring, but aren’t willing to train someone with no experience", "upvote_ratio": 0.94, "url": "https://www.reddit.com/r/jobs/comments/13xoyzl/blue_collar_jobs_always_say_their_hiring_but/"}, {"author": "SurpriseKind2520", "author_flair_text": null, "clicked": false, "created_utc": 1702902477.0, "distinguished": null, "edited": 1707513831.0, "id": "18l7iiy", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_18l7iiy", "num_comments": 514, "over_18": false, "permalink": "/r/jobs/comments/18l7iiy/i_accidentally_out_dressed_management/", "saved": false, "score": 3024, "spoiler": false, "stickied": false, "text": "\n\nI work in a small laid back office and no one tends to dress up. Our company has several local clients so we hosted a holiday party and invited the clients as a thank you. I helped plan the party with 2 others.\n\nMy manager said that she was going to take some photos of us at the event for our company’s Facebook page so to look nice. She didn’t define “look nice” but I took this as dress up so that’s what I did. I wore a dress, nice shoes, perfume, makeup, jewelry and had my hair curled. \n\nMany of my coworkers wore our company T-shirt and jeans. My boss wore jeans with a nice sweater but it was still jeans so not too dressed up.\n\nA lot of the clients talked to me like I was the boss. The division manager showed up (dressed on about the same level as me) and she gave me like this hateful looking stare which made me uncomfortable. Others said they liked my outfit but I wondered if they were just being nice. After looking at the Facebook photos and showing my family, they all said it was a nice dress.\n\nBut in the last two weeks, my direct boss has been kind of dismissive to me. I also feel like I was left out of a meeting I should have been on recently and some recurring ones that she scheduled. I can sense a change that I think is related to over dressing which was not my intention to outshine anyone. I just thought we were supposed to dress up. Any advice or similar experience? I’m starting to think it’s better to underdress than to overdress at office parties.\n\n\nEdit: Thank you for all the comments. I tried to read them all and hope I didn’t miss any. If you want to contribute with your experience or advice, it’s welcomed. Ultimately the theme is that people believe there is jealousy and insecurity in the leadership. Advice for how to handle this varied in the comments. I’m taking them all into consideration in navigating this uncomfortable situation. Being the recipient of jealousy is indescribable really and is unfair to the recipient. I just hope everyone knows that someone else’s talents, style, knowledge or potential is not a threat to who you are. I hope the comments help you if you go through the same thing.\n\n“For wherever there is jealousy and selfish ambition, there you will find disorder and evil of every kind.”\n‭‭James‬ ‭3:16‬ ‭NLT‬‬\nhttps://www.bible.com/116/jas.3.16.nlt", "title": "I accidentally out dressed management", "upvote_ratio": 0.94, "url": "https://www.reddit.com/r/jobs/comments/18l7iiy/i_accidentally_out_dressed_management/"}, {"author": "MeanPrinciple9607", "author_flair_text": null, "clicked": false, "created_utc": 1703959552.0, "distinguished": null, "edited": false, "id": "18ulkya", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_18ulkya", "num_comments": 859, "over_18": false, "permalink": "/r/jobs/comments/18ulkya/feel_like_im_super_fake_at_work/", "saved": false, "score": 2987, "spoiler": false, "stickied": false, "text": "I feel like I'm not my real self at work. I don't share much and I'm not my real personality. I assume this is common? I get so tired of work politics that I rather just be friendly but not personal. Keep things separate. Hbu?", "title": "Feel like I'm super fake at work", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/jobs/comments/18ulkya/feel_like_im_super_fake_at_work/"}, {"author": "Napkxng", "author_flair_text": null, "clicked": false, "created_utc": 1688122686.0, "distinguished": null, "edited": false, "id": "14mx6kd", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_14mx6kd", "num_comments": 1141, "over_18": false, "permalink": "/r/jobs/comments/14mx6kd/what_are_these_i_finish_work_in_2_hours_and_just/", "saved": false, "score": 2923, "spoiler": false, "stickied": false, "text": "I'm currently in a business development role where its constant work and stress, KPIs, and out bounding and training. \n\nI (24m) would like to find some sort of relaxed job where I don't feel threatened to lose my job every week (have had that threatened to me in first few months). \n\nI'm not a lazy person, but I've had over 12 jobs since I was 14, I'm just tired. \n\nAlso I have side business ideas that I've worked on recently and would love to start carry on making music and documentaries, my social media has gotten some attention, and it's something I enjoy. \n\nI've nearly doubled every sales target for the past 6 months of working, but deep inside I'm creative, love helping people live a better life, and would love to change the world around me more. I'd love to find something hybrid remote that I can be half office and half using my hands and body/strength. I don't enjoy the trades.\n\nI'd also like to get a stable work as Id like to work on starting a family with someone. And I don't want the stress of a fickle stressful job that I would pass that stress and unavailability on.", "title": "What are these \"I finish work in 2 hours and just bored\" jobs?", "upvote_ratio": 0.94, "url": "https://www.reddit.com/r/jobs/comments/14mx6kd/what_are_these_i_finish_work_in_2_hours_and_just/"}]