[{"author": "dcj012", "author_flair_text": null, "clicked": false, "created_utc": 1710369507.0, "distinguished": null, "edited": false, "id": "1be55ab", "is_original_content": false, "is_self": false, "locked": false, "name": "t3_1be55ab", "num_comments": 0, "over_18": false, "permalink": "/r/jobs/comments/1be55ab/repaying_sign_on_bonus/", "saved": false, "score": 2, "spoiler": false, "stickied": false, "text": "Quitting my job to take a better paying one. I got this sign on bonus in December. Employer is saying she’ll take it out of my remaining two checks. Is that fine for my taxes? Taking it out of paychecks just feels weird, but ultimately I know I have to pay it.", "title": "Repaying sign on bonus", "upvote_ratio": 1.0, "url": "https://i.redd.it/yoyj4oeoi6oc1.jpeg"}, {"author": "aja_ramirez", "author_flair_text": null, "clicked": false, "created_utc": 1710369787.0, "distinguished": null, "edited": false, "id": "1be59cq", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1be59cq", "num_comments": 0, "over_18": false, "permalink": "/r/jobs/comments/1be59cq/job_hunting_for_the_first_time_in_nearly_20_years/", "saved": false, "score": 1, "spoiler": false, "stickied": false, "text": "So I have been out of the job hunting market for nearly 20 years.  As it were. I made my way up the ladder in higher ed, and have been fairly content.  I'm not rich of course, it being higher ed and all, but I have bought into the mission and while the job has its share of stress, my work-life balance has always been good.\n\nUntil recently that is.  With new leadership in the fold, the environment has gotten real toxic real fast.  I dread working and have lost the will to care like I used to.\n\nMy issue is that prospective jobs are scarce in my situation.  I am on the administrative side somewhere between middle management and the executives.  Heck, even if I wanted to take just any job, the employer would probably wonder why someone with my experience would be interested.\n\nI did apply for my first job last week.  Submitted my app on Wednesday; the closing date was Thursday.  Not willing to relocate so not sure what my chances are if I'm gonna average an application or three a year.  Probably not good.  \n\nAt least I think I am a really good fit for the job.  Not even sure how they will contact me, if they do?  Are employers calling people still?  Anyway, I guess I will find out; or not.", "title": "Job hunting for the first time in nearly 20 years", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/jobs/comments/1be59cq/job_hunting_for_the_first_time_in_nearly_20_years/"}, {"author": "suckingbitties", "author_flair_text": null, "clicked": false, "created_utc": 1710369786.0, "distinguished": null, "edited": false, "id": "1be59c2", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1be59c2", "num_comments": 2, "over_18": false, "permalink": "/r/jobs/comments/1be59c2/insurance_sales_job_safe_to_take_on/", "saved": false, "score": 1, "spoiler": false, "stickied": false, "text": "I'm a 24 year old male who just started college and I need a remote job that let's me get time in to make money but also have time to stick to my studies and sleep. All my previous career experience has been in carpentry and construction mostly as a lead man.\n\nI saw a listing on indeed for an insurance sales position that is part time (choose your own hours) and remote. I just got off the phone for my interview and it seemed a little odd to me, maybe because I've never had a white collar job. He didn't ask me really any personal questions about skills or experience, we talked for a bit though. He said the job is purely commission based, and that the work you get is through purchased leads (from them). I was instructed to start the process to get my insurance sales license and return to him to continue from there.\n\nIs this an okay job to take or am I wasting my time? I'm not looking to get rich, just support myself while I'm in school and if a job that fits my needs allows me to do that I'll take whatever.", "title": "Insurance Sales job safe to take on?", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/jobs/comments/1be59c2/insurance_sales_job_safe_to_take_on/"}, {"author": "WittyEqual8826", "author_flair_text": null, "clicked": false, "created_utc": 1710369147.0, "distinguished": null, "edited": false, "id": "1be500f", "is_original_content": false, "is_self": false, "locked": false, "name": "t3_1be500f", "num_comments": 0, "over_18": false, "permalink": "/r/jobs/comments/1be500f/applying_to_ux_roles_zero_callbacks_graduating/", "saved": false, "score": 1, "spoiler": false, "stickied": false, "text": "", "title": "Applying to UX roles. Zero callbacks. Graduating with MSHCI. What’s wrong with my resume?", "upvote_ratio": 1.0, "url": "https://i.redd.it/09egz3wlh6oc1.jpeg"}, {"author": "superreflectionn", "author_flair_text": null, "clicked": false, "created_utc": 1710368854.0, "distinguished": null, "edited": false, "id": "1be4vkr", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1be4vkr", "num_comments": 0, "over_18": false, "permalink": "/r/jobs/comments/1be4vkr/asking_about_application/", "saved": false, "score": 1, "spoiler": false, "stickied": false, "text": "I’m in my senior year graduating with my BS in Biology early August and just applied for my first full time job for the summer. I applied about a week ago. Is it a good or bad idea to call and ask if they have viewed my application/express my interest? I don’t want to ruin my chances. My friend applied for the same job a while back (very overqualified) and was just denied. \nThanks ", "title": "Asking about application?", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/jobs/comments/1be4vkr/asking_about_application/"}, {"author": "terumitsu-", "author_flair_text": null, "clicked": false, "created_utc": 1710368079.0, "distinguished": null, "edited": false, "id": "1be4jx6", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1be4jx6", "num_comments": 2, "over_18": false, "permalink": "/r/jobs/comments/1be4jx6/jobs_best_for_a_15_year_old/", "saved": false, "score": 1, "spoiler": false, "stickied": false, "text": "So I’m 15 years old and haven’t had a job yet and i’m close to just getting a job at Dairy Queen but wanted to ask your guys’ opinions. \nI’ve got decent experience with social media accounts and all my friends say I’m talented and good with learning algorithms fast. \n\nObviously could just be dumb luck but have had 3+ accounts blow up and consistently get hundreds and thousands of views. (not counting the 10+ friends i’ve helped with their social media) Haven’t really been able to find anything like this that I could do at my age so if anyone has any ideas I would appreciate it.\n\n** Obviously that’s just one thing that i’d like to do. I’m more than open to trying anything, and more than happy for it to me at-home/online jobs. **\n\nIf you want any more information just ask!\n", "title": "Jobs best for a 15 year old", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/jobs/comments/1be4jx6/jobs_best_for_a_15_year_old/"}, {"author": "Wise_Cut_2543", "author_flair_text": null, "clicked": false, "created_utc": 1710367653.0, "distinguished": null, "edited": false, "id": "1be4dl4", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1be4dl4", "num_comments": 0, "over_18": false, "permalink": "/r/jobs/comments/1be4dl4/how_to_bait_your_employer_if_they_go_around/", "saved": false, "score": 1, "spoiler": false, "stickied": false, "text": " My estimation suggests that there are a few people lurking in here whom had employers that literally \"baited\" employees just to fire them even though they gave the employee the directives on how to carry out their job task's, etc. Think about it kind of like an intentional \"wash, rinse, repeat\" cycle.  I know there are a few unstable supervisors at my place of employment. For example, I know they had a gender discrimination suit in the past few years. I almost don't have to wonder much which \"internal Powers\" that came from. I also know that I've seen a few other employees \"mysteriously be dismissed\" as well. I am concerned that they will also try and bait me for basically doing the job task's that they trained/asked me to do. How did you set up your defenses to counter them? How do you prepare yourself to be ready to go to the unemployment office and collect for wrongful termination at such a point if one would occur? More or less, they ask and train you to do things a certain way and then they actually don't like what they asked you to do then they find a reason to not like it and dismiss you for example. What did you do in your own case? ", "title": "How to \"Bait\" your employer if they go around \"Baiting\" other employees to Fire them? Any Good ideas?", "upvote_ratio": 0.99, "url": "https://www.reddit.com/r/jobs/comments/1be4dl4/how_to_bait_your_employer_if_they_go_around/"}, {"author": "Apprehensive-Ebb6002", "author_flair_text": null, "clicked": false, "created_utc": 1710367365.0, "distinguished": null, "edited": false, "id": "1be4973", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1be4973", "num_comments": 0, "over_18": false, "permalink": "/r/jobs/comments/1be4973/do_internships_tend_to_take_longer_to_hear_back/", "saved": false, "score": 1, "spoiler": false, "stickied": false, "text": "hi! I had my first interview about a month ago and a final round interview exactly two weeks ago.\n\nthe job posting barely closed around the time of my final interview which all felt great. i'm sorta assuming that they might be interviewing other people and normal jobs just want to fill the position asap - ish but I also did a followup a few days ago with no response. \n\ni hate waiting lol but ig im gonna keep applying in the meantime...", "title": "Do internships tend to take longer to hear back from(than normal job openings)", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/jobs/comments/1be4973/do_internships_tend_to_take_longer_to_hear_back/"}]