[{"author": "Tiffany_truer", "created_utc": 1708953613.0, "link_flair_template_id": "7f3169f0-3477-11e8-bd00-0e56aa346a78", "link_flair_text": "Work/Life balance", "num_comments": 3294, "post_id": "1b0hc90", "score": 54224, "subreddit": "jobs", "text": "\"\"", "title": "Child slavery", "upvote_ratio": 0.84, "url": "https://i.redd.it/6zthvu3tjxkc1.jpeg"}, {"author": "ZadarskiDrake", "created_utc": 1707574312.0, "link_flair_template_id": "afed3f46-05b8-11e6-8a4b-0e9a8fb8e6bb", "link_flair_text": "Companies", "num_comments": 627, "post_id": "1anh74l", "score": 37996, "subreddit": "jobs", "text": "\"\"", "title": "If this isn’t the truth lol", "upvote_ratio": 0.94, "url": "https://i.redd.it/tha95en4nrhc1.jpeg"}, {"author": "Common_Thinker", "created_utc": 1709469668.0, "link_flair_template_id": "7f3169f0-3477-11e8-bd00-0e56aa346a78", "link_flair_text": "Work/Life balance", "num_comments": 1510, "post_id": "1b5ga2c", "score": 37091, "subreddit": "jobs", "text": "\"\"", "title": "Triple is too little for now", "upvote_ratio": 0.92, "url": "https://i.redd.it/om3beo6y54mc1.jpeg"}, {"author": "Deathrider66", "created_utc": 1709647359.0, "link_flair_template_id": "119d3960-05ac-11e6-8bc7-0ec36f9f170d", "link_flair_text": "Compensation", "num_comments": 918, "post_id": "1b75xc7", "score": 36227, "subreddit": "jobs", "text": "\"\"", "title": "Those meetings are so important.", "upvote_ratio": 0.94, "url": "https://i.redd.it/dyo35p0dvimc1.jpeg"}, {"author": "maximagent", "created_utc": 1706806767.0, "link_flair_template_id": "d1f08d62-05ab-11e6-9ea7-0ebb139b9f2d", "link_flair_text": "Applications", "num_comments": 731, "post_id": "1agfpy0", "score": 28701, "subreddit": "jobs", "text": "\"I couldn\\u2019t resist.\"", "title": "Red Bull declined my job application, so I sent this snazzy response", "upvote_ratio": 0.95, "url": "https://i.redd.it/fmcgtlot80gc1.jpeg"}, {"author": "Secure-Marionberry80", "created_utc": 1704566509.0, "link_flair_template_id": "119d3960-05ac-11e6-8bc7-0ec36f9f170d", "link_flair_text": "Compensation", "num_comments": 680, "post_id": "1906s4k", "score": 27158, "subreddit": "jobs", "text": "\"\"", "title": "“Thank you for all your hard work and dedication to the team”", "upvote_ratio": 0.9, "url": "https://i.redd.it/3i1fgqod7vac1.jpeg"}, {"author": "Notalabel_4566", "created_utc": 1709315905.0, "link_flair_template_id": "afed3f46-05b8-11e6-8a4b-0e9a8fb8e6bb", "link_flair_text": "Companies", "num_comments": 964, "post_id": "1b40s2z", "score": 26929, "subreddit": "jobs", "text": "\"\"", "title": "Have you noticed this lately?", "upvote_ratio": 0.95, "url": "https://i.redd.it/fee497echrlc1.png"}, {"author": "couchtater12", "created_utc": 1705066323.0, "link_flair_template_id": "1f4ca128-8779-11eb-9ba4-0e1836b024ef", "link_flair_text": " HR ", "num_comments": 4448, "post_id": "194v4rm", "score": 20325, "subreddit": "jobs", "text": "\"Is this legal?  Does anyone know the Cleveland Clinic\\u2019s standard time for a BOW (bowel \\ud83e\\udd2d) movement?  Imagine getting written up or dinged on your review because you didn\\u2019t relax your sphincter and pinch it off quick enough\\ud83d\\ude2c \\n\\nI get it, these policies stem from people who fuck around and waste time in the bathroom during the workday - but at what point are organizations crossing the line?\"", "title": "Poop on your own time, dammit! 🤭", "upvote_ratio": 0.94, "url": "https://i.redd.it/7czo3a9lh0cc1.jpeg"}, {"author": "thequirkyquacker", "created_utc": 1687240956.0, "link_flair_template_id": "afed3f46-05b8-11e6-8a4b-0e9a8fb8e6bb", "link_flair_text": "Companies", "num_comments": 2888, "post_id": "14e2mvn", "score": 19912, "subreddit": "jobs", "text": "\"  I was told by everyone how there is a massive shortage of of trade workers these days (with a healthy sprinkle of \\\"kids don't wanna work hard these days\\\" obviously) . So here I am 2 years into my electrical apprenticeship and I totally get why no one wants to do this. \\n\\n  I have worked with 5 separate mechanics in my time and every one of them it's the same story. It's a old guy who's been doing this for years and forgets I just started and don't know what im doing. Instead of training me ( you know, like they are supposed to) I get screamed and yelled at for not understanding everything right off the bat. This is usually followed by a lengthy tirade about \\\"back in my day when men really worked\\\" and then more verbal abuse. I have been threatened with physical violence ( \\\"you keep fucking up I'll beat your ass\\\" ) and some good old fashioned reminiscing like \\\" I remember when you could hit your apprentices, those where the good days\\\". \\n\\n  Overall, 2 years in and I'm sick of this super macho old school mentality and feel like my progress in regards to actually learning the trade is going nowhere. I'm curious if I just have a unique skill in finding crappy places to work or if others in the trades have experienced similar things.\\n\\nEdit: I'm truly overwhelmed by the response and it's good to know I'm not alone in this. Thank you everyone for the advice I will definitely try to see if this can be worked out. I will say that my situation is a bit complicated because the guy I work with is partial owner of the company so it makes \\\"going above his head\\\" a non possibility.\"", "title": "I was told there is a shortage of trade workers and now I know why", "upvote_ratio": 0.94, "url": "https://www.reddit.com/r/jobs/comments/14e2mvn/i_was_told_there_is_a_shortage_of_trade_workers/"}, {"author": "rolgriff", "created_utc": 1703285217.0, "link_flair_template_id": "119d3960-05ac-11e6-8bc7-0ec36f9f170d", "link_flair_text": "Compensation", "num_comments": 2202, "post_id": "18or2xq", "score": 19675, "subreddit": "jobs", "text": "\"Candy cane was broken and the mix was ripped, they spent more on shipping \\ud83e\\udd26\\u200d\\u2642\\ufe0f\"", "title": "Happy holidays from my department", "upvote_ratio": 0.95, "url": "https://i.redd.it/g6bzn82gdx7c1.jpeg"}, {"author": "LilyPadLover_26", "created_utc": 1686052134.0, "link_flair_template_id": "7f3169f0-3477-11e8-bd00-0e56aa346a78", "link_flair_text": "Work/Life balance", "num_comments": 2202, "post_id": "142dgpf", "score": 15758, "subreddit": "jobs", "text": "\"My family has a trip planned that will require me take off 1.5 days. I put in the request in March for this June trip and initially without looking at the PTO calendar my boss said \\u201csure that should work\\u201d. My entire family got the time approved and booked the trip. She then told me too many people (2 people) in the company region are off that day, but since our store has been particularly slow lately she might be able to make it work but she wouldn\\u2019t know until a week before. So I held out hope until this week and she told me there\\u2019s no way for it to work. By the way, I\\u2019m an overachieving employee that bends over backward any chance I get to help the company. This family vacation is already booked. My family and I discussed it and we think I should just tell her \\u201cI won\\u2019t be in these days. We talk about a work/life balance all the time and this is it. When it comes between work or time with family, family will always win. I am willing to accept whatever disciplinary action is appropriate, but I will not be coming into work those days.\\u201d\\n\\nThoughts?\"", "title": "PTO denied but I’m not coming into work anyway", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/jobs/comments/142dgpf/pto_denied_but_im_not_coming_into_work_anyway/"}, {"author": "None", "created_utc": 1705333016.0, "link_flair_template_id": "fb0590aa-e252-11e2-9a2b-12313b0c8c59", "link_flair_text": "Article", "num_comments": 2509, "post_id": "197bkas", "score": 14954, "subreddit": "jobs", "text": "\"\"", "title": "Putting in a notice, is this acceptable?", "upvote_ratio": 0.93, "url": "https://i.redd.it/a5c9qwslimcc1.jpeg"}, {"author": "Beta_Nerdy", "created_utc": 1703168787.0, "link_flair_template_id": "f95f85fa-05ac-11e6-8dae-0ec36f9f170d", "link_flair_text": "Office relations", "num_comments": 1748, "post_id": "18no8a8", "score": 14718, "subreddit": "jobs", "text": "\"I have been formally warned my job is at risk for having terrible odors!\\n\\n(If you click on my user name on the Reddit page you will see that I have lots of crazy- but true- stories about a boss that wants me gone.)\\n\\nI need to hold out 9 more months with the company to get my pension!  If I leave before then my pension will be cut by 50% or more.\\n\\nIn his latest effort to get rid of me, the boss has pulled me into his office and showed me an official written warning about my bad body odor and bad breath.  He tells me that a number of employees have come to him and complained and said it is nearly impossible to be in the same room as me.  The Facility Human Resources Director was also in the meeting and started to lecture me about personal hygiene.\\n\\nI told both of them that my personal hygiene, appearance and health is very important to me.  I shower ever day, use high quality soap and deodorant, brush my teeth four times a day  (YES!) and use mouth wash.  I wash my clothes with high quality laundry detergent in a new washer/dryer and don't wear my clothes more than once between washings. They just rolled their eyes and said they don't believe me.\\n\\nI asked friends and family in and out of the office if I had body odor and bad breath and they said absolutely not.\\n\\nMy lawyer says we need to demand a formal workforce investigation where an outside neutral party would interview staff to see if there is any truth to my bad breath and body odor.  And look into the toxic workplace I am facing with my boss constantly screaming at me.  My situation gets worse every day!\"", "title": "My crazy boss has given me a formal warning for having bad breath and body odor!", "upvote_ratio": 0.9, "url": "https://www.reddit.com/r/jobs/comments/18no8a8/my_crazy_boss_has_given_me_a_formal_warning_for/"}, {"author": "SheetsGiggles", "created_utc": 1518893862.0, "link_flair_template_id": "04968da2-266d-11e6-ac6c-0e8b6e32d68b", "link_flair_text": "Resumes/CVs", "num_comments": 1469, "post_id": "7y8k6p", "score": 14623, "subreddit": "jobs", "text": "\"**December 2022 edit:** OP here (Colin at [Sheets & Giggles](https://sheetsgiggles.com)). By popular demand, I made a [Google Doc](https://docs.google.com/document/d/1QcZgLCcauW2k1cIC9JcGQFAIfrszyIE2/edit?usp=sharing&ouid=118390084167518141296&rtpof=true&sd=true) for people without MS Word, and I immortalized this post and free template for posterity off Reddit at [SheetsResume.com](https://sheetsresume.com/resume-template). As layoffs mount (yet again), I also wanted to highlight [Part 2 of this post](https://www.reddit.com/r/jobs/comments/8hs6xc/part_deux_of_the_top_post_of_all_time_on_rjobs_im/) (my 10 best job hunting FAQs / advice).\\n\\nI can't believe it's been almost *5 years* since I wrote this! My free [resume template](https://sheetsgiggles.com/template) (Word doc download link) has been downloaded millions of times, and thousands of people have messaged me to let me know it helped them find jobs and change career trajectories, which I'm just so so happy about. When I wrote this in Feb 2018, S&G was still months away from shipping its *first* box of eucalyptus sheets, and now we've shipped hundreds of thousands of orders... and even have our own [mattress](https://sheetsgiggles.com/products/eucalyptus-mattress)! Crazy what can happen in a few years. If you have questions, I still try to answer PMs and new comments as often as I can, and feel free to connect on [LinkedIn](https://www.linkedin.com/in/colindmcintosh) (mention Reddit!). Happy holidays, and see you again in 2 years when I inevitably make another edit! Much love to you all.\\n\\n**April 5, 2020 edit:** I've been getting more PMs and messages about this post lately (like [this awesome one last night](https://imgur.com/gallery/28s3ny3) sent to Sheets & Giggles' IG), possibly from the historic layoffs in the US due to COVID\\u201319. Whether or not that's the case for you, I sincerely hope this resume format helps you find a better job than you had going into this mess. In addition to having [S&G help how we can](https://sheetsgiggles.com/blogs/news/s-gs-response-to-the-covid-19-crisis),  I'm going to do my best to answer Reddit PMs and emails that come in re: job hunting during April as people face this crisis. (Please at least edit your resume into my format below before asking me for a critique, as my first advice to anyone who hasn't will be to guide you to my format.) All my best to you and yours, and I hope you're all staying safe out there.\\n\\n**11/17/2018 last edit (psyche):** I'm working 16+ hour days as CEO of [Sheets & Giggles](https://sheetsgiggles.com) nowadays, so I unfortunately don't have time to reply to PMs (get about 10 a day still). So sorry! If you have more questions, please see [this follow-up thread with FAQs](https://www.reddit.com/r/jobs/comments/8hs6xc/part_deux_of_the_top_post_of_all_time_on_rjobs_im/) I did a couple months ago. Good luck everyone! - Colin at S&G\\n\\n---\\n\\n#Original Post:\\n\\nThere was a recent post on Reddit where someone was lamenting that they had sent out dozens of applications, but hadn't heard back from anyone. I commented and told them they probably had a bad resume format and to PM me with it so I could review it for them, and about 50 other redditors ended up sending me their resumes to review. I don't have time to do all of them, so I decided to write this post and share a [downloadable editable Word doc resume format](https://sheetsgiggles.com/template) in the hope that it fulfills my personal obligations (*note: delete the footer before sending out!*). Here's a [preview](https://imgur.com/gallery/Y5sHcAI) of the resume.\\n\\nI'll keep it short and sweet, and hopefully many of you find this useful.\\n\\n---\\n\\n*Source: This quick excerpt is from a longer [blog on my website](https://sheetsgiggles.com/blogs/news/sheets-and-giggles-fastest-growing-startup-in-colorado). My company ([Sheets & Giggles](https://sheetsgiggles.com)) makes sustainable eucalyptus bedding, so this is a little out there.*\\n\\n---\\n\\n**General resume advice:**\\n\\n* Use a professional-looking gmail, outlook, or personal domain email address. Delete your hotmail with extreme prejudice.\\n\\n* Don't put an objective section or summary. It'll be skipped, and it's space that can be used better.\\n\\n* Unless you have 20+ years' experience, make it 1 page. You can do it.\\n\\n* Don't put your full address. \\\"City, State\\\" is enough.\\n\\n* Name your resume \\\"\\u200bFirstName LastName Resume\\\" and that's it. Never submit it with \\\"(Project Management)\\\" or \\\"Final\\\" or \\\"2018\\\" or literally anything else in the file name.\\n\\n* If emailing your resume, always submit it as a PDF, never as a Word doc. You never know how wonky a Word doc will look on someone else's machine. If uploading to an online application that uses resume parsing software, you can upload the Word doc as well or if it's required to do so.\\n\\n* Try to read it in 10 seconds or less and see what you take away from it. That's about the initial screen time before someone makes an initial up/down decision, so you'll want to examine it from that perspective.\\n\\n* Interests are important because it gives the interviewer something to connect with you on, and it makes you more than just a faceless resume. If you put Seinfeld, I promise someone will ask you what your favorite episode of Seinfeld is (mine's the Soup Nazi).\\n\\nThat's the most important stuff. [Here's that resume template download link again](https://sheetsgiggles.com/template). If you have more questions about job hunting, resumes, or career advice in general, just PM me and I'll try to get back to you before long.\\n\\n**Edit:** damn, thanks for the gold! Super glad this advice is helping so many people; the comments have totally made my day.\\n\\n**Edit 2:** out and about so trying to respond to everyone on mobile, but it's slow going. I'll get back to all questions in comments asap.\\n\\n**Edit 3:** my inbox is ruined, but having a blast helping everyone with their specific questions. Keep firing away.\\n\\n**Sunday edit:** coming on 24 hours and the questions are still rolling in! I'm slammed today running a [photoshoot](https://i.imgur.com/sOHn0zw.jpg) for my company (the company on the resume template, [Sheets & Giggles](https://i.imgur.com/rKXmkFT.jpg)), so I'll jump back in when I can later. Lots of PMs to sort through too!\\n\\n**Edit 5:** See how clean those sheets are? [Accidentally shot a Tide ad](https://imgur.com/6Zc0YBm).\\n\\n**Monday night edit:** still answering PMs and comments :)! Hit me up anytime with your job hunting questions.\\n\\n**Wednesday edit:** over the last few days, I've responded to probably 500+ combined questions in the comments and PMs. PMs still rolling in. I think I'm going to make a \\\"resume and job hunting FAQ\\\" post based on these questions!\\n\\n**02/27/2018 edit:** PMs and comments still coming in, and I'm not even kidding when I say that I've had at least 10 people message me telling me they've gotten a slew of interviews since they switched their format, and two people have now told me they found jobs after switching to this format in the week and a half since I posted this. Unbelievable, makes me so happy.\\n\\n**03/28/18 edit:** Still owe a couple dozen more PM responses, bear with me. Also just got a few more messages from people describing how they found a job after switching to this template! Makes my day every time I get that message.\\n\\n**04/30/2018 edit:** I'll be posting something soon that answers all the resume and job hunting FAQs I've gotten from about 1,000 PMs! Have tried to help everyone, but my apologies if I haven't had time to get back to your particular message / question. Will link it here in one last edit when it's live on this sub!\\n\\n**05.07.2018 edit:** [Part Deux is live! Click here for resume FAQs and job hunting advice.](https://www.reddit.com/r/jobs/comments/8hs6xc/part_deux_of_the_top_post_of_all_time_on_rjobs_im/)\\n\\n**05/19/2018 edit:** ~~About 10~~ ~~20~~ ~~dozens~~ ~~hundreds~~ thousands of people have now messaged me saying they've gotten a job thanks to this post after previously spending months looking to no avail. Can't describe how happy that makes me.\\n\\n**07/03/2018 edit:** I'm sorry if I don't respond to your PM; it's just too much volume to handle. I've tried to help as many people as I can with these two posts, and I'll respond to PMs randomly but as often as I can!\"", "title": "I'm an ex-recruiter for some of the top companies in the world. I've screened tens of thousands of resumes, and today I published my preferred resume format, free to download as a Word doc, along with some general resume advice.", "upvote_ratio": 0.99, "url": "https://www.reddit.com/r/jobs/comments/7y8k6p/im_an_exrecruiter_for_some_of_the_top_companies/"}, {"author": "None", "created_utc": 1541339293.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 4192, "post_id": "9u3fww", "score": 13901, "subreddit": "jobs", "text": "\"It just seems odd that when I go on job boards to look at the hiring companies that most entry level (right out of college) jobs I see (client servicing, account management, misc office jobs, etc.) paying around $30k to $40k per year require a 4 year degree. So you're telling me I have to pay $50k to $200k to get a college education so I can make a miniscule income? Well it's no wonder why people cant pay back their student loans. Thoughts?\"", "title": "So real talk. Why are so may $30k to $40k per year jobs requiring a bachelors degree?", "upvote_ratio": 0.93, "url": "https://www.reddit.com/r/jobs/comments/9u3fww/so_real_talk_why_are_so_may_30k_to_40k_per_year/"}, {"author": "fancyfroyo5117", "created_utc": 1705640112.0, "link_flair_template_id": "fdc72fd0-05ac-11e6-b950-0ef0df358363", "link_flair_text": "Leaving a job", "num_comments": 1298, "post_id": "19ab08r", "score": 12793, "subreddit": "jobs", "text": "\"I have been with my company for almost 3 years and have not had one yearly review or raise.\\n\\nFor context, I work in a specialists medical office and I\\u2019ve worked in all positions from front desk to verifying insurances to rooming patients and translating. \\nAt some point we were extremely short staffed and I (along with two other girls who are no longer with the company) busted my ass working multiple positions and overtime for this office. \\nWhen I went on my maternity leave, I worked remotely for them to help catch up on work because they were severely understaffed, especially with me gone. \\nAfter my maternity leave ended, I wound up in a position where I needed to move out of state. I ended up staying with the same company and continued working remotely verifying insurances which I am still doing now. \\n\\nRecently, we have had changes in staff and new management, but the partners and owners of the company have not changed. \\nI decided to finally ask for a raise to $20/hr as I feel I\\u2019ve been a huge asset to the company and have gone above and beyond to prove my worth. \\nI emailed my manager with a letter outlining all of my duties and accomplishments, and how I feel I\\u2019ve earned a pay raise especially after three years of never asking for anything. I asked her to please consider my value to the company and give me a raise that will better allow me to meet my financial obligations. \\n\\nAnd her response honestly feels like a spit in the face. I feel disappointed and honestly disrespected. I understand working remotely has its benefits, but for the amount of work I do, and by myself since I am the only person in the whole office in my position, I would have thought they\\u2019d realize how invaluable I am to the company. \\n\\nThe first screenshot is her response giving me two \\u201coptions\\u201d. The second screenshot is my draft of a response/two week resignation notice.  \\n\\nI cannot continue working with this company and being undervalued and unappreciated. \\nI have two other jobs lined up right now so I definitely have a plan, but I really wanted to stay in the position I\\u2019m in.\\n\\nDo you think my response is okay? Should I change anything about it?\\nAny thoughts and advice welcome. TYIA\"", "title": "Disappointed after asking for a raise", "upvote_ratio": 0.97, "url": "https://www.reddit.com/gallery/19ab08r"}, {"author": "Secretsweetheart1313", "created_utc": 1703079683.0, "link_flair_template_id": "f95f85fa-05ac-11e6-8dae-0ec36f9f170d", "link_flair_text": "Office relations", "num_comments": 1244, "post_id": "18muutw", "score": 12640, "subreddit": "jobs", "text": "\"I clocked in 4 minutes before I was supposed to and she got mad at me she threw down her stuff. Which definitely raises two red flags. One being clocking in 4 minutes early is such an issue and the fact you are so worried the manager will get on to you. Like how bad is the manager????\"", "title": "The person who's training me sent me this text", "upvote_ratio": 0.92, "url": "https://i.redd.it/g9fdurfaeg7c1.jpeg"}, {"author": "ItsAllOver12345", "created_utc": 1683734461.0, "link_flair_template_id": "119d3960-05ac-11e6-8bc7-0ec36f9f170d", "link_flair_text": "Compensation", "num_comments": 5419, "post_id": "13duzbn", "score": 12381, "subreddit": "jobs", "text": "\"It\\u2019s insanely difficult to make money, I can barely fathom the competence, stress tolerance, and intelligence required for some of these $150,000+ jobs when it\\u2019s nearly impossible to even make $65,000. \\n\\nHow do people do it?\"", "title": "Why is it so difficult to make over $65,000 in the US?", "upvote_ratio": 0.86, "url": "https://www.reddit.com/r/jobs/comments/13duzbn/why_is_it_so_difficult_to_make_over_65000_in_the/"}, {"author": "Deathrider66", "created_utc": 1710037581.0, "link_flair_template_id": "17e834e6-05ac-11e6-a211-0ec36f9f170d", "link_flair_text": "Onboarding", "num_comments": 181, "post_id": "1baz9ax", "score": 12144, "subreddit": "jobs", "text": "\"\"", "title": "Welcome to the team.", "upvote_ratio": 0.98, "url": "https://i.redd.it/max06mwo3fnc1.jpeg"}, {"author": "Deathrider66", "created_utc": 1709489310.0, "link_flair_template_id": "bfaf55ca-0a83-11e6-b606-0e6c77463a9b", "link_flair_text": "Layoffs", "num_comments": 287, "post_id": "1b5nl73", "score": 11307, "subreddit": "jobs", "text": "\"\"", "title": "It was nice knowing you.", "upvote_ratio": 0.96, "url": "https://i.redd.it/8tawxweet5mc1.jpeg"}, {"author": "fitchaber10", "created_utc": 1691068501.0, "link_flair_template_id": "d1f08d62-05ab-11e6-9ea7-0ebb139b9f2d", "link_flair_text": "Applications", "num_comments": 2876, "post_id": "15h3yru", "score": 11071, "subreddit": "jobs", "text": "\"I have a masters and 10 years of experience and am struggling since a layoff on 3/31. I get interviews, but apparently companies are getting so many applicants it doesn't matter.\\n\\nAnyone else feel this way? I last looked for a job unemployed during the great recession and not even that was this bad...\\n\\nConstant ghosting, internal picked over me or no one hired and position still \\\"open\\\" months later.\\n\\nFuck this job market. The only jobs that exist are low pay trash jobs no one wants.\"", "title": "This is absolutely the trashiest job market I have seen in my 34 years alive.", "upvote_ratio": 0.93, "url": "https://www.reddit.com/r/jobs/comments/15h3yru/this_is_absolutely_the_trashiest_job_market_i/"}, {"author": "Responsible-Plenty64", "created_utc": 1699384956.0, "link_flair_template_id": "119d3960-05ac-11e6-8bc7-0ec36f9f170d", "link_flair_text": "Compensation", "num_comments": 347, "post_id": "17q23jb", "score": 10774, "subreddit": "jobs", "text": "\"They baited me with $19/hr, had me running a whole kitchen in a busy restaurant after they trained me on half of it, and refused to pay more than $17/hr because I \\u201cneeded more training, and needed to be louder with people about portioning\\u201d but refused to train me.\\n\\n(I\\u2019m in Ontario, Canada, minimum wage is $16.50/hr, with the hours I was getting I was making $14/wk more than minimum wage, after tax)\"", "title": "Boss text me when I was 5 minutes late for my shift, I text back 20 minutes later", "upvote_ratio": 0.94, "url": "https://www.reddit.com/gallery/17q23jb"}, {"author": "jayy_tw", "created_utc": 1702004560.0, "link_flair_template_id": "7f3169f0-3477-11e8-bd00-0e56aa346a78", "link_flair_text": "Work/Life balance", "num_comments": 1825, "post_id": "18dd1p0", "score": 10452, "subreddit": "jobs", "text": "\"I was feeling fine at work today, but as I drove home. I rapidly started sweating and having a throbbing headache so I took a test. I sent this picture letting him know I could not make it tomorrow. For context, the reason for the \\u201cbad timing\\u201d statement is the fact he texted me off work hours just before I took this test and when I was already feeling unwell. Is it me being unreasonable to excuse myself so I can care for my health? Will I really disappoint because so much of the team do rely on me for a lot of information and getting work done? I don\\u2019t feel he respects my personal needs or simply does not have the awareness, but also i truthfully don\\u2019t want to let the team down if possible. \\n\\nI did inform both a general manager and second-hand manager who were both understanding. (They\\u2019re quite occupied with lots of matters so mention to consider this guy i\\u2019m texting \\u201cMy Boss\\u201d.\\n\\nHow should I even respond to him or this case? Should I just go straight to HR? What are your guys\\u2019 opinions?\"", "title": "Having a fever and feeling unfit to make it in. “Boss” responded with this. What do I even say in this case?", "upvote_ratio": 0.95, "url": "https://i.redd.it/bvkzck0elz4c1.jpg"}, {"author": "ramblingwithryan", "created_utc": 1709827377.0, "link_flair_template_id": "fdc72fd0-05ac-11e6-b950-0ef0df358363", "link_flair_text": "Leaving a job", "num_comments": 330, "post_id": "1b8yarq", "score": 9982, "subreddit": "jobs", "text": "\"Imma try to hurry up and get to the point\\u2026 \\n-I knew the General Manager and Assistant GM at a previous hotel property. We became really close friends over the 5 years we\\u2019ve known each other.\\n-GM asked the AGM and I to follow her to a new hotel that was still under construction and set to open to public. \\n-I was the opening F&B Manager but wore all the hats you can possibly think of.\\n-Fast forward 1.5 years later, I get offered the Director of Sales & Marketing position. I was super excited to try something new. My great friend, the GM, even said I could try it out for 90 days to see if I would like it.\\n-fast forward 1.5 years later, I\\u2019m still DOS&M. Why? The GM kept hanging carrots in front of my nose and catering to what I wanted to do- which was travel a lot. \\n-I then go to the Super Bowl this past 2024 one in Vegas (I\\u2019m there for 2 weeks as a private contractor) which I\\u2019ve done the past two years in 2022 & 2023. \\n-I come back day after Super Bowl and I see that my job is posted on Indeed. I hit up my GM and her excuse is \\u201cI overheard from someone you were going to put in your two weeks when you got back.\\u201d Didn\\u2019t contact me. Didn\\u2019t ask what my plans were.\\n-The closest Friday rolls around and I noticed I didn\\u2019t get paid from my salaried hotel job. I hit up my GM and she said that I wasn\\u2019t at work at the hotel for the 2 weeks I was gone to Vegas, so they didn\\u2019t pay me\\n-The GM and I had a conversation before I left for the two weeks about my pay and I offered for the person who does my job while I was a way part of my salary. GM declines several times and said \\u201cNo, we gave ______ a $5.00 raise so she\\u2019d be compensated\\u201d \\n-There was no offer letter or contract for this position. I asked several times even at 1 year performance review. I did not know how many pto hours or sick hours I was entitled to. My salary was not signed off on- I knew my salary through text message.\\n-So I\\u2019m fed up and have this letter attached sitting in my email drafts\\n\\nTL;DR \\nWhile I\\u2019m away on a gig for two weeks, the GM gives an employee my full salary (does directly against what she and I discussed) and she posts my job on Indeed over hearsay. This is my resignation letter attached. \\n\\nIs this letter okay? \\nDo I have a lawsuit here?\\nProbably hr issues all over lol\"", "title": "I’m fed up", "upvote_ratio": 0.96, "url": "https://i.redd.it/d7ayj08nqxmc1.jpeg"}, {"author": "KarmaKarmaChameIeon", "created_utc": 1689185514.0, "link_flair_template_id": "0e81635a-05ac-11e6-9334-0e19f203b873", "link_flair_text": "Job offers", "num_comments": 2649, "post_id": "14xw4zi", "score": 9893, "subreddit": "jobs", "text": "\"So I recently signed a job offer with a giant company and once I looked at my actual salary in the system it did not match my offer letter. I pointed this out to the HR department (supported with evidence in my offer letter) and basically they said that they made a mistake and my compensation is 20% lower! I don\\u2019t think I have the money or the patience to sue a giant multinational corporation. Nor do I stand a chance. My supervisor just sort of acts like we are all at the mercy of HR and it\\u2019s not like HE made the mistake. Plus I still want to work for them! It\\u2019s a well paying job even after the 20% cut. Anything I can do besides just take it?!\"", "title": "“We made a mistake on your job offer” - 20% pay cut after accepting and onboarding with giant company. Anything I can do?", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/jobs/comments/14xw4zi/we_made_a_mistake_on_your_job_offer_20_pay_cut/"}, {"author": "OlympicAnalEater", "created_utc": 1696038658.0, "link_flair_template_id": "0e81635a-05ac-11e6-9334-0e19f203b873", "link_flair_text": "Job offers", "num_comments": 340, "post_id": "16vuahk", "score": 9819, "subreddit": "jobs", "text": "\"\"", "title": "Finding a job in 2023 be like:", "upvote_ratio": 0.98, "url": "https://i.redd.it/q8bwh6iptarb1.png"}, {"author": "headab0vewat3r", "created_utc": 1694457007.0, "link_flair_template_id": "fdc72fd0-05ac-11e6-b950-0ef0df358363", "link_flair_text": "Leaving a job", "num_comments": 764, "post_id": "16g32s4", "score": 9588, "subreddit": "jobs", "text": "\"I work for a medical facility. I was made aware that people who were contagious were made to come into work. I expressed my concern as I have a compromised family member. Was told that clinic policy requires you to find coverage UNLESS you are febrile, so despite being contagious since management wouldn't find coverage for them they would have to work. I said to this \\\"I understand you have policies for a reason and have to uphold them. That being said I do not see there being any positive outcome to this conversation so I am removing myself\\\". We use WhatsApp for work communication. I simply removed myself from the conversation. My boss is very toxic and I was not going to make my mental health worse over it. I then received this message (see attached screenshot). I know Texas does not have many employee protections but would it have been considered wrongful termination to have told me that I'm resigning?\"", "title": "Is it legal for my boss to tell me I'm resigning (Texas)", "upvote_ratio": 0.96, "url": "https://i.redd.it/r1yto3dm6onb1.png"}, {"author": "Character-Ad2455", "created_utc": 1708554791.0, "link_flair_template_id": "adfd903c-05b8-11e6-b9a4-0e9a8fb8e6bb", "link_flair_text": "Rejections", "num_comments": 2670, "post_id": "1awplaf", "score": 9561, "subreddit": "jobs", "text": "\"I have worked here since the 13th and just got this letter in the mail. This is my first job so I\\u2019m not sure how to deal with this. To me, it looks like they declined my position. My manager hasn\\u2019t mentioned it at all, nor have I showed him it.\"", "title": "What does this letter mean?", "upvote_ratio": 0.94, "url": "https://i.redd.it/jrn61ajlm0kc1.jpeg"}, {"author": "penguincrackers2019", "created_utc": 1703301220.0, "link_flair_template_id": "119d3960-05ac-11e6-8bc7-0ec36f9f170d", "link_flair_text": "Compensation", "num_comments": 394, "post_id": "18owas7", "score": 9031, "subreddit": "jobs", "text": "\"The deadline to use the credit was today. Now they are pushing it back til the 26th in hopes they \\u201cfix the issue\\u201d\\u2026\"", "title": "Company gifted us all a $25 DoorDash credit for Christmas. This is what happens when we try to use it.", "upvote_ratio": 0.98, "url": "https://i.redd.it/jidwnj51py7c1.jpeg"}, {"author": "manofandonamission1", "created_utc": 1683208319.0, "link_flair_template_id": "7f3169f0-3477-11e8-bd00-0e56aa346a78", "link_flair_text": "Work/Life balance", "num_comments": 1705, "post_id": "137lbn6", "score": 8823, "subreddit": "jobs", "text": "\"I work as a digital marketer and I have to work Monday-Friday, 9-5 in office. Yesterday I was sick, and since our boss is away and the second in command was out, I was allowed to work from home. The difference in quality of life is incredible. I signed into Canva on my computer, pulled up the company software and image database, logged into my email, and boom I was set for the day.\\n\\nI worked a flawless day from the comfort of my own home. I was able to run to Petco to grab some supplies for my pets, run to get some lunch without feeling rushed, and eat peacefully in my kitchen instead of surrounded by phones ringing and customers walking around. Today I'm back in office surrounded by my annoying coworkers, having to deal with all their nonstop talking, loud sounds, pointless questions, and coffee making. I've been here for 50 minutes and I'm already way more miserable.\\n\\nAnd it just begs the question, why do employers force employees who can easily do their job at home to come into the office all week? Seems nonsensical.\"", "title": "Why do employers force you to work in office all week for a job that can easily be done at home?", "upvote_ratio": 0.9, "url": "https://www.reddit.com/r/jobs/comments/137lbn6/why_do_employers_force_you_to_work_in_office_all/"}, {"author": "shippingdepartment", "created_utc": 1710082203.0, "link_flair_template_id": "e387d468-05ab-11e6-b3df-0e43b37a78c1", "link_flair_text": "Post-interview", "num_comments": 344, "post_id": "1bbc2k7", "score": 8726, "subreddit": "jobs", "text": "\"I got so tired of getting rejection emails that I sent a rejection email to one of the companies that I didn't want to work for.\\n\\n\"", "title": "I sent them a rejection email.", "upvote_ratio": 0.95, "url": "https://i.redd.it/n4vtv1jdsinc1.jpeg"}, {"author": "Samsmob", "created_utc": 1708064801.0, "link_flair_template_id": "119d3960-05ac-11e6-8bc7-0ec36f9f170d", "link_flair_text": "Compensation", "num_comments": 4187, "post_id": "1as1xlr", "score": 8695, "subreddit": "jobs", "text": "\"\"", "title": "Can my boss legally do this?", "upvote_ratio": 0.84, "url": "https://i.redd.it/jpvt4h8l5wic1.jpeg"}, {"author": "kkkan2020", "created_utc": 1703432921.0, "link_flair_template_id": "119d3960-05ac-11e6-8bc7-0ec36f9f170d", "link_flair_text": "Compensation", "num_comments": 205, "post_id": "18pxpbm", "score": 8351, "subreddit": "jobs", "text": "\"\"", "title": "your salary won't be very good starting out...", "upvote_ratio": 0.96, "url": "https://i.redd.it/bs1y9jnkk98c1.png"}, {"author": "txlario", "created_utc": 1690482112.0, "link_flair_template_id": "1f4ca128-8779-11eb-9ba4-0e1836b024ef", "link_flair_text": " HR ", "num_comments": 1572, "post_id": "15b9a1s", "score": 8151, "subreddit": "jobs", "text": "\"I was through a temp agency. I walked in on my boss watching porn and today they fired me. This happened a couple of weeks ago and I didn\\u2019t know what to do.\\n\\nMy mistake was confiding in 2 of my coworkers and asking them for advice on who I should go to. I decided to just bury the event and was later fired today and I guess they\\u2019ve been trying to replace me for awhile now.\\n\\nI didn\\u2019t feel 100% comfortable after this event and am trying to look at this as a positive but just feel so shitty that they didn\\u2019t even get my side of the story or see if i was okay. \\n\\nFrom what i hear they tried to say I was spreading rumors (i\\u2019m guessing the 2 coworkers i asked for advice spoke about it later on) but I just feel so sad that no one decided to see if i was okay, and why isn\\u2019t my boss getting reprimanded for literally watching porn in an open office in front of his employees.\\n\\nedit: i also wanted to add i brought it up to my coworkers due to my boss shifting attitudes after i caught him. he was cold and dismissive and when i needed help or info he would avoid me or ignore me. So i asked them for advice on what i should do since ive never been in that situation before.\\n\\nNot saying my actions were right i just wanted to give a little more context.\"", "title": "I was fired after walking in on my boss watching porn", "upvote_ratio": 0.93, "url": "https://www.reddit.com/r/jobs/comments/15b9a1s/i_was_fired_after_walking_in_on_my_boss_watching/"}, {"author": "None", "created_utc": 1620599188.0, "link_flair_template_id": "6406c11c-86ad-11e6-86c2-0e0536d0c06b", "link_flair_text": "Job searching", "num_comments": 290, "post_id": "n8p8sf", "score": 7845, "subreddit": "jobs", "text": "\"\"", "title": "We need more people like this", "upvote_ratio": 0.98, "url": "https://i.redd.it/fl8v3grw76y61.jpg"}, {"author": "Some-Cat-3454", "created_utc": 1694649159.0, "link_flair_template_id": "0e81635a-05ac-11e6-9334-0e19f203b873", "link_flair_text": "Job offers", "num_comments": 719, "post_id": "16i2z7f", "score": 7723, "subreddit": "jobs", "text": "\"I had a hair drug test for a state job and I received a letter in the mail that said I failed. I have never even seen cocaine in real life let alone used it. I asked if I could see the results and was told that they don\\u2019t do that. I thought that since it would be considered medical records, I would be entitled to it. Because of this, I don\\u2019t believe that I failed. Does anyone know if I have any legal recourse or is there a reason that I would fail even though I have never used it?\"", "title": "I tested positive for Cocaine during a pre-employment drug test", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/jobs/comments/16i2z7f/i_tested_positive_for_cocaine_during_a/"}, {"author": "BlueberryPancakes5", "created_utc": 1683290279.0, "link_flair_template_id": "7f3169f0-3477-11e8-bd00-0e56aa346a78", "link_flair_text": "Work/Life balance", "num_comments": 706, "post_id": "138kfe0", "score": 7446, "subreddit": "jobs", "text": "\"My job isn't extravagant and the pay isn't great but after working in retail for 10 years I love working in an office.\\n\\nI have my own cubicle to myself, I don't have managers hovering over me and micromanaging me all day. I have a set schedule every week which makes it so much easier to plan things. I know I'll have Saturday Sunday off every week and I never have to close again. I can go to the bathroom whenever I want for as long as I want, I can have coffee at my desk, or I can eat snacks at my desk. I can wear cute clothes to work instead of a uniform.\\n\\nI know a lot of people hate the standard 9-5 job but I just wanted to give a different perspective. I feel like after working in retail for so long it really makes me appreciate it so much more.\"", "title": "I love my 9-5 office job", "upvote_ratio": 0.94, "url": "https://www.reddit.com/r/jobs/comments/138kfe0/i_love_my_95_office_job/"}, {"author": "kumakuma1212", "created_utc": 1706656798.0, "link_flair_template_id": "fdc72fd0-05ac-11e6-b950-0ef0df358363", "link_flair_text": "Leaving a job", "num_comments": 513, "post_id": "1af2n9f", "score": 7200, "subreddit": "jobs", "text": "\"\"", "title": "This just happened to me. Not a 95% increase but 36%. I am laughing sooooo hard", "upvote_ratio": 0.98, "url": "https://i.redd.it/cqew4egounfc1.png"}, {"author": "Mountain_Molasses769", "created_utc": 1691299231.0, "link_flair_template_id": "afed3f46-05b8-11e6-8a4b-0e9a8fb8e6bb", "link_flair_text": "Companies", "num_comments": 1000, "post_id": "15jh5bv", "score": 7200, "subreddit": "jobs", "text": "\"1. **Skeleton Crews.** Basically, if one person is doing the work of three people with the same pay why hire more?  Who cares if that person is stressed out? Business is still running as usual and will hold out as long as they can. By not hiring more and keeping the headcount low, profit goes up and whoever is in the upper management gets a nice bonus.\\n2. **False Hiring and PPP Loans.** Ranging from small businesses to large corporations, many have received Payment Protection Program (PPP) Loans that were supposed to be used for payroll and other expenses during the pandemic. However, many of the loans were abused and pocketed by owners and then later forgiven. A condition for these loans to be forgiven is if a company is \\\"actively\\\" trying to hire but cannot fulfill these positions. That's why people are struggling to get interviews as well as seeing jobs being posted over and over again. They had no intention to hire in the first place. Basically, it was a huge money transfer and the top ate well.\\n3. **Everyone is hiring.** No, they are not. Only retail and fast food positions that barely pay a living wage and high stressed are only hiring is what they mean. Not the comfy white-collar jobs with good benefits cause who would give that up? Even then, these places are running on skeleton crews as well.\\n4. **Mass Layoffs.** You have now a lot of people including whom have more than 12+ years of experience looking for jobs now. A good chunk of them are willing to take lower-paying jobs because they have no choice but to put food on the table and pay bills. Now the entry-level or junior-level position you are applying for has become more competitive. Employers have the luxury to be picky and want a unicorn to be a yes man, a bootlicker, someone who does not talk back, who is overqualified, and willing to take a pay cut as well. Also, a lot of these companies have a \\\"monkey see monkey do\\\" mentality. Once a couple of companies started doing layoffs, then other companies started doing it only because \\\"it must be the right thing to do right now\\\"\\n5. **The Feds actually want unemployment to go up.** They want it to go up because the justification is that no job = no money = reduction in savings = lower purchasing power = reduction in inflation. Higher interest rates would lead more people to hold off on purchases they do not need which put less money in circulation and bring down inflation according to the federal government. Also, Powell said it is to \\\"discipline labor\\\" as well. But of course, there isn't a problem with corporations making record profits during high periods of inflation. It is estimated that 70% of inflation came from price gouging in which corporations raised the price more than they needed to and mask it as inflation. Anything but to tax the rich right? I'm sure trickle-down will happen anytime soon.\\n6. **Anti- WFH Propaganda.** Throughout the pandemic, multiple reports proved that WFH has increased productivity and worker well-being that has not been seen pre-pandemic. WFH was positively received. But all of a sudden Return-to-Office was necessary as WFH wasn't working even though as long you have a computer, desk, and WI-FI, the same work that can be done at the office, can be done better from home in most people's cases. This is later revealed that a lot of bigger players are tied up in real-estate investment of these corporate buildings and that tax revenue around the surrounding areas has decreased as well which the local government does not like.  If you WFH, there is no need to buy food on the way to work or buy expensive lunch downtown, and then waste money on gas. However, with the big RTO push, a lot of employees are either resigning or outright refusing because why would you go backward on quality of life?  I even was disqualified from an interview for asking about remote policy but it is what it is. Remote work is in hot demand yet employers refuse to acknowledge it.\\n\\nThere's more to why the job market is trash right now of course but this is JMO from all the reports and posts I have been reading. Feel free to add or even counter any of the points I made. Any comments are appreciated\"", "title": "Reasons why this job market is horrible.", "upvote_ratio": 0.94, "url": "https://www.reddit.com/r/jobs/comments/15jh5bv/reasons_why_this_job_market_is_horrible/"}, {"author": "Raspberry_Anxious", "created_utc": 1685562758.0, "link_flair_template_id": "dc491ca2-05ab-11e6-97de-0ec36f9f170d", "link_flair_text": "Interviews", "num_comments": 829, "post_id": "13ww59x", "score": 6966, "subreddit": "jobs", "text": "\"I have a job interview and arrived on time. His staff told me he is running late, so I have been sitting alone in a back room for an hour. \\n\\nShould I stay, try to reschedule, or just leave? Because this feels very unprofessional.\\n\\nI\\u2019m 22, haven\\u2019t had many interviews before. Is this normal?\\n\\n\\nUpdate: just had the interview, this guy doesn\\u2019t apologize for being late, just tells me \\u201cthanks for waiting\\u201d. \\n\\nHe didn\\u2019t mention a single thing about the job, my pay, or even what I\\u2019d be doing. Then offers me the job immediately. I said no and left.\\n\\n\\n\\nEdit: Wow this blew up like crazy! I see a lot of questions so I\\u2019ll try to answer some here. \\n\\nPrior to this interview I had a zoom one with two ladies. They were both professional and respectful, which is the main reason I waited so long for this one. \\n\\nI was already skeptical waiting, but decided to stick it through because I had already spent like 40 mins sitting there. After I met the guy, I immediately knew I didn\\u2019t want to work for him. That\\u2019s why I didn\\u2019t ask any questions about pay, hours, etc. \\n\\nThe interview in total lasted maybe 10 mins. He asked for my availability, and the basic \\u201cwhat are your skills, how can they apply here\\u201d type of questions. But that was really it, nothing about the actual job, pay, or what I\\u2019d be doing. He asked if I had any questions to which I said no. Then said they are looking to hire immediately and asked if I wanted the job.\"", "title": "My interviewer is 1 hour late. Should I just leave?", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/jobs/comments/13ww59x/my_interviewer_is_1_hour_late_should_i_just_leave/"}, {"author": "eattherichstars", "created_utc": 1625159226.0, "link_flair_template_id": "6406c11c-86ad-11e6-86c2-0e0536d0c06b", "link_flair_text": "Job searching", "num_comments": 1134, "post_id": "obq9ew", "score": 6845, "subreddit": "jobs", "text": "\"This is just getting ridiculous here. What a joke of a society we are.\"", "title": "A 9-5 job that pays a living is now a luxury.", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/jobs/comments/obq9ew/a_95_job_that_pays_a_living_is_now_a_luxury/"}, {"author": "Baby_Hippos_Swimming", "created_utc": 1684698378.0, "link_flair_template_id": "dc491ca2-05ab-11e6-97de-0ec36f9f170d", "link_flair_text": "Interviews", "num_comments": 626, "post_id": "13o4cot", "score": 6769, "subreddit": "jobs", "text": "\"Anyone else? Or do I just have a particularly bad attitude?\\n\\nEDIT - Wow, I didn't expect my petty little complaint to get so many upvotes. I guess many of you found this relatable. \\n\\nTo those of you saying \\\"why don't you only apply to companies you are passionate about?\\\" I'm a GenXer, my generation has a good work ethic but mostly sees employment as a transactional relationship. It's extremely rare that I'm going to be passionate about any major corporation. They're not passionate about me, they'll lay my ass off in a heartbeat if it increases shareholder value.\"", "title": "I hate researching a company for interviews and pretending like I'm so enthusiastic about what they do when 9 times out of 10 I couldn't care less.", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/jobs/comments/13o4cot/i_hate_researching_a_company_for_interviews_and/"}, {"author": "Crunchy-Cucumber", "created_utc": 1709954623.0, "link_flair_template_id": "119d3960-05ac-11e6-8bc7-0ec36f9f170d", "link_flair_text": "Compensation", "num_comments": 1542, "post_id": "1ba7ss3", "score": 6711, "subreddit": "jobs", "text": "\"\"", "title": "This can't be real...", "upvote_ratio": 0.95, "url": "https://i.redd.it/ix4opuh098nc1.jpeg"}, {"author": "his_rotundity_", "created_utc": 1602771395.0, "link_flair_template_id": "dc491ca2-05ab-11e6-97de-0ec36f9f170d", "link_flair_text": "Interviews", "num_comments": 498, "post_id": "jbod57", "score": 6513, "subreddit": "jobs", "text": "\"**EDIT**: A little info from Glassdoor that I learned as part of my last job in marketing:\\n\\nThe most recent review left, regardless of its score, is weighted at 80%. This is why after a negative review is left, a company will routinely leave an onslaught of positive reviews to counterweight the negative one. Glassdoor is trash.\\n\\nAlso, some valuable nomenclature: an [*Active*](https://www.glassdoor.com/employers/blog/5-things-can-free-employer-account/) employer is one that uses the platform to respond to reviews and maybe some other trivial touchpoint engagement. An *Engaged* employer may be one that pays for the service. I'm inferring from the subtle threat in Glassdoor's own [content](https://www.glassdoor.com/employers/blog/opening-the-glassdoor-a-wise-move/).\\n\\n**EDIT 2**: Some people are pointing out that their algorithm had detected an identical review was submitted, which was the reason for my getting banned. Problem is, I didn't leave a second review. Like I said, the original review was live for 2 months and then it was removed for the reasons cited.\\n\\n**Original**: For the past few years, I've often defended Glassdoor as a useful resource as part of any job-seeker's overall job-seeking toolkit. \\n\\nAbout a year and a half ago, I interviewed with a company that had horrendous reviews. Literally, all 15 reviews were 1-star and for the same reasons. So in the interviews, I brought up some of the themes. The hiring manager, a decent man, admitted to all of it and said he was desperately and single-handedly trying to change those issues. So in this case, the negative reviews weren't a bunch of bitter employees; they were actual experiences and issues.\\n\\nI elected to join the company based on this honesty and the prospect of a challenge, and of course, it was exactly like how all those reviews had said it would be. It was awful. I was thankfully laid off due to COVID.\\n\\nAfter being laid off, I left a very detailed, thorough, cutting review that within a week of being posted, had 6 'helpful' upvotes or whatever. After two months, the review was removed suddenly for violating guidelines and so was every review I had ever written. Incredulous, I reached out to Glassdoor's content management team. They would not tell me exactly what the issue was, just that I was banned from participating in their community. Finally, a service manager emailed me to say they had some proprietary algorithm that had detected language that was in violation of Glassdoor's guidelines. To be clear, I didn't use any community guideline-violating language. Apparently, they detected an identical review had been written elsewhere.\\n\\n*I have a close family member that works for Glassdoor. I spoke to this person and found out that a very recent strategic repositioning for Glassdoor is that they are trying to become a PR company of sorts, so they are focusing on brand management for companies. As a result, they are getting very aggressive with negative review-takedowns while allowing very obviously fraudulent positive reviews to remain the same.*\\n\\nThis same company from which I was laid off, from June-August, posted 10 5-star reviews, each of which was of similar length, all with just about the same thing to say. Cliches like, \\\"great culture\\\", \\\"build your skills\\\", \\\"enlightened management\\\", \\\"cool tech\\\", \\\"takes care of employees\\\". I reached out to Glassdoor and asked them to use their \\\"proprietary algorithm\\\" to see if there was any fraud in that content, to which they said no, there was no violation.\\n\\nSo, what I'm getting at: with Glassdoor's supposed strategic pivot to brand management, it is becoming even less reliable than it was before.\"", "title": "A Warning About Glassdoor", "upvote_ratio": 0.99, "url": "https://www.reddit.com/r/jobs/comments/jbod57/a_warning_about_glassdoor/"}, {"author": "notABadGuy3", "created_utc": 1689844882.0, "link_flair_template_id": "dc491ca2-05ab-11e6-97de-0ec36f9f170d", "link_flair_text": "Interviews", "num_comments": 634, "post_id": "154lxsz", "score": 6511, "subreddit": "jobs", "text": "\"This happened about a year ago. I was a fresh computer science graduate looking for my first job out of university. I already had a years experience as I did a 'year in industry' in London. I'd just had an offer for a London based job at \\u00a344k but didn't really want to work in London again, applied hoping it was a remote role but it wasn't.\\n\\nAnyway, I see this job for a small company has been advertised for a while and decided to apply. In the next few days I get a phone call asking me to come in. When I pull into the small car park next to a few new build houses converted to offices, I pull up next to a gold plated BMW i8. Clearly the company is not doing badly.\\n\\nGo through the normal interview stuff for about 15mins then get asked the dreaded question \\\"what is your salary expectation?\\\". I fumble around trying to not give exact figures. The CEO hates this and very bluntly tells me to name a figure. I say \\u00a335k. He laughed. I'm a little confused as this is the number listed on the advert. He proceeded to give a lecture on how much recruitment agencies inflate the price and warp graduates brains to expect higher salaries. I clearly didn't know my worth and I would be lucky to get a job with that salary. I was a bit taken aback by this and didn't really know how to react.\\nSo I ask how much he would be willing to pay me. After insulting my github portfolio saying I should only have working software on there he says \\u00a320k.\\nAt this point I get up, shake his hand, thank him for the time and end the interview.\\n\\nI still get a formal offer in the form of a text message, minutes after me leaving. I reply that unfortunately I already have an offer for over double the salary offered so will not be considering them any further. It felt good.\"", "title": "I walked out of a job interview", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/jobs/comments/154lxsz/i_walked_out_of_a_job_interview/"}, {"author": "targlo", "created_utc": 1689710722.0, "link_flair_template_id": "f95f85fa-05ac-11e6-8dae-0ec36f9f170d", "link_flair_text": "Office relations", "num_comments": 2263, "post_id": "1538ter", "score": 6458, "subreddit": "jobs", "text": "\"Basically the title. It\\u2019s gross and I can smell it. Somtimes it\\u2019s pretty loud too like he isn\\u2019t hiding it. It\\u2019s so disturbing.\\n\\nBackground: I work as a programmer in tech. Our office has many programmers in cubicles next to one another. It\\u2019s a nice place and I like the job, bosses, and everyone. \\n\\nWe recently got a new programmer. There are other personality traits I don\\u2019t particularly favor, but they are tolerable and can be overlooked.\\n\\nBut the farting is really getting to me.\\nIt\\u2019s gross and seems to happen always at the end of the day when there are less people in the office. I\\u2019m directly behind him and I can hear and smell the farts. \\n\\nI don\\u2019t know what to do, tell my boss? Confront him and ask if he could stop? LOL. It\\u2019s so weird I don\\u2019t even know how to approach it.\\n\\nIt\\u2019s comes to the point I just leave the room when he farts becuase why would I want to smell his farts.\\n\\nThis isn\\u2019t a joke post, I really don\\u2019t know what to do\"", "title": "New coworker keeps FARTING in the cubicle next to me.", "upvote_ratio": 0.92, "url": "https://www.reddit.com/r/jobs/comments/1538ter/new_coworker_keeps_farting_in_the_cubicle_next_to/"}, {"author": "veshterka", "created_utc": 1704875172.0, "link_flair_template_id": "adfd903c-05b8-11e6-b9a4-0e9a8fb8e6bb", "link_flair_text": "Rejections", "num_comments": 1605, "post_id": "1933ihi", "score": 6430, "subreddit": "jobs", "text": "\"\"", "title": "Is it just me? or is this the most passive aggressive job rejection email ever?", "upvote_ratio": 0.95, "url": "https://i.redd.it/5ly1jhz6pkbc1.jpeg"}, {"author": "MrIrrelevant-sf", "created_utc": 1706040031.0, "link_flair_template_id": "f95f85fa-05ac-11e6-8dae-0ec36f9f170d", "link_flair_text": "Office relations", "num_comments": 719, "post_id": "19dxf5t", "score": 6311, "subreddit": "jobs", "text": "\"We were in teams meeting. I was assisting and she was sharing a document on her screen. She accidentally showed her chat window where she and another lady were chatting about how I have a very thick accent and my English is \\u201cbroken\\u201d.\\n\\nI have been in the United States for 24 years. Graduated from Virginia tech with a dual masters degree. I am by no means perfect by damn I can\\u2019t do nothing about my accent.\\n\\nI wish I haven\\u2019t seen that chat. I actually really liked this lady and she is nothing but sweet to me when we talk on the phone. \\n\\nI don\\u2019t plan on even acknowledging I saw the chat. I guess I am just sad. My job is super stressful and difficult and I am doing the best I can.\\n\\nETA: wow this blew up. Thanks y\\u2019all. The support of this community made my day. \\n\\nETA2: I reported this to my employer. Thanks everyone for your kind comments, I am trying to read them all. Thank you so much.\\n\"", "title": "My coworker share her screen accidentally showing chats between her and others disparaging me.", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/jobs/comments/19dxf5t/my_coworker_share_her_screen_accidentally_showing/"}, {"author": "Alarming-Divide3659", "created_utc": 1683669731.0, "link_flair_template_id": "fb0590aa-e252-11e2-9a2b-12313b0c8c59", "link_flair_text": "Article", "num_comments": 1987, "post_id": "13d7kco", "score": 6107, "subreddit": "jobs", "text": "\"I just sit in a desk for 8 hours, creating value for a company making my bosses and shareholders rich, I watch the clock numerous times a day, feel trapped in the matrix or the system, feel like I accomplish nothing and I get to nowhere, How can people survive this? Doing this 5 days a week for 30-40 years? there\\u2019s a way to overcome this ? Without antidepressants\"", "title": "First office job, this is depressing", "upvote_ratio": 0.87, "url": "https://www.reddit.com/r/jobs/comments/13d7kco/first_office_job_this_is_depressing/"}, {"author": "cousingregg", "created_utc": 1688833007.0, "link_flair_template_id": "0e81635a-05ac-11e6-9334-0e19f203b873", "link_flair_text": "Job offers", "num_comments": 664, "post_id": "14u8dad", "score": 6046, "subreddit": "jobs", "text": "\"Hi everyone! I don't have too many people I can talk about this with, so I just wanted to share the news with someone. I work in software, and my current pay is $75k per year. The short version of my past few years is that I dropped out of college and have been making $45k/ year for a while pre-COVID. From there, 2020 hit me really hard. I was unemployed for about 6 months. I was looking for $18/hour jobs, then I got an opportunity in software sales. I started at a base salary of $50k per year. I got promoted once and then moved over to operations within my company, and my salary went up to $75k (where it is now).\\n\\n&#x200B;\\n\\nHaving been at my current company for 3 years, I've known that I was underpaid compared to the market for a while, so I started looking a few months ago. I applied to this job that's a manager-level position, which is one level above my current role. I had my final round interview at this company last week and it went pretty well. \\n\\n&#x200B;\\n\\nThe hiring manager set some time with me yesterday afternoon. When we hopped on the call, we talked for a few minutes before she offered me the job! $120k per year! In the moment, I didn't react much outwardly or inwardly beyond being pleasant and expressing thankfulness and excitement about the offer. I was trying to keep my hand close to my vest I suppose. I ended up thanking her and agreeing to follow up on Monday after I had the weekend to think about it (as I was in the process of a few other interviews as well). \\n\\n&#x200B;\\n\\nFor the hour after we hopped off Zoom, I didn't feel much. Then the offer letter hit my inbox. Seeing $120,000 in black and white is when it hit me. $10,000/month. I broke down and started crying. That's more money than I've ever made before by a long shot. I wanted to call my dad and tell him because I know that he'd be proud. He died in 2020, so I got hit with a wave of emotions from excitement to relief, to grief hitting me super hard. I've had a lot of money stress over the past few years, and this feels like a game changer. I'm hoping that this will accelerate my ability to build up savings and I want to be smart with it.\\n\\n&#x200B;\\n\\nAnyway, that's my ramble. Thanks for listening. Today I'm excited and am looking forward to accepting on Monday. I still wish I could call my dad up and tell him though; I know he'd be happy.\\n\\n&#x200B;\\n\\n&#x200B;\\n\\n&#x200B;\\n\\nEdit: wow, I appreciate all the love! The positivity is really great to see.\"", "title": "Just got my first 6 figure job offer! Just wanted to share with someone", "upvote_ratio": 0.92, "url": "https://www.reddit.com/r/jobs/comments/14u8dad/just_got_my_first_6_figure_job_offer_just_wanted/"}, {"author": "RealPrinceZuko", "created_utc": 1693944105.0, "link_flair_template_id": "afed3f46-05b8-11e6-8a4b-0e9a8fb8e6bb", "link_flair_text": "Companies", "num_comments": 940, "post_id": "16ayf5l", "score": 5927, "subreddit": "jobs", "text": "\"Seriously, everyone needs to be fully aware of this. The majority of data does not support in office work vs remote work. Companies were the most profitable they have ever been during the pandemic. Yes, that was also caused by an endless supply of helicopter money, but also because worker engagement was up a ridiculous amount. For me personally, I have never worked as hard as I have during the last few years, and I am fully remote.\\n\\nThe REAL reason for all these stupid articles is the commercial real estate situation. Companies are losing money (on paper) because their real estate values have all declined. Forcing employees back to the office would create more demand for surrounding homes/businesses, and affectively raise their portfolio value.\\n\\nThe other reason is control. The C-Suites job is to \\\"inspire\\\". They don't feel a sense of purpose without having you, the worker bee, around for them to view. They want to see you building their pyramid for them, even if it can be done remotely and more efficiently. It's a psychological thing that sociopaths in the C-Suite need. They're losing control, and they want to have it back to be more valuable since their perceived value is about steering the ship and not contributing anything meaningful.\\n\\nJust wanted to share and vent because I'm sick of this narrative. Remember the truth and ALWAYS bring it up.\\n\\nEDIT: Wow...I didn't expect to get this many responses. I just wanted to add that yes, there is frustration in my voice. I'm tired. I'm tired of the constant squeeze corporations apply to all of us daily. It's always happened throughout history, but it is MUCH worse now. Profit over People has never been more rampant then it is now. \\n\\nThe truth is, I believe this country is in desperate need of a workers rights movement. I would LOVE to see every talented individual out there push back against this RTO narrative that is solely based off \\\"a gut feeling\\\" from a handful of people. I'm just tired of being lied to, and it's a constant fight to keep the truth alive.\\n\\nAlso, to everyone that is saying things like \\\"suck it up and deal with it\\\", you're part of the problem. That dismissive attitude means you aren't open to change, and just accept things the way they are. You can change anything you want in this world, you just have to get enough people to say \\\"No\\\".\\n\\nTake care\"", "title": "Absolutely sick of the return to office hit pieces", "upvote_ratio": 0.91, "url": "https://www.reddit.com/r/jobs/comments/16ayf5l/absolutely_sick_of_the_return_to_office_hit_pieces/"}, {"author": "euphoricunknown", "created_utc": 1699210585.0, "link_flair_template_id": "fdc72fd0-05ac-11e6-b950-0ef0df358363", "link_flair_text": "Leaving a job", "num_comments": 1066, "post_id": "17oiv65", "score": 5871, "subreddit": "jobs", "text": "\"Can you believe this guy? The whole thing reminds me of my dad going off through text lol. It was a trash job and at tge end there wasn't anything to be smiling about so he's got me there. His staff was so unfriendly literally wouldn't move out of the way when I'd pass by with a tub of glasses. Also why would I tell them my coworker wasn't coming in? Do I look like a manager go fuck yourself lol. We all quit lol I was the last standing until he pulled that little girl shit lol.\"", "title": "Last texts from my toxic ex boss lol", "upvote_ratio": 0.9, "url": "https://www.reddit.com/gallery/17oiv65"}, {"author": "None", "created_utc": 1684634860.0, "link_flair_template_id": "6406c11c-86ad-11e6-86c2-0e0536d0c06b", "link_flair_text": "Job searching", "num_comments": 1405, "post_id": "13nfwqb", "score": 5814, "subreddit": "jobs", "text": "\"Every. Single. Job. \\n\\nCould be sticking labels on boxes in a rat infested warehouse.\\n\\n\\u2022 Educated to Bachelor degree level \\n\\n??? \\n\\nFor entry level positions\\u2026 literally run of the mill administrative positions. To send emails they want you to have a marketing degree ? \\n\\nWhat in the flying fu*k is going on. \\n\\nAm I supposed to just cease to exist or take on 50K+ debt to never earn enough to pay it off but earn just enough to have it deducted from my pay every month???? Whilst the bar raises every year??? And so does the interest. \\n\\nIt was Age 16 level qualifications then Age 18. Now graduate level\\u2026 next they\\u2019ll want you to have lectured for 10 years in finance at Harvard, Yale, Oxford and Cambridge, interned across 5 major global players and prevented economic disasters to input numbers on a fu*king spreadsheet. \\n\\nWho\\u2019s writing up these person specifications? God?!!?!?!!!\"", "title": "Since when did having *any* bachelor degree become the base standard for entry level positions?", "upvote_ratio": 0.94, "url": "https://www.reddit.com/r/jobs/comments/13nfwqb/since_when_did_having_any_bachelor_degree_become/"}, {"author": "Surprisinglysound", "created_utc": 1604529338.0, "link_flair_template_id": "280ed3a2-156f-11e6-8563-0e4275a4f1df", "link_flair_text": "Training", "num_comments": 508, "post_id": "jo6lc7", "score": 5793, "subreddit": "jobs", "text": "\"If every entry level job requires a year experience doing the job already, of course you will lack entry level candidates. it becomes catch 22, to get experience, you need a job, to get a job, you need experience. It should not be this complicated. \\n\\nWe need a push for entry level jobs. For employers to accept 0 years experience.\\n\\nWhy train people in your own country when you could just hire people who gained 5 years experience in countries with companies who are willing to hire and train entry level.\\n\\nIf we continue to follow this current trend, we will have 0 qualified people in America, since nobody will hire and train entry level in this country. Every skilled worker will be an import due to this countries failure.\\n\\nEdit: to add some detail. skilled people exist because they were once hired as entry level. if nobody hires the entry level people, you will always run out of skilled people because you need to be hired at some point to learn and become that high skill employee.\"", "title": "America is not lacking in skilled employees, America is lacking in companies willing to hire and train people in entry level roles", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/jobs/comments/jo6lc7/america_is_not_lacking_in_skilled_employees/"}, {"author": "ItsAllOver12345", "created_utc": 1685815680.0, "link_flair_template_id": "119d3960-05ac-11e6-8bc7-0ec36f9f170d", "link_flair_text": "Compensation", "num_comments": 2271, "post_id": "13zkmfl", "score": 5749, "subreddit": "jobs", "text": "\"Everyone in my career field that posts on Reddit tells me I\\u2019m \\u201cunderpaid\\u201d yet when I go out and look for jobs and get offers it\\u2019s for amounts they say shouldn\\u2019t be happening. I make 60k almost 4 years after graduating college and they insist that\\u2019s way underpaid yet I only see the opposite in the real world. \\n\\nI see people on here talking about making 150-200k and I don\\u2019t even understand how someone can offer you that much money.\"", "title": "How does everyone on Reddit make so much money?", "upvote_ratio": 0.91, "url": "https://www.reddit.com/r/jobs/comments/13zkmfl/how_does_everyone_on_reddit_make_so_much_money/"}, {"author": "Extractvanilla", "created_utc": 1617936493.0, "link_flair_template_id": "d1f08d62-05ab-11e6-9ea7-0ebb139b9f2d", "link_flair_text": "Applications", "num_comments": 235, "post_id": "mn7wyo", "score": 5726, "subreddit": "jobs", "text": "\"\"", "title": "Most caess", "upvote_ratio": 0.99, "url": "https://i.redd.it/3qp10kqba2s61.jpg"}, {"author": "funtonite", "created_utc": 1703290655.0, "link_flair_template_id": "119d3960-05ac-11e6-8bc7-0ec36f9f170d", "link_flair_text": "Compensation", "num_comments": 217, "post_id": "18osz99", "score": 5726, "subreddit": "jobs", "text": "\"Everyone at my job got a Christmas cake!\"", "title": "Merry Christmas from my work", "upvote_ratio": 0.98, "url": "https://i.redd.it/hw9djh3ltx7c1.jpeg"}, {"author": "Deathrider66", "created_utc": 1709089940.0, "link_flair_template_id": "17e834e6-05ac-11e6-a211-0ec36f9f170d", "link_flair_text": "Onboarding", "num_comments": 105, "post_id": "1b1vknl", "score": 5692, "subreddit": "jobs", "text": "\"\"", "title": "Every damn time ", "upvote_ratio": 0.99, "url": "https://i.redd.it/dwo6td9vt8lc1.jpeg"}, {"author": "Beta_Nerdy", "created_utc": 1702311631.0, "link_flair_template_id": "f95f85fa-05ac-11e6-8dae-0ec36f9f170d", "link_flair_text": "Office relations", "num_comments": 3409, "post_id": "18fya29", "score": 5661, "subreddit": "jobs", "text": "\"How does one react when your boss yells, screams and swears at you in a red faced anger?\\n\\nYes, the typical response is to walk away or quit on the spot.  That would not work in my case.  I now only have 9 months to survive at this job before I am eligible for a full pension of about $70K a year.  If I leave before that date or am fired my pension will be cut by 2/3rds.  Also I could not walk away because he blocked the path to the door.\\n\\nI have tried to be super polite, work twice as hard and keep my head down but that just gets him angrier, so more yelling and screaming.\\n\\nThe boss wants me to quit and is trying hard to find a reason to fire me but he was told to stand down after my lawyer worked with the senior management at the parent company.  Now he is trying to unnerve me and psyche me out so I quit.  Physiological warfare!\\n\\nHis boss and the local HR Director are of no help and senior management at our small office want me gone too.  The only thing helping me survive now is an effective Attorney who helped me submit a formal workplace grievance and oversight by the main corporate office Vice President of HR.\\n\\nWhat would you do if you were in my shoes?\"", "title": "Boss yelled, screamed and swore at me in red faced anger for 15 minutes! (Dumbfounded!)", "upvote_ratio": 0.94, "url": "https://www.reddit.com/r/jobs/comments/18fya29/boss_yelled_screamed_and_swore_at_me_in_red_faced/"}, {"author": "driver_dylan", "created_utc": 1709838936.0, "link_flair_template_id": "adfd903c-05b8-11e6-b9a4-0e9a8fb8e6bb", "link_flair_text": "Rejections", "num_comments": 2011, "post_id": "1b92tb7", "score": 5617, "subreddit": "jobs", "text": "\"Yesterday I went to a Job interview for a PT associate at TJ Max. they were very up front about the fact that there were only five openings and I when I arrived at 9AM I found that I was 15th in line for an interview. When I left there were thirty more people in line. All for a Part time job paying $13 an hour. \\n\\nThese were not just teens either, there were men and women ranging from teens to a few in their early sixties. I'm 43 M, with one eye, so what chance do I have. Things are not going to get better for me, they just aren't. I am so depressed right now I can barely get out of bed and tonight I will be forced to listen to the lies and bullshit spewed by people who have no idea how bad the country has gotten. \\n\\nThis isn't a political rant, both sided should be lined up against the wall of the promenade and horse whipped until the only thing remains can be picked up with a sponge. I have no hope, no light at the end of the tunnel, I have to the end of the month to make $2000 or I am put out on the street because even my car gets repoed at that point. \\n\\nI am a broken man.  \"", "title": "So how bad is it out there really?", "upvote_ratio": 0.89, "url": "https://www.reddit.com/r/jobs/comments/1b92tb7/so_how_bad_is_it_out_there_really/"}, {"author": "Musc3", "created_utc": 1690141163.0, "link_flair_template_id": "d1f08d62-05ab-11e6-9ea7-0ebb139b9f2d", "link_flair_text": "Applications", "num_comments": 1567, "post_id": "157o2hs", "score": 5583, "subreddit": "jobs", "text": "\"\"", "title": "What do y'all think of this kind of job posting? Necessary or cringe?", "upvote_ratio": 0.94, "url": "https://i.redd.it/uq4eyb9fprdb1.png"}, {"author": "Falahil", "created_utc": 1685372695.0, "link_flair_template_id": "0e81635a-05ac-11e6-9334-0e19f203b873", "link_flair_text": "Job offers", "num_comments": 397, "post_id": "13uxdwu", "score": 5574, "subreddit": "jobs", "text": "\"I was laid off a few months ago (together with almost half the people in my company). I was a little bit in panic mode by then. During the first 2-3 months I applied to literally every single PM job offer I saw but I didn\\u2019t even pass the second interview. Then a friend explained to me the 3-stage process she used to find her job. She also recommended a few AI tools that ended up being very useful. \\n\\nAfter 2 months of following her guidelines, I was offered 2 positions! 1 of them with a higher salary than the one I had in my previous company (ironically I took the other one, but for different reasons).   \\nI learned that finding a new job is a job in itself. You improve with practice and by failing. So the 3-stage process is designed to iterate fast. In every stage, I focused on \\u201cMastering that stage only\\u201d and improving on 1 metric:\\n\\n**Stage 1 Iterate my Resume**\\n\\nMy main focus in this stage was to improve the conversion rate of my resume. The metric I used was the % of responses I received. I kept refining and tweaking my resume until I achieved a solid ratio. I started with less than a 5% response rate (from *resume sent* to *first interview scheduled*). \\n\\nIn a shell I did this:\\n\\n* Adapt my resume for every position (I used a few tools, mostly kickresume explained below).\\n* When describing my previous experience, rephrase it using the exact key words used in the job offer. A lot of companies use software to filter resumes, so if they don\\u2019t find certain keywords, you are automatically rejected.\\n* Create a cover letter \\u201ctemplate\\u201d and leave some paragraphs to modify depending on each company.\\n* I created a notion page with a more detailed resume, with links to previous projects and a lot of details about me. I added this when asked for a \\u201cWebsite URL\\u201d (asked in many offers).\\n\\nOnce I started getting first interviews with HR managers or hiring managers (1st interview), I shifted my attention to preparing and improving my interview skills.  \\n\\n\\n**Stage 2 First interviews (usually with HR)**\\n\\nIn this stage, I aimed to increase the number of second interviews or technical exercises I was offered. This was a critical step in progressing further in the hiring process. I made sure to thoroughly prepare for these initial interviews, showcasing my skills and experiences effectively and I used a few tools (below) to practice my interviews.\\n\\nYou\\u2019ll be asked the same questions again and again in these interviews with HR. With Otter you can transcript the meetings. So I created a document with \\\"Hard Questions in Job Interviews\\\" as a quick reference during interviews. I have the answers written there for all the typical questions. If you do online meetings, you can keep the doc open on your second screen \\ud83d\\ude1b\\n\\n  \\n **3 Use case (or technical exercise)**\\n\\nMy metric here was the number of job offers I received. This stage varies a lot depending on your role. I was applying for Product Manager, in case you are also applying for this role let me know and I can give you some examples of exercises I prepared in advance\\n\\n&#x200B;\\n\\n Here are the tools that played a significant role in that process: \\n\\n **1 ChatGPT - Turned into a job interview trainer** \\n\\n You start by training ChatGPT on your resume. You can use this prompt:\\n\\n>As ChatGPT, you\\u2019ll be participating in an interview simulation for the position of Product Manager at \\\\_\\\\_\\\\_\\\\_. I\\u2019ll provide you with your Resume in an upcoming message. Following that, you\\u2019ll receive the interview questions along with guidelines on how to respond. \\n\\n&#x200B;\\n\\n Then you copy&Paste your CV on ChatGPT. And you give it this new prompt:\\n\\n>The focus of this interview will be on your soft skills. When answering questions be clear and concise, using everyday language. Create convincing responses that an interviewer would appreciate even if they are fictional. However, ensure that your answers align with the experiences mentioned in your resume. \\n\\nThen ask ChatGPT the interview questions you may get and it will be generating perfect responses to any question.\\n\\n&#x200B;\\n\\n **2 kickresume.com**  \\n\\nUse it to improve your resume. You can do several things with it. Start your resume from scratch or modify one, create your cover letter with AI (it uses ChatGPT on the backend), or ask for feedback on your resume. I still needed to do a lot of manual changes in the version it creates but it is a great start. For cover letters, which can be quite a hassle to customize for each job application, it was a real-time-saver. Another option is Rezi, I haven\\u2019t tried it yet but it looks promising. \\n\\n&#x200B;\\n\\n **3 Wave.ai** \\n\\nIt provided a written conversation with a real human coach, utilizing AI to offer guidance and assistance. The coaching sessions helped me develop habits for finding the right jobs and mentally preparing for interviews. I used it a lot in stage 2. I would go to Wave with the answers I replied on every interview and they would help me improve them with feedback. Ultimately, they also helped me negotiate the offers. I\\u2019m so bad at facing conflict and asking for a higher salary, that my first instinct when I was offered the first job was to say OMG OF COURSE. I was able to raise the salary a bit and also the stock options they gave to me. \\n\\n&#x200B;\\n\\n **4 Otter.ai** \\n\\nYou can use it during your online meetings to take notes. During job interviews, it is not only important the content of your answer, but also how your answer is structured. And the only way to improve this is by practicing. With this tool,  I could review the questions asked and my responses, allowing me to refine and better structure my answers. Write down your answers and then use ChatGPT to improve them and structure them in a way that is easier to understand! \\n\\n&#x200B;\\n\\n **5 Interview Warmup (from Google)** \\n\\nSimilar use to the first one with ChatGPT but in this case they ask you the questions. It simulates a real interview and gives you personalized feedback based on your responses. It can help you identify areas where you need to improve. Also, by practicing with these tools, I felt more confident and prepared for those higher-stakes real interviews.\\n\\n \\n\\nI hope this is helpful to you!\\n\\nAny other tool I should add?\"", "title": "I found a remote job in 2 months using AI tools and a 3-stage preparation process", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/jobs/comments/13uxdwu/i_found_a_remote_job_in_2_months_using_ai_tools/"}, {"author": "PersonMan42", "created_utc": 1705794762.0, "link_flair_template_id": "7f3169f0-3477-11e8-bd00-0e56aa346a78", "link_flair_text": "Work/Life balance", "num_comments": 242, "post_id": "19bpn65", "score": 5514, "subreddit": "jobs", "text": "\"\"", "title": "Red flag phrases in job posts", "upvote_ratio": 0.97, "url": "https://i.redd.it/cn58fyycgidc1.jpeg"}, {"author": "geeangidk", "created_utc": 1708818629.0, "link_flair_template_id": "adfd903c-05b8-11e6-b9a4-0e9a8fb8e6bb", "link_flair_text": "Rejections", "num_comments": 320, "post_id": "1az9bi4", "score": 5493, "subreddit": "jobs", "text": "\"Currently job hunting. I\\u2019ve been rejected by entry level jobs throughout my adult life as well as lately, but this one today... Lmao. \\ud83e\\udd72 \"", "title": "The Title…", "upvote_ratio": 0.97, "url": "https://i.redd.it/mk9qzxc4fmkc1.jpeg"}, {"author": "Present-Amoeba-326", "created_utc": 1687394504.0, "link_flair_template_id": "119d3960-05ac-11e6-8bc7-0ec36f9f170d", "link_flair_text": "Compensation", "num_comments": 448, "post_id": "14fomea", "score": 5393, "subreddit": "jobs", "text": "\"Just wanted to post my achievement here. I\\u2019m going to jump from making ~$35k/year to ~$60k/year in a months\\u2019 time. Things are going to be okay.\"", "title": "In tears over doubling my income.", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/jobs/comments/14fomea/in_tears_over_doubling_my_income/"}, {"author": "errorloadin", "created_utc": 1704222912.0, "link_flair_template_id": "2713d630-0739-11e6-9530-0eac7e114f67", "link_flair_text": "Unemployment", "num_comments": 517, "post_id": "18wxjwa", "score": 5386, "subreddit": "jobs", "text": "\"\\ud83d\\ude2d like cmon now\"", "title": "I just want a job", "upvote_ratio": 0.96, "url": "https://i.redd.it/yqcchuxot2ac1.jpeg"}, {"author": "vando_commando", "created_utc": 1702498611.0, "link_flair_template_id": "afed3f46-05b8-11e6-8a4b-0e9a8fb8e6bb", "link_flair_text": "Companies", "num_comments": 327, "post_id": "18hq1pj", "score": 5287, "subreddit": "jobs", "text": "\"I found out we had canceled the yearly Christmas party / bonus. A multi store owner within a large corporate chain food company allowed our management to instead do this for the staff of say 60 employees per store. Upon completing this project along with a few other miscellaneous gifts (donuts, Doritos, and [get this] oranges,) he told us this gesture was \\u201cbreaking the bank.\\u201d \\ud83d\\ude43 love it here.\"", "title": "Boss canceled our Christmas party cause this broke the bank.", "upvote_ratio": 0.97, "url": "https://i.redd.it/xr27pdnge46c1.jpg"}, {"author": "Buddy_Spike", "created_utc": 1708223761.0, "link_flair_template_id": "119d3960-05ac-11e6-8bc7-0ec36f9f170d", "link_flair_text": "Compensation", "num_comments": 331, "post_id": "1atjhb9", "score": 5267, "subreddit": "jobs", "text": "\"\"", "title": "It was a slow climb, but I finally made it at age 40.", "upvote_ratio": 0.95, "url": "https://i.redd.it/y0lcr7v9a9jc1.jpeg"}, {"author": "Deathrider66", "created_utc": 1707229339.0, "link_flair_template_id": "fdc72fd0-05ac-11e6-b950-0ef0df358363", "link_flair_text": "Leaving a job", "num_comments": 142, "post_id": "1akavw5", "score": 5266, "subreddit": "jobs", "text": "\"\"", "title": "Happens all the time.", "upvote_ratio": 0.98, "url": "https://i.redd.it/91myxogc5zgc1.jpeg"}, {"author": "Hairy-System9153", "created_utc": 1706142068.0, "link_flair_template_id": "6406c11c-86ad-11e6-86c2-0e0536d0c06b", "link_flair_text": "Job searching", "num_comments": 904, "post_id": "19evxmr", "score": 5226, "subreddit": "jobs", "text": "\"Throwaway since my friends know my Reddit. A year ago I was making good money working for a small tech startup. CEO was an ass but I usually didn\\u2019t have to deal with him and I loved my coworkers. I also had just bought a house and spent a chunk of savings on renovations. \\n\\nA recruiter hits me up and mentions a big salary increase at their company. I figured sure why not talk to them. I had 2 calls and next was to be with the founder. Turns out the founder knew the CEO of my company. He called my CEO and said I was looking around. I was immediately fired with no severance. \\n\\nSince then I\\u2019ve sent out thousands of applications and had tons of interviews. Most companies had 4+ rounds. 3 months later I get an offer but instead of remote like they initially said, they wanted me to work in their office on the other side of the country for six months before going remote. I turned it down figuring another offer would come soon. It didn\\u2019t. \\n\\n I\\u2019ve dealt with horrible hiring managers, a couple examples is one asked me about my parents occupations and then turned me down saying they wanted someone who grew up around success so they knew what it looked like. one company had me write a blog as part of the process and months after being ghosted by them I found my blog on their website. I won\\u2019t even get into being ghosted, hiring managers showing up late or not at all. \\n\\nI thought my journey finally came to an end. I accepted an offer. It was 40% less than what they originally said they would pay. I\\u2019d also have to travel by train 2 hours each day but I was desperate so I took it. \\n\\nOn Friday I was informed my offer was rescinded due to restructuring and they won\\u2019t reimburse me on my $300 a month train package I had just bought to travel to work. \\n\\nMy old company is thriving and my old colleagues are still doing well in spite of the market. \\n\\nMeanwhile I\\u2019m out of savings and unemployment ran out a while ago. My house that I was very proud of is now up for sale. my wife who was initially supportive has also now left me saying I can\\u2019t provide for her and doesn\\u2019t understand how it could be so hard to get a job. \\n\\nTomorrow I have an interview at a gas station.\"", "title": "A year ago today I made a mistake that ruined my life", "upvote_ratio": 0.91, "url": "https://www.reddit.com/r/jobs/comments/19evxmr/a_year_ago_today_i_made_a_mistake_that_ruined_my/"}, {"author": "bromygod203", "created_utc": 1615544947.0, "link_flair_template_id": "fdc72fd0-05ac-11e6-b950-0ef0df358363", "link_flair_text": "Leaving a job", "num_comments": 484, "post_id": "m3ev8t", "score": 5132, "subreddit": "jobs", "text": "\"Worked at a small company for 2 years as an admin. My supervisor was the only person above me, the rest of the crew was warehouse employees, warehouse supervisor and manager. The warehouse is a rotating door of employees, most just walk out some stop showing up and block out number. I've been stressed, overwhelmed, underpaid and overworked. Mentioned it to my supervisor, asked them to hire someone and they saod back in July they would hire another admin. I requested 8 days off since July (from Aigust 2020 to July 2021) and denied all but 2. I can't take off when my boss goes on vacation (or the weeks before or after) of which she's going away two separate 3 week vacations in June & August so basically I'm stuck at work the entire summer. I asked for a raise and was denied. They've interviewed about 10 people in the last few weeks for another admin position and said everyone was too desperate for work.\\n\\nANYWAY after a few interviews a was offered a new job with a 40% raise, an additional week off, significantly cheaper (and better) health insurance and my few request days off this summer(that my soon to be former employer denied immediately) already approved. Gave me boss notice yesterday. She was visibly PISSED. Said she was blindsided, speechless, \\\"I thiught you were happy here, why? Just why?\\\". I said sorry its a significant raise. She told me to leave her office. Came back to my desk a few minutes later and told me I need to stay for an additional 4 weeks while they find and hire someone. I told them I can't. They told me I NEED TO.\\n\\nTables are turned and I now know how much they need me abd I don't need them. I'm beyond happy their shitty attitude towards me won't change that. Just wanted to share with everyone\\n\\nEDIT: Walked out with all my shit after my shift Friday. Debating not showing up next week. Fuck em right?\\n\\nEDIT #2: Payday is Monday. I got paid Saturday morning. Should I take this as a hint?\"", "title": "Put my notice in. My boss lost it", "upvote_ratio": 0.99, "url": "https://www.reddit.com/r/jobs/comments/m3ev8t/put_my_notice_in_my_boss_lost_it/"}, {"author": "LonelyBiochemMajor", "created_utc": 1690568213.0, "link_flair_template_id": "dc491ca2-05ab-11e6-97de-0ec36f9f170d", "link_flair_text": "Interviews", "num_comments": 1066, "post_id": "15c4wzd", "score": 5092, "subreddit": "jobs", "text": "\"I thought it was a red flag the first time it happened. That company actually ended up offering me a job, but I declined (there were numerous other red flags). \\n\\nThen in an interview yesterday, the interviewer asked me if I lived with my parents. She then asked if I was interviewing with anyone and whether I\\u2019d declined any offers. I said I had. She asked why. I tried to give a non committal answer, but she kept pushing. \\n\\nAre they even allowed to ask me these questions?? It always makes me uncomfortable, but I\\u2019m a recent grad and it\\u2019s my first time job hunting like this, so I\\u2019m not really sure.\"", "title": "Two separate interviewers asked me if I lived at home with my parents????", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/jobs/comments/15c4wzd/two_separate_interviewers_asked_me_if_i_lived_at/"}, {"author": "sts816", "created_utc": 1654279415.0, "link_flair_template_id": "280ed3a2-156f-11e6-8563-0e4275a4f1df", "link_flair_text": "Training", "num_comments": 568, "post_id": "v456mg", "score": 5002, "subreddit": "jobs", "text": "\"I work as an engineer in a very highly regulated, very technical industry at a massive company. There are countless forms, processes, procedures, regulations, requirements, etc that need to be navigated in order to get even the smallest little thing done. Absolutely no one fully understands how all of this shit works together because everyone is so siloed into their incredibly narrow scope of work. In order to get any information from people, you need to ask absurdly specific questions that require in-depth understanding of all this shit that I, who started 6 months ago, do not possess. \\n\\nOkay so you would think I get training on all this once I start? Fuck no. I get chucked into the deep end because my lead likes \\\"on the job training\\\" and \\\"learn by doing\\\". What he really means is I don't want to train you at all so good luck! Every project inevitably results in me beating my head against a brick wall trying to eek out the smallest clues from people about what to do next because A) I don't even know the right questions I should be asking and B) like I said before, no one actually understands all this shit in its entirety and everyone has their own opinions and interpretations. There's 2 dozen people at a minimum involved in any particular project and 95% of them will flat out ignore all emails too. All of the \\\"experts\\\" and actual decision makers are so noncommittal and vague in their responses to my questions and requests that it ends up creating more confusion, at least on my end. \\n\\nI've gotten zero training on how to navigate this fucking labyrinth of bureaucracy. My lead is borderline useless and I might get an hour of his time a week for detailed questions. The company as a whole offers no formal training on how to actually do your job but by god they've got hours upon hours of \\\"training\\\" on \\\"quality management\\\" garbage that is so high level and vague, I couldn't even begin to tell you how it might apply to my day to day work. \\n\\nEvery single place I've worked is like this to varying degrees and it drives me insane. It makes everyone's job so needlessly difficult.\"", "title": "I am so fed up with every company's complete lack of proper training. Every single job is just dropping right in the deep end and hoping for the best.", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/jobs/comments/v456mg/i_am_so_fed_up_with_every_companys_complete_lack/"}, {"author": "Hater_Magnet", "created_utc": 1703367496.0, "link_flair_template_id": "119d3960-05ac-11e6-8bc7-0ec36f9f170d", "link_flair_text": "Compensation", "num_comments": 375, "post_id": "18pfq6x", "score": 5006, "subreddit": "jobs", "text": "\"So fucking proud of herself that she pulled kids out of class to help her tie ribbons and help her distribute to staff.\"", "title": "From a principal to the teachers", "upvote_ratio": 0.96, "url": "https://i.redd.it/dzu7yes3648c1.jpeg"}, {"author": "BigBlackCrocs", "created_utc": 1680410368.0, "link_flair_template_id": "d1f08d62-05ab-11e6-9ea7-0ebb139b9f2d", "link_flair_text": "Applications", "num_comments": 407, "post_id": "129a6t1", "score": 4960, "subreddit": "jobs", "text": "\"Entry level game design job: Oops sorry but you need 5 years of AAA experience to work for our small indie company for 20 dollars an hour. It\\u2019s the bare minimum I can\\u2019t believe you don\\u2019t have that experience yet even though you didn\\u2019t even graduate college yet. Kids these days\\u2026 \\n\\nVery frustrating. Bloated searches \\n\\nI still apply. Lol\"", "title": "For the love of all that is holy PLEASE stop putting jobs up as “entry” level and then ask for 3-5 years of experience.", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/jobs/comments/129a6t1/for_the_love_of_all_that_is_holy_please_stop/"}, {"author": "cacaoho", "created_utc": 1699079958.0, "link_flair_template_id": "0e81635a-05ac-11e6-9334-0e19f203b873", "link_flair_text": "Job offers", "num_comments": 1005, "post_id": "17nfrim", "score": 4902, "subreddit": "jobs", "text": "\"\"", "title": "Guy had a lot to say after I accepted another job", "upvote_ratio": 0.97, "url": "https://i.redd.it/uhhn9kt11ayb1.jpg"}, {"author": "Old-Entertainer3676", "created_utc": 1706543737.0, "link_flair_template_id": "f95f85fa-05ac-11e6-8dae-0ec36f9f170d", "link_flair_text": "Office relations", "num_comments": 578, "post_id": "1adyk9a", "score": 4876, "subreddit": "jobs", "text": "\"I use a speech to text app on my phone which is government funded to allow deaf people to be able to communicate, and it creates a transcript of every call I make. To my knowledge there is no setting to turn off the transcript feature, and it's a separate phone number that people call as opposed to the number that they generally text me at. \\n\\nIn one of those calls my boss asked that I disclose a private medical issue to the office in order to relieve concerns from people I do not even work with. I was very bothered by this, because he implied that it would improve my performance rating and bonus structure if I were to do so. I complained to HR and showed her the transcript of the call, and now he's saying that it was illegal for me to record that conversation without his consent.\\n\\nI am already getting a lawyer but I'm very anxious. Am I wasting my money here? He knows that I'm functionally deaf and in fact, he approved my accommodations when I requested a transcription software for in person meetings. How could he not have known our conversation was being recorded?\"", "title": "I'm deaf. My boss might fire me because I \"illegally\" recorded our phone conversations.", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/jobs/comments/1adyk9a/im_deaf_my_boss_might_fire_me_because_i_illegally/"}, {"author": "kewladria", "created_utc": 1683120292.0, "link_flair_template_id": "7f3169f0-3477-11e8-bd00-0e56aa346a78", "link_flair_text": "Work/Life balance", "num_comments": 1004, "post_id": "136kh70", "score": 4846, "subreddit": "jobs", "text": "\"Rant - I started a job about 10 months ago with a \\\"flexible\\\" PTO policy. Essentially, I have unlimited time off, to use at my discretion, up to 2 weeks at a time. I understand the other arguments against these open-PTO policies but something else has become abundantly clear to me having been with this job for about a year now.\\n\\n&#x200B;\\n\\nThe problem is, my immediate teammates (there are 5 of us) NEVER take time off. So what ends up happening is, I am the \\\"slacker\\\" of the team. I do not hesitate to take a random Friday off if work is slow, and I plan to take whole weeks off for various trips and vacations coming up this summer and fall. All in all, I will probably take 4 weeks of total PTO this year.\\n\\n&#x200B;\\n\\nI get my work done on time and am generally well-liked with the company and team, but I feel like an ass because in comparison to the rest of my teammates, I take a lot of time off. I want to be there for my team and pick up some of their work when they take their own time off, but they (as mentioned above) rarely or never take time off, so I have yet been able to prove my ability to be a good teammate. I speak with folks from other departments and they regularly take time off, sharing fun stories about the trips they've taken and the places they've seen - yet another thing I do not get to share with my team because they are too caught up working to speak about anything else besides work.\\n\\n&#x200B;\\n\\n/end rant. I am not necessarily looking for any advice here, maybe just some affirmations or similar stories from other people with PTO policies like this. This too could also be used as a point of consideration for anyone weighing the pros/cons of 2 jobs with different PTO policies, I guess.\"", "title": "\"Unlimited\" or \"Flexible\" PTO policies suck if your teammates never take time off.", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/jobs/comments/136kh70/unlimited_or_flexible_pto_policies_suck_if_your/"}, {"author": "iluvlibras", "created_utc": 1691164061.0, "link_flair_template_id": "6406c11c-86ad-11e6-86c2-0e0536d0c06b", "link_flair_text": "Job searching", "num_comments": 957, "post_id": "15i3lzt", "score": 4833, "subreddit": "jobs", "text": "\"Very fortunately, I got an internship with a large company my senior year of college. My interview for this position was 11 minutes long. Now, I\\u2019m sure there were some preconceived notions about me that the employer had, but still an 11 minute interview. \\n\\nI got hired on full-time for this company after graduation, so I did not need to interview at all. Fast forward some months, a chunk of the marketing team is wiped and a bunch of us are jobless at the beginning of 2023. \\n\\nAgain, fortunately I get a new job that was recommended to me by a connection. This interview was a quick phone interview, and then an in person interview that was max 20 minutes.\\n\\nNow, I hate this job. It pays the bills, but everyone here hates one specific person that cannot be fired due to them being a family member of the owner (this is a very small company). I just can\\u2019t take it anymore and there\\u2019s no benefits so it doesn\\u2019t feel worth my distress. Only good thing is that it\\u2019s the same salary as my previous job.\\n\\nI\\u2019ve been applying to jobs, getting the typical ghosting and rejection emails at 12am from being filtered out by a computer. I encountered something weird today. I got kicked off the candidate list during a second round interview as a no-show. However, they scheduled a time that was outside of my given availability, and I told them twice before the interview that I could not make that time and they just ignored my emails. They asked me to reapply, which NO I AM NOT. \\n\\nWhy is hiring so WEIRD right now?\"", "title": "I’m fully employed, but doing a job search as I hate my current job. Why is the hiring/interview process so bad these days?", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/jobs/comments/15i3lzt/im_fully_employed_but_doing_a_job_search_as_i/"}, {"author": "RebootJobs", "created_utc": 1631123362.0, "link_flair_template_id": "6406c11c-86ad-11e6-86c2-0e0536d0c06b", "link_flair_text": "Job searching", "num_comments": 422, "post_id": "pkfho0", "score": 4804, "subreddit": "jobs", "text": "\"Why are entry level jobs starting at three years minimum? How is that considered entry?!\"", "title": "3 👏 to 👏 5 👏 years 👏 is 👏 NOT 👏 entry 👏 level", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/jobs/comments/pkfho0/3_to_5_years_is_not_entry_level/"}, {"author": "peanutbutterndnutela", "created_utc": 1707389740.0, "link_flair_template_id": "dc491ca2-05ab-11e6-97de-0ec36f9f170d", "link_flair_text": "Interviews", "num_comments": 373, "post_id": "1alt3qe", "score": 4719, "subreddit": "jobs", "text": "\"So I just woke up and I had a phone interview with starling bank. I am so tired of lying in phone interviews just for a minimum wage job when everyone tells me \\u201cjust be yourself\\u201d but that\\u2019s not true! Anyway I\\u2019m so fed up with interviews so I decided today is the day I fully test the be yourself theory. \\nSo I\\u2019m sat with a coffee in a cafe- \\u201cwhy would you like to work with starling bank?\\u201d - well I need a job \\u201cwhat do you know about starling bank\\u201d - to be honest not much other than they\\u2019re a bank in my town , \\u201cwhat do you think the role involves\\u201d - answering phone calls and live chat \\u201c. \\u201cHow would you do deal with emotive customers\\u201d - listen and understand and not add fuel to the fire but other than that there\\u2019s not much else I can do . \\n\\u201cWhat attracts you to this role\\u201d - I need a reliable income\\nShe ended the interview with \\u201cwell I\\u2019ve got other interviews today so I\\u2019ll let you know\\u201d \\nAyway I actually enjoyed it, it felt very uncomfortable and everyone in the cafe is staring at me but for fuck sake it\\u2019s minimum wage, I\\u2019m tired of selling myself - it\\u2019s humiliating to do continuously for minimum wage.\"", "title": "I was just 100% honest at a job interview", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/jobs/comments/1alt3qe/i_was_just_100_honest_at_a_job_interview/"}, {"author": "Loodwiig", "created_utc": 1709305811.0, "link_flair_template_id": "dc491ca2-05ab-11e6-97de-0ec36f9f170d", "link_flair_text": "Interviews", "num_comments": 387, "post_id": "1b3wjzg", "score": 4714, "subreddit": "jobs", "text": "\"Email from these guys wanted me to do a personality quiz. The email stated it would take 45-55 minutes. IMHO if you can't get a read on my personality in an interview then you shouldn't be in HR\"", "title": "Normalize traditional interviews", "upvote_ratio": 0.96, "url": "https://i.redd.it/zikcjyhrnqlc1.png"}, {"author": "oswaldp333", "created_utc": 1690806322.0, "link_flair_template_id": "e387d468-05ab-11e6-b3df-0e43b37a78c1", "link_flair_text": "Post-interview", "num_comments": 517, "post_id": "15eery0", "score": 4662, "subreddit": "jobs", "text": "\"First off I want to thank everyone for their advice. It was extremely helpful to have others chime in to validate that this whole situation was extremely odd and inappropriate. It made made me feel confident that I could put a boundary in place that my safety was non negotiable. \\n\\nNow on to what happened next-Like I said in my previous post I stated I felt unsafe to the owner, they then replied that they could get me a ride to their home (costing close to $200 which gets rid of the theory they didn\\u2019t want to rent a space due to money concerns). \\nI declined the ride and then repeated my concern about safety going to their home and asked if we could do the training remotely or if we could meet in a public space where I could possibly bring someone. I thought this would make them second guess their behavior because surely any rational person wouldn\\u2019t want to make a potential employee feel unsafe? \\n\\nNOPE that\\u2019s not how this went. They sent me long email back telling me that essentially the only way I could have this job is if I go to the owners house. They stated that they cannot hold meetings anywhere but their house due to \\u201cinformation privacy\\u201d concerns (please keep in mind this is not a government job or anything where sensitive confidential information would be exchanged). \\nThey then went on to say that I could absolutely NOT bring anyone. So bottom line-I would have to show up to their home, alone. The kicker is they then stated that they\\u2019re second guessing me as a candidate because I voiced these concerns and they only want \\u201clikeminded\\u201d \\u201ccollaborative\\u201d employees\\u2026\\n\\nMoral of the story is listen to your gut and stay safe when searching for jobs. I\\u2019m not sure what is going on here but I\\u2019m happy that I didn\\u2019t go. I\\u2019m not sure if I should reach out to the job posting site that I originally applied on to let them know about this. I just don\\u2019t want anyone else to end up in an unsafe situation because they need a job.  \\nThanks again everyone!!\"", "title": "UPDATE-My new boss that I’ve never met asked me to come to their home.", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/jobs/comments/15eery0/updatemy_new_boss_that_ive_never_met_asked_me_to/"}, {"author": "holdonaminute2023", "created_utc": 1682595071.0, "link_flair_template_id": "7f3169f0-3477-11e8-bd00-0e56aa346a78", "link_flair_text": "Work/Life balance", "num_comments": 451, "post_id": "130iz1r", "score": 4647, "subreddit": "jobs", "text": "\"I used to respond to all emails. Complete every task by its deadline. Work late into the night to do so. Now I find myself doing the 9 to 5 and not caring about what doesn\\u2019t get done during that time \\n\\nSupervisors know I am overwhelmed. Im no longer fussed by deadlines. \\n\\nI feel like something broke in me and Im a totally different work/person.  I used to care so much.   Im so done. \\n\\nIs this normal? A sign of burnout?\"", "title": "I’ve stopped caring at my admin assistant job after 4 years. I don’t recognize myself anymore and it’s scary.", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/jobs/comments/130iz1r/ive_stopped_caring_at_my_admin_assistant_job/"}, {"author": "CombProfessional434", "created_utc": 1710784238.0, "link_flair_template_id": "2713d630-0739-11e6-9530-0eac7e114f67", "link_flair_text": "Unemployment", "num_comments": 103, "post_id": "1bhwznj", "score": 4644, "subreddit": "jobs", "text": "\"\"", "title": "So the \"better candidate\" didn't work out huh?", "upvote_ratio": 0.96, "url": "https://i.redd.it/bd5c9lyvr4pc1.jpeg"}, {"author": "Lijey_Cat", "created_utc": 1692690225.0, "link_flair_template_id": "86ad96b6-74fd-11ec-be33-be663bbd396a", "link_flair_text": "Career development", "num_comments": 299, "post_id": "15xylec", "score": 4633, "subreddit": "jobs", "text": "\"My boss said to me today, \\\" (My name), thank you for always making me smile and laugh. You are a bright spot to the day.\\\"\\n\\n\\n\\nI work from home. So, all of our communications for my company and team are done through Microsoft Teams Chat. Honestly, working from home has been a huge boost to my career development.\\n\\nFor some reason, I feel so much more confident when people aren't staring at me in person. Honestly, that extra confidence makes me really want to help others and put smiles on their faces. \\n\\nI guess my boss noticed. I didn't know people actually enjoyed the things I said. I figured they just thought I was a weirdo. That's how most people think of me anyway.\\n\\nAutism comes with its challenges. The world doesn't see me in the ways that I wish it would. Hearing this from my boss really made my day.\\n\\nSocializing doesn't come naturally for me. But when I work from home, I don't have to think about it nearly as much as I do when I'm in person. It's such a relief.\"", "title": "I have autism and I'm weird. I had no idea I had this effect on other people.", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/jobs/comments/15xylec/i_have_autism_and_im_weird_i_had_no_idea_i_had/"}, {"author": "TunbridgeWellsGirl", "created_utc": 1684002705.0, "link_flair_template_id": "fb0590aa-e252-11e2-9a2b-12313b0c8c59", "link_flair_text": "Article", "num_comments": 738, "post_id": "13gp1jd", "score": 4631, "subreddit": "jobs", "text": "\"Studies have shown that frequent use of LinkedIn is associated with increased depression and anxiety.\\n\\n&#x200B;\\n\\nLinkedIn really creates that fear of missing out. You feel pressurised to post something in case you\\u2019re forgotten and it\\u2019s just not sustainable IMHO.\\n\\n&#x200B;\\n\\nPlus there is so much content that can have a negative impact on your mental health including:\\n\\n&#x200B;\\n\\n* Toxic positivity posts\\n* Humble brags\\n* Look at me selfies\\n* Vanity metric showoffs\\n* Burnout braggers etc\\n\\n&#x200B;\\n\\nAnd spending too much time on LinkedIn isn't good for your mental health either.\\n\\n&#x200B;\\n\\nDon't become a LinkedIn addict. Get a life!\\n\\n&#x200B;\\n\\nAnd if you need a break, have one. You don't need to justify yourself either.\\n\\n&#x200B;\\n\\nPlease put your mental health first:\\n\\n&#x200B;\\n\\n* Post when you can\\n* Build a supportive network\\n* Cultivate a feel-good feed\\n\\n&#x200B;\\n\\nHow does LinkedIn make you feel?\"", "title": "LinkedIn is bad for your mental health", "upvote_ratio": 0.94, "url": "https://www.reddit.com/r/jobs/comments/13gp1jd/linkedin_is_bad_for_your_mental_health/"}, {"author": "ceiling_fanzz", "created_utc": 1694388463.0, "link_flair_template_id": "0e81635a-05ac-11e6-9334-0e19f203b873", "link_flair_text": "Job offers", "num_comments": 356, "post_id": "16ffcdi", "score": 4597, "subreddit": "jobs", "text": "\"The closest factory with decent pay that was hiring was doc Johnson dildo factory. Pay started at $20 an hour with good health care benefits.\\n\\nI'm what you call the dildo dipper, after the dildos are made, it goes down the line where I dip the tip of the dildos on red paint and move it down the line. Then on the weekend I do quality control for overtime and I inspect and make sure the dildos are in great shape. It's a fun job\"", "title": "I got a job at a dildo factory", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/jobs/comments/16ffcdi/i_got_a_job_at_a_dildo_factory/"}, {"author": "BUR6S", "created_utc": 1706200581.0, "link_flair_template_id": "bfaf55ca-0a83-11e6-b606-0e6c77463a9b", "link_flair_text": "Layoffs", "num_comments": 485, "post_id": "19fdfr0", "score": 4598, "subreddit": "jobs", "text": "\"The C-Suites started the call with a VERY brief note that they had to lay off a ton of employees in another department, and that today was a day of \\u201craw emotion.\\u201d And then, I shit you not, they immediately went into \\u201clet\\u2019s not let this stop us from having an extremely profitable Q4, get out there and sell!\\u201d\\n\\nThis is why I refuse to work past 5. This is why I don\\u2019t attend company events outside of work hours. This is why I don\\u2019t take work stress home with me.\\n\\nYou are a number. You are replaceable. They don\\u2019t care about you. Do not give unto them what they refuse to give to you. Know your worth. Show no loyalty to a company.\\n\\nI really feel for those that lost their jobs today, because they have families. They\\u2019re people, they have lives. They matter. Our company has made record profits the last few years, completely on the backs of those laid off.\\n\\nI\\u2019m just disgusted.\\n\\nEDIT: my company\\u2019s FY starts 4/1 for some reason. So Q4 ends 3/31.\"", "title": "My Corporation just laid off a ton of employees, and scheduled a company-wide call the same afternoon…", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/jobs/comments/19fdfr0/my_corporation_just_laid_off_a_ton_of_employees/"}, {"author": "organictamarind", "created_utc": 1692975161.0, "link_flair_template_id": "dc491ca2-05ab-11e6-97de-0ec36f9f170d", "link_flair_text": "Interviews", "num_comments": 412, "post_id": "1611h0q", "score": 4472, "subreddit": "jobs", "text": "\"I had 4 calls this past week thaat made me MAD \\ud83d\\ude21\\nFrom 3 different companies\\n\\nSo if I ask for a hike that they promised in the Ad- They are shocked\\n \\n*Edit to add context*: the job said X on the listing and on call they said, the max we can offer is X minus 50% .. We just put X cause that's the range in the market \\n\\nIf I say I would like to work within 90 minutes one way.of commute they are shocked\\n\\n*Edit to add context*: literally it was beyond city limits. The company listing said City A , and the role was based on the outskirts of City A and B . \\n\\nIf I say I won't interview if I don't have a proper Job Description they are shocked\\n\\n*Edit to add context*: He actually said, come in for the interview then we will discuss the role...the \\\"Role is based on your experience \\n(( I'm in Supply chain, and roles differ wildly based on product and service or which part of the chain you sit in (Ops, Quality, procurement etc) ))\\n\\nIf I don't make myself available for an interview within an hour as per their convenience they are shocked\\n\\n*Edit to add context*: I was in office, recruiter calls for a zoom meeting in an hour, I tell him I can I'm at work, he's literally like \\\" why can't you be available go into a conference room or something \\\" like BITCH I am at my JOB \\n\\nAnd then these same companies leaders put up LinkedIn posts on how they're fighting a War to get Talent in ..\"", "title": "Why do recruiters act so SHOCKED we stand up for ourselves", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/jobs/comments/1611h0q/why_do_recruiters_act_so_shocked_we_stand_up_for/"}, {"author": "DarthBanEvader42069", "created_utc": 1706626917.0, "link_flair_template_id": "dc491ca2-05ab-11e6-97de-0ec36f9f170d", "link_flair_text": "Interviews", "num_comments": 541, "post_id": "1aeqed9", "score": 4428, "subreddit": "jobs", "text": "\"\"", "title": "One way interview; GTFO here.", "upvote_ratio": 0.96, "url": "https://i.redd.it/xide9fexdlfc1.png"}, {"author": "A1steaksauceTrekdog7", "created_utc": 1687619870.0, "link_flair_template_id": "7f3169f0-3477-11e8-bd00-0e56aa346a78", "link_flair_text": "Work/Life balance", "num_comments": 1018, "post_id": "14hvjxw", "score": 4423, "subreddit": "jobs", "text": "\"[YouTube video](https://youtu.be/4X2droxtGbQ)\"", "title": "Most people alive today will work until they die", "upvote_ratio": 0.91, "url": "https://www.reddit.com/r/jobs/comments/14hvjxw/most_people_alive_today_will_work_until_they_die/"}, {"author": "AlmightyXan", "created_utc": 1705886845.0, "link_flair_template_id": "d1f08d62-05ab-11e6-9ea7-0ebb139b9f2d", "link_flair_text": "Applications", "num_comments": 335, "post_id": "19cjpbb", "score": 4420, "subreddit": "jobs", "text": "\"\"", "title": "It was blank and it forced me to answer like what else could I say?😭", "upvote_ratio": 0.95, "url": "https://i.redd.it/0zjszq7f9wdc1.png"}, {"author": "Outrageous_Fig_3105", "created_utc": 1705972391.0, "link_flair_template_id": "1f4ca128-8779-11eb-9ba4-0e1836b024ef", "link_flair_text": " HR ", "num_comments": 578, "post_id": "19dc5b3", "score": 4355, "subreddit": "jobs", "text": "\"I\\u2019ve been at this job about three months now. Shortly after starting, my supervisor warned me to be careful around a coworker \\u201cKaren\\u201d because of her attitude. \\n\\nKaren is one of the most passive aggressive and unpleasant people I\\u2019ve ever been around. I try to keep my distance but she\\u2019s always trying to micromanage me because I\\u2019m new. No she\\u2019s not a manager, we are on the same level. This morning, Karen confirmed with me that I would go to lunch at 11am. Something personal came up later so I asked another coworker \\u201cPam\\u201d if we could switch lunch times so I could go at 12pm. Pam agreed and had no issues switching. Well, when I came back from lunch, I saw a message Karen meant to send to another coworker that she\\u2019s friends with but accidentally sent to our entire department. Something along the lines of: \\n\\n\\u201cI just think it\\u2019s funny how OP confirmed she would go to lunch at 11 but then turned around and switched lunch times. I guess you can do whatever you want when you\\u2019re friends with the supervisor.\\u201d\\n\\nShe quickly deleted the message but not before me and 15 other people saw it. No I\\u2019m not \\u201cfriends\\u201d with the supervisor, we are distantly related by marriage but have never been around each other outside of work. \\n\\nI heard she was turned into HR last year for bullying a girl into quitting but nothing came of it. I\\u2019m on the fence of reporting her behavior to HR or just quitting for my peace. But good paying jobs are hard to find these days. :/\"", "title": "My coworker accidental sent a group message to our entire department gossiping about me", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/jobs/comments/19dc5b3/my_coworker_accidental_sent_a_group_message_to/"}, {"author": "m00syg00sy", "created_utc": 1709557336.0, "link_flair_template_id": "fdc72fd0-05ac-11e6-b950-0ef0df358363", "link_flair_text": "Leaving a job", "num_comments": 435, "post_id": "1b6adch", "score": 4347, "subreddit": "jobs", "text": "\"Just left my first full time job for good. I started when I was 19 and naive and as i\\u2019ve gotten older (24 now) I just could no longer deal with a lot of the stuff I was putting up with. I had left once before for about 6 months and then came back (always with the understanding that i\\u2019d be coming back). After I quit this time my old boss texted me this. Any opinions on this?\"", "title": "Wanted to get other’s opinion", "upvote_ratio": 0.95, "url": "https://www.reddit.com/gallery/1b6adch"}, {"author": "patovc", "created_utc": 1707736760.0, "link_flair_template_id": "fdc72fd0-05ac-11e6-b950-0ef0df358363", "link_flair_text": "Leaving a job", "num_comments": 144, "post_id": "1aoxqyc", "score": 4236, "subreddit": "jobs", "text": "\"\"", "title": "Would do you leave a job like this?", "upvote_ratio": 0.94, "url": "https://i.redd.it/jlp2e8d525ic1.jpeg"}, {"author": "Harpocretes", "created_utc": 1682374875.0, "link_flair_template_id": "119d3960-05ac-11e6-8bc7-0ec36f9f170d", "link_flair_text": "Compensation", "num_comments": 831, "post_id": "12xypxg", "score": 4169, "subreddit": "jobs", "text": "\"I\\u2019m in charge of hiring engineers for my division.  We made an offer last week with an exchange that went something like this:\\n\\n1. Us: Great interview, team likes you. How about a base salary of 112k plus benefits?\\n2. Them: oh jeez that sounds good but I was really hoping for 120k.\\n3. Us: how about 116k and when you get your license (should be within a 12 months or less) automatic 5k bump?\\n4. Them: sounds great\\n5. I prep offer, get it approved and sent out the next day. \\n6. Them: hey I was thinking I\\u2019d rather have 121k. \\n\\nThat isn\\u2019t how you negotiate! The key time to negotiate was before we had settled on a number- coming back higher after that just irritates everyone involved. Or am I off base?\"", "title": "Do new hires not understand how to negotiate??", "upvote_ratio": 0.9, "url": "https://www.reddit.com/r/jobs/comments/12xypxg/do_new_hires_not_understand_how_to_negotiate/"}]