[{"author": "RUTHLESS_RAJ", "author_flair_text": null, "clicked": false, "created_utc": 1710326220.0, "distinguished": null, "edited": false, "id": "1bdoar9", "is_original_content": false, "is_self": false, "locked": false, "name": "t3_1bdoar9", "num_comments": 267, "over_18": false, "permalink": "/r/jobs/comments/1bdoar9/what_does_being_loyal_get_you_in_all_fairness/", "saved": false, "score": 2089, "spoiler": false, "stickied": false, "text": "", "title": "What does being loyal get you in all fairness?", "upvote_ratio": 0.96, "url": "https://i.redd.it/4leqgt5rx2oc1.png"}, {"author": "Deathrider66", "author_flair_text": null, "clicked": false, "created_utc": 1710292956.0, "distinguished": null, "edited": false, "id": "1bdeqdu", "is_original_content": false, "is_self": false, "locked": false, "name": "t3_1bdeqdu", "num_comments": 27, "over_18": false, "permalink": "/r/jobs/comments/1bdeqdu/you_mean_52_pay_cut/", "saved": false, "score": 672, "spoiler": false, "stickied": false, "text": "", "title": "You mean 5.2% pay cut.", "upvote_ratio": 0.97, "url": "https://i.redd.it/y4faivw170oc1.jpeg"}, {"author": "wavydavysonfiree", "author_flair_text": null, "clicked": false, "created_utc": 1710346958.0, "distinguished": null, "edited": 1710370383.0, "id": "1bdvlyg", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1bdvlyg", "num_comments": 174, "over_18": false, "permalink": "/r/jobs/comments/1bdvlyg/job_that_laid_me_off_is_now_hiring_for_my_position/", "saved": false, "score": 613, "spoiler": false, "stickied": false, "text": "It wasn’t even 6 months ago. What the fuck. And I know I did a good job too people liked working with me I never got bad feedback I was always reliable. I literally did things no one else on my team knew how. \n\nI got laid off when the company was going through a change but they literally said my position was eliminated. Yet now it is magically needed again? Awesome. I just don’t even get what the possible reason could be? it makes me feel like someone must’ve hated me?? It’s not a particularly big company. I got a new job anyway very luckily but still I’m having to start all over again, and it put me like 4 months behind in contributing to retirement, etc.  (also not to mention not getting my bonus)", "title": "Job that laid me off is now hiring for my position", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/jobs/comments/1bdvlyg/job_that_laid_me_off_is_now_hiring_for_my_position/"}, {"author": "platinum_tears", "author_flair_text": null, "clicked": false, "created_utc": 1710287117.0, "distinguished": null, "edited": 1710287568.0, "id": "1bdcjad", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1bdcjad", "num_comments": 54, "over_18": false, "permalink": "/r/jobs/comments/1bdcjad/been_at_my_new_job_for_a_week_and_am_on_a_semipip/", "saved": false, "score": 261, "spoiler": false, "stickied": false, "text": "I’ve been at my new job for a week. In this time it took two days to onboard me, and I’ve been given minimal work. The work I have done I have asked a lot of questions and gone slow in order to adhere to the brand standards and aesthetic. I do 3D rendering for work just fyi. I was asked to render something Thursday afternoon that the software literally cannot do, and told my boss this. She said okay and to put it in a photoshop file with the source image in place of the rendering. I did. She didn’t like it and thought it lacked composition even though I took a file that she initially made and just added a fixture. \n\nToday, she pulled me into a meeting and told me that my rendering skills aren’t up to the level they assumed, that I’m not creative and need to learn composition, and that I’m working too slowly. \n\nIt’s been a few days. I don’t know anyone, the new rendering engine, or the brand aesthetic. So I’m asking questions, which she says there are too many of, and am being transparent about the limitations of a software that she does not know how to use. She showed me some renderings from the person previously in my role and I was whelmed. I can do better but she seems disinterested. I asked her if she had seen my portfolio and she said “maybe.” Her boss hired me, and as of yesterday she is out on medical leave indefinitely but no one told me. I have not been asked to come up with original ideas yet and am tying to piggyback on their ideas for Mother’s Day. She asked me to photoshop something yesterday but didn’t like my first couple of ideas for the space and told me that I’m taking too long. I’m doing the work, she just doesn’t like it. \n\nI just don’t understand how you can judge someone in such a short amount of time and I’m really stressing out. \n\nEdit: she did tell me that she wants me to succeed and will give me a couple months but cmon ", "title": "Been at my new job for a week and am on a semi-PIP", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/jobs/comments/1bdcjad/been_at_my_new_job_for_a_week_and_am_on_a_semipip/"}, {"author": "trudybakeman", "author_flair_text": null, "clicked": false, "created_utc": 1710285722.0, "distinguished": null, "edited": false, "id": "1bdbzoc", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1bdbzoc", "num_comments": 29, "over_18": false, "permalink": "/r/jobs/comments/1bdbzoc/my_colleague_gave_her_two_weeks_notice_i_want_her/", "saved": false, "score": 87, "spoiler": false, "stickied": false, "text": "How do I do this without coming off like a vulture? Because I’m really not, there’s no one else who *could* have it, until they hire her replacement.\n\nWe’re a team of 4, and there are 7 offices total. 3 of them have windows. Mine has no windows, I’m the most recent hire. \n\nMy coworker is leaving because she can’t handle the travel anymore, she lives far away and the traffic is hard. It’s amicable.\n\nI’d like to request her office, since it has windows and mine doesn’t, and I really have a hard time with the darkness.\n\nHow do I do this in a way that’s not pushy and is likely to get a yes? I’m so bad at taking up space and asking for things…", "title": "My colleague gave her two weeks notice; I want her office.", "upvote_ratio": 0.9, "url": "https://www.reddit.com/r/jobs/comments/1bdbzoc/my_colleague_gave_her_two_weeks_notice_i_want_her/"}, {"author": "messengerpenguin3rd", "author_flair_text": null, "clicked": false, "created_utc": 1710362596.0, "distinguished": null, "edited": false, "id": "1be28jh", "is_original_content": false, "is_self": false, "locked": false, "name": "t3_1be28jh", "num_comments": 242, "over_18": false, "permalink": "/r/jobs/comments/1be28jh/got_my_offer_rescinded/", "saved": false, "score": 654, "spoiler": false, "stickied": false, "text": "I interviewed for a role at a family owned, midsized company that I thought would be good experience to help prepare me to get into the grad programs I want to get into on Friday, 1/26. The interview went really well and I liked the staff I spoke with, and they also seemed impressed by my background and what I was saying. After several  weeks of phone calls and emails asking for followups, on Wednesday 2/28 I received a call from the VP who is also the hiring manager that he would like to give me the job and asked if I could come into the office to sign the offer. Because I had another interview scheduled for that Friday and was also hoping to hear back from another opportunity I asked him for an emailed offer and if I could have time to make a decision. I felt his tone change and he said in that case he’ll hold off on sending me the offer letter which I thought was odd. I then asked if a week would be an acceptable time frame to respond with my decision to which he said “sure, but the sooner the better” which is understandable. We ended the phone call after that, which is when I sent my followup email thanking him and setting March 8th as the agreed upon deadline. Just two hrs later I got my offer rescinded in the email screenshot above.\n\nI was furious lmao. If he wanted a decision in two hours instead of a week he had several opportunities to communicate his expectation on our phone call and after my email, but he completely disregarded my efforts to set up communication with him and rescinded the offer without giving me a chance. I decided to leave a negative Glassdoor interview review because I felt disrespected and did not feel like another conversation with him would lead anywhere because he had already rescinded my offer.\n\nNow I still feel upset, but also some regret and sadness because the job market is so tough right now and I cant help but wonder if I should have handled things differently. I wonder if I should have just swallowed my pride and called him to ask if my offer could be given back if I gave him an answer that day. The job would have been really close to where I live and I liked the other staff there.", "title": "Got my offer rescinded", "upvote_ratio": 0.93, "url": "https://i.redd.it/2d34hul4y5oc1.jpeg"}, {"author": "mohito1999", "author_flair_text": null, "clicked": false, "created_utc": 1710349729.0, "distinguished": null, "edited": false, "id": "1bdwshf", "is_original_content": false, "is_self": false, "locked": false, "name": "t3_1bdwshf", "num_comments": 11, "over_18": false, "permalink": "/r/jobs/comments/1bdwshf/thank_you_for_applying_but_unfortunately/", "saved": false, "score": 59, "spoiler": false, "stickied": false, "text": "", "title": "\"Thank You For Applying But Unfortunately..\" :(", "upvote_ratio": 0.99, "url": "https://i.redd.it/aqd6a7djv4oc1.jpeg"}, {"author": "Embarrassed_Edge3992", "author_flair_text": null, "clicked": false, "created_utc": 1710334986.0, "distinguished": null, "edited": false, "id": "1bdqwyi", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1bdqwyi", "num_comments": 29, "over_18": false, "permalink": "/r/jobs/comments/1bdqwyi/my_boss_kicked_me_off_her_team_because_i_produce/", "saved": false, "score": 47, "spoiler": false, "stickied": false, "text": "For context I work in the accounts receivable medical billing field. We have daily quotas and other productivity goals that we have to meet. I've been at my current job for 4 months, and am still learning the ropes but my coworkers and boss have said I've learned quick and am doing a great job so far. We have a productivity goal of 40 claims a day. I've been doing my 40 and sometimes I can do 45 if the claims are easy for that day.\n\nWell out of the blue my boss calls me and tells me that I'm officially starting in another department under a new manager where I will be working a totally different set of claims for a brand new provider. They will be training me all over again as if this is a new job. When I asked her why she said \"you give me too much work and this other team needs the help more.\"\n\nSo now today I'm starting with my new team after only being with the company for 4 months. What my boss said doesn't make sense. I never overexceed the daily quota of 40. I do the bare minimum that's required. What does she mean by I \"give her too much work?\" I'm a quiet employee and don't bother anyone unless I absolutely have to. I'm the type that I try to find the answers myself before bothering anyone else for help. \n\nI've heard terrible things about the new team I'll be on. The work is more difficult so it's a lot harder to meet the quota of 40. Plus the manager isn't helpful at all and throws you to the wolves. I'm so upset that I updated my resume last night and started looking for a new job all over again. I was happy with this job. I thought things were going well. My boss even gave me positive reviews. But then she kicks me off her team. I feel like I was fired and am starting a new job today. I'm not looking forward to working on this new team because of the things I've heard about it.\n\nWhy in the world did they make this decision?", "title": "My boss kicked me off her team because I \"produce too much work?\"", "upvote_ratio": 0.91, "url": "https://www.reddit.com/r/jobs/comments/1bdqwyi/my_boss_kicked_me_off_her_team_because_i_produce/"}, {"author": "ryrosexoxo", "author_flair_text": null, "clicked": false, "created_utc": 1710293892.0, "distinguished": null, "edited": false, "id": "1bdf2iq", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1bdf2iq", "num_comments": 8, "over_18": false, "permalink": "/r/jobs/comments/1bdf2iq/i_just_ghosted_my_first_job_i_feel_like_an/", "saved": false, "score": 31, "spoiler": false, "stickied": false, "text": "I meant to title this “i ghosted a job for the first time”. \n\nI feel terrible but I was hired about 3 weeks ago. In my interview i mentioned I would not be able to work on weekends as I go home to see my parents every weekend (i live in a different state then my family). I said I would like to work 40 hours a week, monday through friday. She told me this was exactly what they were looking for. Great!\n\nDid my training only 3 days a week but whatever, its training. Then, I didnt get my direct deposit my 3rd week in for the past 2 weeks. Also, the paycheck was missing 2 hours from it. (I could view the check online but didnt get deposited) I texted her and all i got was “i think itll be in the next week direct deposit and ill add the 2 hours”. ok? weird but i figured ill just ask for clarification in person the next time i work. \n\nShe then texted me (saturday night at 8pm) the “official” schedule saying heres the hours you will be working this week and going forward now that you have completed training. She scheduled me Friday, Saturday, Sunday (the next day at 7am), and Monday. All four days for 4 hour shifts. I was already so pissed off about not getting my pay. \n\nI texted her and said these are not the hours or days we discussed in the interview and i will not be able to come in Saturday or Sunday, but I can work any other day to replace those! She never answered me. Sunday rolled around and I was still at home 3 hours away and she never responded to my text. She then proceeded to call me 7 times still without answering my text. So i just blocked her lol. I feel like an ass but seriously? I made it a point to let her know I can’t work weekends since thats usually when fast food places prefer to hire. \n\nI literally dont care. If i never get that $250 paycheck via direct deposit ill be upset but im definitely never showing my face in that establishment again. ", "title": "I just ghosted my first job. I feel like an asshole but think it was justified ", "upvote_ratio": 0.89, "url": "https://www.reddit.com/r/jobs/comments/1bdf2iq/i_just_ghosted_my_first_job_i_feel_like_an/"}, {"author": "NewJourneyLost", "author_flair_text": null, "clicked": false, "created_utc": 1710292226.0, "distinguished": null, "edited": false, "id": "1bdegxo", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1bdegxo", "num_comments": 45, "over_18": false, "permalink": "/r/jobs/comments/1bdegxo/anybody_else_terrified_about_ai/", "saved": false, "score": 28, "spoiler": false, "stickied": false, "text": "I’ve heard people dismiss the application of AI, but no doubt in my eye the job market for tech jobs will definitely will be impacted. I want to change my major to IS, but honestly for financial security I might have to choose a career outside tech.", "title": "Anybody else terrified about AI?", "upvote_ratio": 0.78, "url": "https://www.reddit.com/r/jobs/comments/1bdegxo/anybody_else_terrified_about_ai/"}, {"author": "Life-Dig703", "author_flair_text": null, "clicked": false, "created_utc": 1710327080.0, "distinguished": null, "edited": false, "id": "1bdoirn", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1bdoirn", "num_comments": 12, "over_18": false, "permalink": "/r/jobs/comments/1bdoirn/i_think_its_finally_the_day/", "saved": false, "score": 22, "spoiler": false, "stickied": false, "text": "I’ve been at my job for almost 10 years. I loved it at the beginning but now hate it. I’ve been looking for new jobs and haven’t found any, however maybe it’s due to me having this one. \n\nI think today is the day I quit and see what the universe sends me. The worst that could happen is I work at a restaurant for a bit and continue my college education. \n\nI may also just call in and get a write up. Either way today is the day I start a new journey. ", "title": "I think it’s finally the day", "upvote_ratio": 0.91, "url": "https://www.reddit.com/r/jobs/comments/1bdoirn/i_think_its_finally_the_day/"}, {"author": "MsArtio", "author_flair_text": null, "clicked": false, "created_utc": 1710283768.0, "distinguished": null, "edited": false, "id": "1bdb6ur", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1bdb6ur", "num_comments": 2, "over_18": false, "permalink": "/r/jobs/comments/1bdb6ur/got_a_new_job_emailed_over_my_notice/", "saved": false, "score": 23, "spoiler": false, "stickied": false, "text": "Starting job searching last week, had my first interview today & not 10 minutes after the interview I got a call back and got offered the job 😄\n\nI feel like my new job is going to be so much better, the manager was absolutely appalled. if not outraged, at what I was getting paid for the amount of time I've been employed with my current office (17 ,told her 18, an hour, been there 2.5 yrs. Min wage here is 16) \n\nBenefits are less than what I currently have but I'll take the pay and skills upgrade", "title": "Got a new job & emailed over my notice", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/jobs/comments/1bdb6ur/got_a_new_job_emailed_over_my_notice/"}, {"author": "beyoncepadthai4", "author_flair_text": null, "clicked": false, "created_utc": 1710351883.0, "distinguished": null, "edited": false, "id": "1bdxozi", "is_original_content": false, "is_self": false, "locked": false, "name": "t3_1bdxozi", "num_comments": 4, "over_18": false, "permalink": "/r/jobs/comments/1bdxozi/applying_since_halloween/", "saved": false, "score": 22, "spoiler": false, "stickied": false, "text": "I always find these post interesting so I thought I would contribute my own results. Here are some more details: My background is kind of niche, I have a law degree as well as a license in the medical field however I don’t want to work directly in either field but still wanted to use a combo of those skills so the search was… complicated lol. I’m wasn’t sure a job existed that combined my interests but it did!\n\nThe 3 assessments requested took between 2-4 hours each and were writing assignments. I said no because honestly it seemed the orgs were looking for a bit of free labor. I wrote fairly detailed and custom cover letters for each position, but ironically the position I accepted did not want a CL at all. I was not hesitant to withdraw from jobs I felt would be a bad fit, I even withdrew from a job mid interview. \n\nI would definitely recommend applying to way more jobs than I did over the span 4+ months, but as I said, I felt the type of positions I sought were few and far between so I found it difficult to find jobs to apply to in the first place.", "title": "Applying since Halloween", "upvote_ratio": 0.94, "url": "https://i.redd.it/534hdtw925oc1.jpeg"}, {"author": "kclark5060", "author_flair_text": null, "clicked": false, "created_utc": 1710342566.0, "distinguished": null, "edited": false, "id": "1bdttj0", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1bdttj0", "num_comments": 26, "over_18": false, "permalink": "/r/jobs/comments/1bdttj0/am_i_overqualified_i_cant_seem_to_land_a_simple/", "saved": false, "score": 15, "spoiler": false, "stickied": false, "text": "25(M) started an exotic rental car business when I was 23 and it was pretty successful. Due to some unfortunate incidents it basically crashed and burned (no pun intended). \n\nI’ve been applying to tons of jobs the past few months and cannot make it past the interview stage. Before starting my business I had no issues landing a job. After having some experience in the business field I ask much more questions when being interviewed  \n\nI ask about the benefits, room for growth, work atmosphere, etc. \n\nA couple days ago during the interview I was asked “What are you looking for long term?” I didn’t lie. I said “Looking to join a company where there’s room for growth and one that will allow/help with whatever endeavors I might have in the future.” \n\nI’ve noticed the more questions I ask, and the more I express that I am looking for something that can help me build a future the more turned off they get. \n\nIs it better if I just lie and make myself look like I want a job that’s a means to an end? ", "title": "Am I overqualified? I can’t seem to land a “simple” job.", "upvote_ratio": 0.83, "url": "https://www.reddit.com/r/jobs/comments/1bdttj0/am_i_overqualified_i_cant_seem_to_land_a_simple/"}, {"author": "Impossible-Guest624", "author_flair_text": null, "clicked": false, "created_utc": 1710318598.0, "distinguished": null, "edited": false, "id": "1bdme16", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1bdme16", "num_comments": 18, "over_18": false, "permalink": "/r/jobs/comments/1bdme16/how_did_you_land_your_job_in_2024/", "saved": false, "score": 16, "spoiler": false, "stickied": false, "text": "I would personally love to hear tips, suggestions and recommendations from those of you who have landed a job recently in this job market. I haven’t seen much of this, and I refuse to go another month job hunting lol\n\nAny resume suggestions?\nApplication suggestions?\nWhat should us job seekers do to pivot? \nInterview Tips? \nDo you recommend following up after an application? ", "title": "How did you land your job in 2024?", "upvote_ratio": 0.88, "url": "https://www.reddit.com/r/jobs/comments/1bdme16/how_did_you_land_your_job_in_2024/"}, {"author": "emma_kayte", "author_flair_text": null, "clicked": false, "created_utc": 1710291388.0, "distinguished": null, "edited": 1710368298.0, "id": "1bde5zq", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1bde5zq", "num_comments": 91, "over_18": false, "permalink": "/r/jobs/comments/1bde5zq/i_just_left_my_job_as_a_pre_employment_background/", "saved": false, "score": 11, "spoiler": false, "stickied": false, "text": "The background check can be confusing, take forever, and is often stupid.  I just left my soul sucking job doing them for way too long so i thought I would offer my knowledge \n\nWhat do you want to know?  Keep in mind my perspective is from the third party verifier for large companies.  Things may be different when HR is conducting the background check or if you're applying to a small company \n\nI'll try to add some misconceptions I see a lot \n\nAnd no, I have no idea why our software requires a resume then asks for the info to be typed in\n\n", "title": "I just left my job as a pre employment background investigator. AMA", "upvote_ratio": 0.75, "url": "https://www.reddit.com/r/jobs/comments/1bde5zq/i_just_left_my_job_as_a_pre_employment_background/"}, {"author": "Thin_Tennis4114", "author_flair_text": null, "clicked": false, "created_utc": 1710349575.0, "distinguished": null, "edited": false, "id": "1bdwq66", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1bdwq66", "num_comments": 16, "over_18": false, "permalink": "/r/jobs/comments/1bdwq66/got_a_job_offer_doing_the_same_thing_but_they/", "saved": false, "score": 11, "spoiler": false, "stickied": false, "text": "I currently work as a receptionist for a small business owner, she owns a spa but she has no plans of ever giving me a raise. So I started to apply to something in the medical field, I no longer want to do anything beauty related. Today, I got a job offer as a receptionist in a dermatology office. But they’re offering me $2 less than what I currently make, I tried to negotiate it and basically told them “I’ve been doing this job for years and I’ve even been an administrative assistant in a law office, I have bookkeeping experience. I deserve more. I know so much.” They said that if I pass my probation period (3 months) that they’ll bump me up to what I’m asking for. The thing is, this is a chain dermatology, and their job reviews are horrible... BUUUUT they are not related to the location I am currently applying to - which is why i went ahead and applied for it anyway. \n\nAny advice on what I should do??! Should I take it?? Nothing guarantees me they won’t fire me after a few months. I’m so lost.", "title": "Got a job offer doing the same thing, but they want to pay less.", "upvote_ratio": 0.84, "url": "https://www.reddit.com/r/jobs/comments/1bdwq66/got_a_job_offer_doing_the_same_thing_but_they/"}, {"author": "Sufficient_Basis_461", "author_flair_text": null, "clicked": false, "created_utc": 1710295500.0, "distinguished": null, "edited": false, "id": "1bdfnok", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1bdfnok", "num_comments": 9, "over_18": false, "permalink": "/r/jobs/comments/1bdfnok/should_i_tell_my_manager_about_my_coworker_acting/", "saved": false, "score": 14, "spoiler": false, "stickied": false, "text": "As the title says, I work at a dog daycare. Yesterday one of my coworkers got really annoyed with one of the dogs barking a lot and raised their hand at this dog while holding a can as if they were threatening to hit the dog. There are cameras in every room here so if I tell my manager about this she can pull up the footage for proof, but I am not sure if it’s even worth reporting since she didn’t actually hit them. I also don’t want to be seen as an asshole by anyone for “snitching” since I am pretty new here and I don’t want people to start disliking me. But that behavior is really concerning because I don’t think you shouldn’t be working at a daycare if dog barking annoys you enough to the point where you threaten to hit the dog if they don’t shut up. Help please, this is my first job so I don’t know. ", "title": "Should I tell my manager about my coworker acting aggressive to a dog at the daycare I work for?", "upvote_ratio": 0.82, "url": "https://www.reddit.com/r/jobs/comments/1bdfnok/should_i_tell_my_manager_about_my_coworker_acting/"}, {"author": "knightoffire55", "author_flair_text": null, "clicked": false, "created_utc": 1710359466.0, "distinguished": null, "edited": false, "id": "1be0xbm", "is_original_content": false, "is_self": false, "locked": false, "name": "t3_1be0xbm", "num_comments": 4, "over_18": false, "permalink": "/r/jobs/comments/1be0xbm/how_does_this_burger_flipping_job_have_over_2000/", "saved": false, "score": 13, "spoiler": false, "stickied": false, "text": "", "title": "How does this burger flipping job have over 2000 applicants when almost every other job has 200 at most?", "upvote_ratio": 0.93, "url": "https://i.redd.it/1xibm0sfo5oc1.png"}, {"author": "Expensive-Forever798", "author_flair_text": null, "clicked": false, "created_utc": 1710362709.0, "distinguished": null, "edited": false, "id": "1be2a8k", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1be2a8k", "num_comments": 95, "over_18": false, "permalink": "/r/jobs/comments/1be2a8k/why_am_i_getting_rejected_by_so_many_jobs_after/", "saved": false, "score": 12, "spoiler": false, "stickied": false, "text": "I graduated with a degree in political science this past winter. I never got an internship or anything during college, so I figured I wouldn’t be a top candidate. I also don’t have a grade GPA. However, I still expected to be able to land an internship position after graduation. I have been rejected by so many internships despite having my bachelors degree. \n\nHow am I not even able to get an internship after graduating? I am about an hour outside of DC, which is where I am applying to mainly. Maybe they want people that live in DC?\n\nWhatever the reason is, I just cannot find an internship that will accept me. Starting to make me think I’ll never get a job and college was a complete waste (don’t want a political argument about college). \n\nWhat do you guys think ?", "title": "Why am I getting rejected by so many jobs after college?", "upvote_ratio": 0.69, "url": "https://www.reddit.com/r/jobs/comments/1be2a8k/why_am_i_getting_rejected_by_so_many_jobs_after/"}, {"author": "MomoIsBaby", "author_flair_text": null, "clicked": false, "created_utc": 1710345707.0, "distinguished": null, "edited": false, "id": "1bdv3n5", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1bdv3n5", "num_comments": 15, "over_18": false, "permalink": "/r/jobs/comments/1bdv3n5/looking_to_switch_careers_i_need_a_job_that_pays/", "saved": false, "score": 8, "spoiler": false, "stickied": false, "text": "Currently I am a bus driver. I make $25/hr, and the job is easy, but I have to work a ton of overtime and they drug test. I’d like to have more personal time, and I miss smoking weed on the weekends! \n\nI want a job that doesn’t have too much overtime and isn’t too difficult to get hired for. I need to make at least $40K/year if possible. I would also prefer something where I don’t have to deal too much with office politics. \n\nWhat do y’all recommend?", "title": "Looking to switch careers - I need a job that pays at least $40k/year. Would like recommendations please", "upvote_ratio": 0.79, "url": "https://www.reddit.com/r/jobs/comments/1bdv3n5/looking_to_switch_careers_i_need_a_job_that_pays/"}, {"author": "Fire_Master", "author_flair_text": null, "clicked": false, "created_utc": 1710295588.0, "distinguished": null, "edited": false, "id": "1bdfotf", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1bdfotf", "num_comments": 4, "over_18": false, "permalink": "/r/jobs/comments/1bdfotf/after_almost_a_year_of_unemployment_i_got_an_offer/", "saved": false, "score": 9, "spoiler": false, "stickied": false, "text": "I actually got the offer yesterday and agreed to it.\nIt's been a tough year w/ all of the job scams going around that some subreddits elaborated on and recruiters giving me the run around/being incompetent in checking my details. I been filling out the forms and background check. I'll have to next pass an assessment and despite it being a remote position, a drug (urine) test is required (maybe due to it being part of a federal program).\n\nIt's close to the rate I worked, but still something full-time w/ benefits and more lenient expectations.", "title": "After Almost a Year of Unemployment, I Got An Offer", "upvote_ratio": 0.92, "url": "https://www.reddit.com/r/jobs/comments/1bdfotf/after_almost_a_year_of_unemployment_i_got_an_offer/"}, {"author": "leaveinsilence", "author_flair_text": null, "clicked": false, "created_utc": 1710349453.0, "distinguished": null, "edited": false, "id": "1bdwocq", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1bdwocq", "num_comments": 5, "over_18": false, "permalink": "/r/jobs/comments/1bdwocq/psa_glassdoor_now_demands_you_publish_reviews/", "saved": false, "score": 8, "spoiler": false, "stickied": false, "text": "Logged back in out of curiosity, can't read my own reviews: the website forces you to a page to write a new review or add a new salary. Not sure how worthwhile the website is now, but don't know any alternatives..", "title": "PSA: Glassdoor now demands you publish reviews, salaries, regularly to have access to your profile.", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/jobs/comments/1bdwocq/psa_glassdoor_now_demands_you_publish_reviews/"}, {"author": "AndWall97", "author_flair_text": null, "clicked": false, "created_utc": 1710343233.0, "distinguished": null, "edited": false, "id": "1bdu3aa", "is_original_content": false, "is_self": false, "locked": false, "name": "t3_1bdu3aa", "num_comments": 8, "over_18": false, "permalink": "/r/jobs/comments/1bdu3aa/engineering_job_search_before_graduation/", "saved": false, "score": 7, "spoiler": false, "stickied": false, "text": "Graduating in 2 months with an environmental engineering degree", "title": "Engineering job search before graduation", "upvote_ratio": 0.74, "url": "https://i.redd.it/rnu4wowjc4oc1.jpeg"}, {"author": "ugly-dumbass", "author_flair_text": null, "clicked": false, "created_utc": 1710342717.0, "distinguished": null, "edited": false, "id": "1bdtvs0", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1bdtvs0", "num_comments": 5, "over_18": false, "permalink": "/r/jobs/comments/1bdtvs0/why_are_jobs_making_applicants_jump_through_hoops/", "saved": false, "score": 7, "spoiler": false, "stickied": false, "text": "Ive applied to countless jobs in the past 6 months. With all the applications I've gotten a few interviews. \n\nSome were reasonable, 2-3 round interviews. \n\nA chunk were out there, 3+ week wait times between interviews, 4-8 round interviews sayijg the same thing to the same people. Waisting hours talking to these people just to tell me know and the job be reposted a week later. \n\nAnd the majority were insane. Including full on walkthroughs of the store explaining to teams what I would do in random scenarios. Working a partial shit just to be told no and not be paid for that either. Multi round interviews with in detail job assessments. \n\nOr my favorite(the interview I'm about to go on) after an interview, a secondary interview with an assessment then another interview immediately following the assessment explaining my reasoning to my answers. They now want a full on 20 minute presentation with a 25 minute q&a section. \n\nThese aren't corporate jobs, they aren't normal 9-5s I'm not going to be at a desk. It's fucking retail. Where the hell is this shit coming from and WHY? Why are companies doing all this shit wasting people's time for a small chance at a job? I can't be the only one seeing this as weird. ", "title": "Why are jobs making applicants jump through hoops", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/jobs/comments/1bdtvs0/why_are_jobs_making_applicants_jump_through_hoops/"}, {"author": "caffeinated_hardback", "author_flair_text": null, "clicked": false, "created_utc": 1710347267.0, "distinguished": null, "edited": false, "id": "1bdvqmv", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1bdvqmv", "num_comments": 9, "over_18": false, "permalink": "/r/jobs/comments/1bdvqmv/rant_hired_after_months_of_unemployment_parents/", "saved": false, "score": 8, "spoiler": false, "stickied": false, "text": "Maybe unsupportive is the wrong word, but my Dad was kind of snidey and sarcastic about it when I got the offer. \n\nEssentially I (22F) resigned from my retail job last summer as I had my dream graduate job lined up. However, before I’d even started the company had to cut back on hiring, and I was essentially ghosted and never ended up working there. I’ve been trying to get into a field linked to my degree (history/heritage), but I’m always on the last round of interviews and then never hired. That lasted almost seven months, during which I started volunteering and undertaking a business diploma online to get qualified, remain busy, and keep my options open.\n\nToday, the charity with which I’ve been volunteering at offered me a job and I accepted, and I was elated to finally have some security back in my life. It’s another retail role but this time in a bookshop, which is more in alignment with my longer term goals of getting into heritage publishing. It also pays better than my last job, with a pension scheme and full time contract. Needless to say, I was so excited to finally take some steps forward.\n\nI just broke the news to my Dad, and he replied with a very sarcastic, disinterested “thank god for that. Not like it’s hard to get into retail”, and just walked away. I’m trying to see his point of view with compassion, as I know it’s not easy having your adult child live with you while they’re unemployed, and I know he just wants the best for me and wants me to get another job in my dream field. But considering my experiences over the last few months, I just kind of needed a bit more enthusiasm you know. This new job will give me income, a chance to start a pension, and allow me funds to either save for an MA degree or rent a room elsewhere closer to where the jobs in my field is (most of my rejections came from the fact I was too far from the workplace or that I didn’t drive. I drive now, but I’m still a firm believer in going where the work is).\n\nNot sure if this was a rant or a cry for help lol, but it really dampened what should have been a relieving moment for me, and now I feel almost ashamed to have been so excited over a retail job even though I know how valid and demanding this industry is. I know my situation has probably had its impact on him emotionally as well, but I just expected more excitement or support from him after having been through so much rejection and frustration these last few months. My mum was relieved and shares my opinions, but my Dad seems unphased, if not more disappointed and I can’t help but feel a little crushed by it.", "title": "Rant: Hired after months of unemployment. Parents unsupportive and disinterested.", "upvote_ratio": 0.79, "url": "https://www.reddit.com/r/jobs/comments/1bdvqmv/rant_hired_after_months_of_unemployment_parents/"}, {"author": "organicsauce21", "author_flair_text": null, "clicked": false, "created_utc": 1710297581.0, "distinguished": null, "edited": false, "id": "1bdgfbw", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1bdgfbw", "num_comments": 7, "over_18": false, "permalink": "/r/jobs/comments/1bdgfbw/do_you_waste_time_applying_to_jobs_that_require_a/", "saved": false, "score": 5, "spoiler": false, "stickied": false, "text": "Sometimes I look at stuff and its taking me to an offsite website (goes from indeed to the companies website) and I go through almost a 20 minute process of entering in manual info. Do you guys just skip these?", "title": "Do you waste time applying to jobs that require a long complicated process on an external website?", "upvote_ratio": 0.79, "url": "https://www.reddit.com/r/jobs/comments/1bdgfbw/do_you_waste_time_applying_to_jobs_that_require_a/"}, {"author": "S1CK_SCOTTY", "author_flair_text": null, "clicked": false, "created_utc": 1710293159.0, "distinguished": null, "edited": false, "id": "1bdet1a", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1bdet1a", "num_comments": 9, "over_18": false, "permalink": "/r/jobs/comments/1bdet1a/two_managers_before_me_have_had_psychological/", "saved": false, "score": 7, "spoiler": false, "stickied": false, "text": "I’ll keep it short. \n\nManager almost a year ago had a legitimate mental breakdown during a shift. Threw his hat at the wall and stormed out during work. He was then banned from returning to the building. He had just been promoted and was working 40+ hours a week\n\nCurrent manager is losing his mind. He went from being one of the most (if not THE most) productive members of the company, to someone who may as well not even show up. When he’s at work, he just stares at a computer screen or his hands during moments where he’s needed elsewhere. It’s very strange. \n\nBottom line is this void has allowed a potential promotion to this position for myself in the future. I’m already working 45-50 hours a week as the position just under manager. \nI have to be honest I’m very worried about going down the same path, as this line of work is extremely stressful and doesn’t pay well at all. \n\nAnyone have any similar situations they’ve been through or recommendations for me?\n\nIf I leave this job I’ll be starting over somewhere new as wasting my years here", "title": "Two managers before me have had psychological breaks, I’m next in line for the position", "upvote_ratio": 0.78, "url": "https://www.reddit.com/r/jobs/comments/1bdet1a/two_managers_before_me_have_had_psychological/"}, {"author": "cantdance1214", "author_flair_text": null, "clicked": false, "created_utc": 1710283186.0, "distinguished": null, "edited": false, "id": "1bdaydo", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1bdaydo", "num_comments": 10, "over_18": false, "permalink": "/r/jobs/comments/1bdaydo/my_boss_wont_discuss_a_raise/", "saved": false, "score": 6, "spoiler": false, "stickied": false, "text": "I emailed my boss (my stores general manager) asking to meet to discuss a raise. I did not receive a reply after 3 days and spoke to him in person. \nHe told me he needed to speak with the VP of the company to \"see what he could offer\". After the day he said he would speak with the VP came and went, I asked him again, in person, if we could discuss a raise. He, again, said he had tos peak with her as something had come up and VP did not speak with him. He gave me another day he would try to speak with VP and it has come and gone and he said he still hasn't spoken with VP. He has been very evasive and does not want to speak with me about much of anything currently. \nAm I missing something? I thought the general manager of a store was the person who made decisions on raises, hiring/firing, etc. Is he stalling hoping I'll drop it?", "title": "My boss WONT discuss a raise", "upvote_ratio": 0.88, "url": "https://www.reddit.com/r/jobs/comments/1bdaydo/my_boss_wont_discuss_a_raise/"}, {"author": "suzie-carmichael", "author_flair_text": null, "clicked": false, "created_utc": 1710363002.0, "distinguished": null, "edited": false, "id": "1be2elp", "is_original_content": false, "is_self": false, "locked": false, "name": "t3_1be2elp", "num_comments": 6, "over_18": false, "permalink": "/r/jobs/comments/1be2elp/my_luck_is_finally_turning_around/", "saved": false, "score": 24, "spoiler": false, "stickied": false, "text": "Now comes the interview part. I hope I get it! It’s been about 3 months since I’ve stopped working (the last job I had was temporary & ended in December) 🤞🏾 ", "title": "My luck is finally turning around 🥲🤞🏾", "upvote_ratio": 0.96, "url": "https://i.redd.it/wm9ooo3cz5oc1.jpeg"}, {"author": "Exploding_Muffin", "author_flair_text": null, "clicked": false, "created_utc": 1710340679.0, "distinguished": null, "edited": false, "id": "1bdt28z", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1bdt28z", "num_comments": 9, "over_18": false, "permalink": "/r/jobs/comments/1bdt28z/hiring_manager_is_asking_about_commute_how_to/", "saved": false, "score": 4, "spoiler": false, "stickied": false, "text": "I live in small city A. All the jobs in my field are an hour away in large city B. Average commute is an hour one-way. Hiring manager emailed me asking if I lived in city B or planned to relocate. (side note, they work 3 days in office 2 days remote) The short answer is no. The long answer is it should be my decision on whether or not the commute is worth it! Besides, a hybrid schedule is PERFECT for longer commutes. Ugh.\n\nIn an ideal world I would relocate, but my current family situation is rooted in city A and moving to a more expensive area to maybe land a job is too risky for this economy and well out of my current budget.\n\nI dont want to lie but I have an overwhelming feeling that the truth will result in getting ghosted. Advice?", "title": "Hiring manager is asking about commute. How to navigate around the truth?", "upvote_ratio": 0.76, "url": "https://www.reddit.com/r/jobs/comments/1bdt28z/hiring_manager_is_asking_about_commute_how_to/"}, {"author": "simplydreamiin", "author_flair_text": null, "clicked": false, "created_utc": 1710362984.0, "distinguished": null, "edited": false, "id": "1be2ebz", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1be2ebz", "num_comments": 2, "over_18": false, "permalink": "/r/jobs/comments/1be2ebz/doubting_that_the_majority_of_job_postings_are/", "saved": false, "score": 6, "spoiler": false, "stickied": false, "text": "As the title says, I know I can't be the only one who undoubtly believes that most of the job postings I see online are actually hiring. At this point I actually just want to make the initiative and call these stores and ask them if actively hey are actively reviewing applications and are hiring because most times what I've experienced is the world wide phenomenon of being ghosted. I've legit seen the same store have a job posting up several times throughout the year, same store location, which I've applied to each time and I never hear anything back. Anyways small rant over, has anyone actually had success in our day and age of calling stores and actually being hired?  \n\nsincerely, \n\nunemployed and frustrated.", "title": "Doubting that the majority of Job Postings are actually hiring...", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/jobs/comments/1be2ebz/doubting_that_the_majority_of_job_postings_are/"}, {"author": "mohito1999", "author_flair_text": null, "clicked": false, "created_utc": 1710321315.0, "distinguished": null, "edited": false, "id": "1bdn0s5", "is_original_content": false, "is_self": false, "locked": false, "name": "t3_1bdn0s5", "num_comments": 2, "over_18": false, "permalink": "/r/jobs/comments/1bdn0s5/three_strategies_for_getting_the_most_from_your/", "saved": false, "score": 4, "spoiler": false, "stickied": false, "text": "", "title": "Three Strategies For Getting The Most From Your Salary Negotiations", "upvote_ratio": 0.83, "url": "/r/thejobguide/comments/1bdn08x/three_strategies_for_getting_the_most_from_your/"}, {"author": "CombProfessional434", "author_flair_text": null, "clicked": false, "created_utc": 1710293205.0, "distinguished": null, "edited": false, "id": "1bdetkj", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1bdetkj", "num_comments": 5, "over_18": false, "permalink": "/r/jobs/comments/1bdetkj/i_want_to_apologize_but_also_thank_everyone_here/", "saved": false, "score": 4, "spoiler": false, "stickied": false, "text": "It's been a rough unemployment to say the least, but a lot of it has been because of my parents. I get that I'm over 18 and that it's not good to be unemployment, buy I got out of my recent work place because it was driving me into a bad mental state. I explained this to my parents and they are gun ho about me getting a job. Now they are \"suggesting\" for me to do things their way and if I don't do it then \"it's not right\". I'm trying to not mouch off of them at all. I've paid for groceries, help with dishes and I'm willing to pay for rent they haven't talked to me about it though. I just got into a huge argument with my dad tonight because I'm now \"3 months into my unemployment\" and he's \"worried\" it'll turn into way longer. While I appreciate that he's worried this whole \"keep applying the job market is hot and do what your told\" mentality is driving me up a wall. I'm doing what I can I have applied and been getting interviews at least once a week but they \"don't pay the bills\" is what my dad said. I can't even take the car because it's \"his car\" not mine and haven't been able to get one on my own because \"there's no need for you to have your own car if you can share ours\". I feel so stuck and shaken that they treat me like it's my fault I'm not landing a job yet. I mean I get I can always do better, but it's not like I haven't gotten a job due to lack of trying. They are just so \"we need to see results\" mentality. \n\nSo truly from the bottom of my heart I appreciate the love and support from everyone here. I apologize for a lot of my \"woe is me\" posts, but yeah my parents just keep pissing me off about this. While it's unfortunate a lot of us are looking for work it does help so much knowing others are struggling as well. I don't think my dad will ever understand how tough it is to get a job. He's just stuck so much in that boomer mentality and has been able to land jobs because of his outstanding resume.", "title": "I want to apologize but also thank everyone here for the kind words and support through my unemployment ", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/jobs/comments/1bdetkj/i_want_to_apologize_but_also_thank_everyone_here/"}, {"author": "FunkoGamer69", "author_flair_text": null, "clicked": false, "created_utc": 1710357612.0, "distinguished": null, "edited": false, "id": "1be05d9", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1be05d9", "num_comments": 1, "over_18": false, "permalink": "/r/jobs/comments/1be05d9/im_about_to_leave_my_job_d/", "saved": false, "score": 3, "spoiler": false, "stickied": false, "text": "Sitting at my desk right now, accepted an offer for $20k more than I make now and a move up from my current title, nervous to do the 2 weeks talk, any advice? ", "title": "Im about to leave my job :D", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/jobs/comments/1be05d9/im_about_to_leave_my_job_d/"}, {"author": "onlystraight4mothman", "author_flair_text": null, "clicked": false, "created_utc": 1710346329.0, "distinguished": null, "edited": false, "id": "1bdvcqy", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1bdvcqy", "num_comments": 11, "over_18": false, "permalink": "/r/jobs/comments/1bdvcqy/are_indeed_messages_legit/", "saved": false, "score": 3, "spoiler": false, "stickied": false, "text": "I got this message from indeed after applying over a month ago , and when I applied I never found the job listing on Dunkin’s actual website. Ive Never gone through indeed before and have heard people talk about how theyd never actually go through indeed. Please be nice if this is a stupid question lol, I just don’t want to look like an idiot when I go in \n\nhttps://preview.redd.it/j8npe5mml4oc1.jpg?width=1388&format=pjpg&auto=webp&s=1586b982b81b332534eea033b8543620db94bcef", "title": "Are indeed messages legit?", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/jobs/comments/1bdvcqy/are_indeed_messages_legit/"}, {"author": "Diekuz", "author_flair_text": null, "clicked": false, "created_utc": 1710341667.0, "distinguished": null, "edited": false, "id": "1bdtg1p", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1bdtg1p", "num_comments": 1, "over_18": false, "permalink": "/r/jobs/comments/1bdtg1p/when_to_ask_for_update_on_application/", "saved": false, "score": 3, "spoiler": false, "stickied": false, "text": "I interviewed for a corporate role on Feb 29th, and this was the final round interview. I received an update email from the recruiter on the 5th saying that HR is still in process of making decisions and that they anticipate I should hear back within the next week and they would promptly update me through phone or email. They also said in the email that my enthusiasm and qualifications made a positive impression on the team. However, it’s now been over a week since that update email and I still haven’t heard back yet. Should I email asking for an update or wait until the end of the week?", "title": "When to ask for update on application?", "upvote_ratio": 0.81, "url": "https://www.reddit.com/r/jobs/comments/1bdtg1p/when_to_ask_for_update_on_application/"}, {"author": "honest_lou", "author_flair_text": null, "clicked": false, "created_utc": 1710295348.0, "distinguished": null, "edited": false, "id": "1bdflnn", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1bdflnn", "num_comments": 3, "over_18": false, "permalink": "/r/jobs/comments/1bdflnn/i_think_my_boss_wants_to_fire_me_for_requesting/", "saved": false, "score": 2, "spoiler": false, "stickied": false, "text": "My parent is very ill and has a very important surgery coming up. I asked if I could work remote part time to help my family out. However, that was denied and I now have to take LOA and take out my 401k just to survive. Is there a company out there that works well around situations like this. Obviously I couldn’t predict a parent getting as sick as he is. However, I need to work to live and having to choose between my parent and affording a roof over my head is just so heartbreakingly sad. ", "title": "I think my boss wants to fire me for requesting FMLA ", "upvote_ratio": 0.67, "url": "https://www.reddit.com/r/jobs/comments/1bdflnn/i_think_my_boss_wants_to_fire_me_for_requesting/"}, {"author": "Zunaid_Akond", "author_flair_text": null, "clicked": false, "created_utc": 1710293035.0, "distinguished": null, "edited": false, "id": "1bderf7", "is_original_content": false, "is_self": false, "locked": false, "name": "t3_1bderf7", "num_comments": 13, "over_18": false, "permalink": "/r/jobs/comments/1bderf7/is_this_real_i_cant_tell_if_i_should_accept_it/", "saved": false, "score": 3, "spoiler": false, "stickied": false, "text": "The recruiter is from insight global. But a position at Microsoft for $20 hr seems a little low. Which is making me suspicious. Im at an entry level so I’m not complaining but it’s kinda hard to believe this to be real.", "title": "Is this real? I can’t tell if I should accept it.", "upvote_ratio": 0.72, "url": "https://i.redd.it/d1sy2wea70oc1.jpeg"}, {"author": "b1tchmoji", "author_flair_text": null, "clicked": false, "created_utc": 1710291960.0, "distinguished": null, "edited": false, "id": "1bdedi8", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1bdedi8", "num_comments": 7, "over_18": false, "permalink": "/r/jobs/comments/1bdedi8/have_had_4_interviews_with_one_company_for_the/", "saved": false, "score": 3, "spoiler": false, "stickied": false, "text": "hi y’all. i’ve been interviewing with the same company since the beginning of January and just wrapped the 4th and final interview last week. it’s been really stressful waiting and wondering if i’ve gotten it (i need to know kind of soon because i’m looking to move to that area). i’m curious if this is a normal time frame or not? any insight would be appreciated!!", "title": "have had 4 interviews with one company for the past 2 months, is this normal?", "upvote_ratio": 0.81, "url": "https://www.reddit.com/r/jobs/comments/1bdedi8/have_had_4_interviews_with_one_company_for_the/"}, {"author": "MilkxCult", "author_flair_text": null, "clicked": false, "created_utc": 1710288117.0, "distinguished": null, "edited": false, "id": "1bdcxha", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1bdcxha", "num_comments": 6, "over_18": false, "permalink": "/r/jobs/comments/1bdcxha/how_do_you_answer_the_tell_me_about_yourself/", "saved": false, "score": 3, "spoiler": false, "stickied": false, "text": "I am soon going to be having my first job interview at 18 for a sales associate position. The only job I have had before was one that was done alongside my mother. I also have a little bit of volunteer experience from helping with events at a local church. When doing research on how to answer this question almost everything said to tell them your relevant experience and achievements. But i’m not quite sure what experience I have is relevant to the position and i’m a bit scared this could cause me to fail. I know you can mention academic achievements but having been homeschooled my whole life I don’t really have any. No other students to complete with and no clubs = not really much to show. I do have quite a bit of knowledge in regards to the goods they sell due to personal experience. But I don’t think you’re supposed to mention anything to personal. Does anyone have any advice or am I just set up to fail until I get real experience, please help!", "title": "How do you answer the “tell me about yourself question” with little job experience.", "upvote_ratio": 0.81, "url": "https://www.reddit.com/r/jobs/comments/1bdcxha/how_do_you_answer_the_tell_me_about_yourself/"}, {"author": "beeergal", "author_flair_text": null, "clicked": false, "created_utc": 1710366123.0, "distinguished": null, "edited": 1710368423.0, "id": "1be3qci", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1be3qci", "num_comments": 6, "over_18": false, "permalink": "/r/jobs/comments/1be3qci/my_bosss_attitude_towards_me_changed_since_her/", "saved": false, "score": 2, "spoiler": false, "stickied": false, "text": "Let me first start off by saying my boss is a very nice person, gentle and kind.\n\nShe used to LOVE me - she would always shower me with compliments, not just between us but also publicly, and gave me a lot of exposure and opportunities for growth, which I am very grateful for.\n\nThis has changed 180 since her new boss came.\n\nHer new boss, from the moment he joined, wanted to overhaul all existing processes and structures, and naturally this has created some tensions with my boss who has been in the organization for a very long time (She is also a lot older and has way more experience than him)\n\nI am not sure why exactly, but her new boss really took a liking to me and I have been working a lot with him directly recently. And recently, there have been some difficult situations for me e.g. him inviting me to meetings that my boss should usually be invited to, him talking to me directly on tasks skipping my boss, etc.\n\nThree months since my boss's boss joined, my boss no longer wants to give me high-visibility tasks, easily gets annoyed at me, and disagrees with almost everything I say. Today, after he complimented me on a draft of a document that I've been working on, my boss says she will take over from here and finish it herself! (This has never happened to me before.)\n\nFrom the surface, it looks like we get along, but I can tell for sure something has changed.\n\nI don't know how to tackle this situation.  I obviously want to be on good terms with both.\n\nWould appreciate any advice.", "title": "My boss's attitude towards me changed since her new boss started.", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/jobs/comments/1be3qci/my_bosss_attitude_towards_me_changed_since_her/"}, {"author": "BossBoudin", "author_flair_text": null, "clicked": false, "created_utc": 1710365549.0, "distinguished": null, "edited": false, "id": "1be3hpk", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1be3hpk", "num_comments": 1, "over_18": false, "permalink": "/r/jobs/comments/1be3hpk/is_there_a_reason_why_reddit_takes_offense_when/", "saved": false, "score": 3, "spoiler": false, "stickied": false, "text": "Hi all,\n\nI've noticed a trend on Reddit in various employment communities. When I come across posts regarding someone looking for a new job/complaining about their current one and looking for suggestions there will often be quite a few responses recommending the OP pick up a trade (regardless of the OP's background or goals).\n\nHowever, when the OP expresses no such interest in entering the trades, they are then either slammed as being lazy, entitled, afraid of hard work or told to be \"realistic\" implying that the trades are their only viable career options. This has happened to me a few times too.\n\nHonestly why the hostility? So what if someone isn't interested in blue collar work out of the plethora of potential career paths. No need to demean the inquirer. Come up with another idea and actually listen to the OP instead of throwing the half-assed, rubber-stamp answer \"Dude, go pick up a trade!\" or just simply move on after giving free advice.\n\nThere's a good reason for the labor shortage. Its backbreaking, the pay is grossly exaggerated and its actually fairly complex work. Sure you'll always be in-demand but at an enormous cost to your health and well being. Its funny and disheartening to see posters gloat about getting $25-30 an hour as a tradesman. I made more than that as an intern.\n\nTo those who work in trades and actually enjoy the job and are good at it, awesome! Please don't take offense to this post, but also don't take offense when not everyone wants to go down the same path.", "title": "Is there a reason why Reddit takes offense when people reject trade job recommendations?", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/jobs/comments/1be3hpk/is_there_a_reason_why_reddit_takes_offense_when/"}, {"author": "Agretfethr", "author_flair_text": null, "clicked": false, "created_utc": 1710361629.0, "distinguished": null, "edited": false, "id": "1be1u3l", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1be1u3l", "num_comments": 0, "over_18": false, "permalink": "/r/jobs/comments/1be1u3l/are_there_certain_days_job_recruitersspam/", "saved": false, "score": 2, "spoiler": false, "stickied": false, "text": "I have to know if anyone else is or has been experiencing this? I usually get maybe 4 or less recruiters calling during the week, but in a span of 6 hours, I have had a little under 30 calls, some happening within seconds of each other from different recruiters. I cannot answer my phone at work since we are quite busy, and I had to set up a decline quick message to tell everyone to just email instead. Job searching has been so sketchy and stressful lately and this has been quite a day.. anyone else? Bonus points if today has been a big recruiter day for you", "title": "Are there certain days job recruiters/spam recruiters coordinate or choose to call? 28 calls today and counting ", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/jobs/comments/1be1u3l/are_there_certain_days_job_recruitersspam/"}, {"author": "TiittySprinkles", "author_flair_text": null, "clicked": false, "created_utc": 1710359122.0, "distinguished": null, "edited": 1710359761.0, "id": "1be0s8s", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1be0s8s", "num_comments": 1, "over_18": false, "permalink": "/r/jobs/comments/1be0s8s/is_it_appropriate_to_use_the_supervisor_of_the/", "saved": false, "score": 2, "spoiler": false, "stickied": false, "text": "So I'm applying for a new job at a new employer, but the supervisor of this new role is a former supervisor of mine from a previous organization we both worked at together. We have both moved on to different orgs since working directly together nearly 4 years ago.\n\nWe have maintained a professional working relationship and interacted frequently since our time at the previous company in both of our current roles.\n\nHas anyone ever had this experience or should I just forget the idea and find a different reference?\n\nI'm wracking my brain trying to identify a 3rd reference that is relevant to the years of experience I have gained as well as the sector we now both work in, as I definitely don't want to use any supervisor in my current role to tip them off that I am interviewing elsewhere.", "title": "Is it appropriate to use the supervisor of the position you are applying for as a reference?", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/jobs/comments/1be0s8s/is_it_appropriate_to_use_the_supervisor_of_the/"}, {"author": "throwra-hgsgsadf", "author_flair_text": null, "clicked": false, "created_utc": 1710358194.0, "distinguished": null, "edited": false, "id": "1be0dym", "is_original_content": false, "is_self": false, "locked": false, "name": "t3_1be0dym", "num_comments": 4, "over_18": false, "permalink": "/r/jobs/comments/1be0dym/got_my_cissp_end_of_feb_11_offers_after_only_3/", "saved": false, "score": 4, "spoiler": false, "stickied": false, "text": "", "title": "Got My CISSP End of Feb - 11 Offers After Only 3 Weeks!!!", "upvote_ratio": 0.83, "url": "https://i.redd.it/rz9724dak5oc1.png"}, {"author": "anxious-squirrelgrl", "author_flair_text": null, "clicked": false, "created_utc": 1710356856.0, "distinguished": null, "edited": false, "id": "1bdzu69", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1bdzu69", "num_comments": 4, "over_18": false, "permalink": "/r/jobs/comments/1bdzu69/need_help_figuring_out_how_i_can_get_a_job/", "saved": false, "score": 2, "spoiler": false, "stickied": false, "text": "\nHello! I am currently a SAHM. I have one child who is three years old. My husband works usually 11am-11pm Wednesday-Sunday with the occasional 7am-5pm day thrown in. My child is not yet potty trained and I do not have my license but I do have my temporary license and I am currently taking driving lessons with an instructor.\n\n I am at a loss of what I can do to make money until my child is potty trained so that he can go to preschool and until I get my license. My husband gets two days off of work which are Monday and Tuesday and those are the only days we have to get anything done such as doctors appointments and running errands. Does anyone have any ideas of what I can do and how I could fit at least a part time job into this situation?? I am desperately needing some advice. Thank you so much. ", "title": "Need help figuring out how I can get a job!! ", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/jobs/comments/1bdzu69/need_help_figuring_out_how_i_can_get_a_job/"}, {"author": "lilkitty28", "author_flair_text": null, "clicked": false, "created_utc": 1710356150.0, "distinguished": null, "edited": false, "id": "1bdzjhf", "is_original_content": false, "is_self": false, "locked": false, "name": "t3_1bdzjhf", "num_comments": 3, "over_18": false, "permalink": "/r/jobs/comments/1bdzjhf/sketchy_hiring_practices/", "saved": false, "score": 2, "spoiler": false, "stickied": false, "text": "", "title": "Sketchy hiring practices?", "upvote_ratio": 1.0, "url": "https://i.redd.it/u7ni3aqje5oc1.jpeg"}, {"author": "yeahyeahyeah_okay", "author_flair_text": null, "clicked": false, "created_utc": 1710355230.0, "distinguished": null, "edited": false, "id": "1bdz518", "is_original_content": false, "is_self": false, "locked": false, "name": "t3_1bdz518", "num_comments": 1, "over_18": false, "permalink": "/r/jobs/comments/1bdz518/my_job_search_done_for_now/", "saved": false, "score": 2, "spoiler": false, "stickied": false, "text": "Wanted to share my job search with everyone here. Long story short, I got a job finally! It's not a job I wanted to do but it's a job I have for now. The position feels like a few steps back from my previous roles as it pays a lot less and the hours are not favorable. I had heard the term \"bridge job\" and I have accepted that this is probably what it is going to be. I had a someone refer me so I will stay as long as they get their incentive and continue searching elsewhere in hopes of a better position. I know I am not going to love working this job but I’m going to have to push through.\n\nI am not trying to complain about having a job after searching but dang this market sucks and I have to just...settle for far less than I know I am capable of. I'm sure a lot of us are in that position as well. The other job on the graph that I got a second round interview for was the one I really wanted and I am pretty upset I didn't get it. At the end of the day, I have something to pay the bills and hopefully this will make me look better for future applications.\n\nI wish the best of luck to everyone out there and I can only hope this market improves. I have decided am going back to school (again) after this experience as well. (sorry if the graph is a little confusing I have never used it but I thought it was a good tool!)\n", "title": "My Job Search (Done for now)", "upvote_ratio": 0.76, "url": "https://i.redd.it/d5xna158c5oc1.jpeg"}, {"author": "AnxiousGalore", "author_flair_text": null, "clicked": false, "created_utc": 1710350082.0, "distinguished": null, "edited": false, "id": "1bdwxrh", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1bdwxrh", "num_comments": 1, "over_18": false, "permalink": "/r/jobs/comments/1bdwxrh/what_to_do_during_the_first_few_weeks_of_a_new_job/", "saved": false, "score": 2, "spoiler": false, "stickied": false, "text": "I recently went through an internal transfer (my choice) to another team as a Finance Manager. It’s Week 2 and so far, I haven’t really done much other than watch training videos. My supervisor is often in meetings all day so we’ve only had a few sessions where she’s walked me through different processes. But I haven’t done any actual work related to my role and haven’t really sat in meetings. I’m slowly being included on emails (which I don’t understand lol) which is nice. \n\nShould I be patient and enjoy this time as I slowly learn more about the business and role? I have been told that due to the unique business model, the learning curve is steep and it’s best not to get information overload. ", "title": "What to do during the first few weeks of a new job?", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/jobs/comments/1bdwxrh/what_to_do_during_the_first_few_weeks_of_a_new_job/"}, {"author": "fluffyhowler5972", "author_flair_text": null, "clicked": false, "created_utc": 1710345219.0, "distinguished": null, "edited": false, "id": "1bduwd4", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1bduwd4", "num_comments": 2, "over_18": false, "permalink": "/r/jobs/comments/1bduwd4/most_difficult_question/", "saved": false, "score": 2, "spoiler": false, "stickied": false, "text": "Please anyone who is a manager or something like that what should i say when i am asked why do you want this job because i am always fighting the urge to say to them like they are a child \"because i don't have a job and i need money to live\"?", "title": "Most Difficult Question", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/jobs/comments/1bduwd4/most_difficult_question/"}, {"author": "okayd11", "author_flair_text": null, "clicked": false, "created_utc": 1710344903.0, "distinguished": null, "edited": false, "id": "1bdurti", "is_original_content": false, "is_self": false, "locked": false, "name": "t3_1bdurti", "num_comments": 8, "over_18": false, "permalink": "/r/jobs/comments/1bdurti/can_i_answer_no_to_this_question_about_sponsorship/", "saved": false, "score": 2, "spoiler": false, "stickied": false, "text": "I am an international student graduating in May. I am eligible for STEM OPT(3 years), so I would only require sponsorship three years later. Since the question asks “in the near future”, can I answer no? Do I need to explain further about the situation in the email?", "title": "Can I answer no to this question about sponsorship", "upvote_ratio": 0.61, "url": "https://i.redd.it/sd9es9nih4oc1.jpeg"}, {"author": "ToastWJam32", "author_flair_text": null, "clicked": false, "created_utc": 1710333319.0, "distinguished": null, "edited": false, "id": "1bdqdia", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1bdqdia", "num_comments": 13, "over_18": false, "permalink": "/r/jobs/comments/1bdqdia/how_to_handle_interviews_while_you_know_youre/", "saved": false, "score": 2, "spoiler": false, "stickied": false, "text": "I keep getting interview requests where people write that they are \"extremely impressed with my skills and my experience\", that they \"all really enjoyed reading my application\", that I wouldn't need any training, etc.. Then, within the first 5 minutes of the zoom interview, I can tell that they aren't interested in me. They almost seem to have been expecting someone else when they first sign on. One even told me in the first 5 minutes that perhaps this wouldn't be a good fit for me and had begun taking back some of the job duties they had described in the posting (work that I am very experienced in). \"Well, come to think of it, we probably won't end up using this (skill), so if you were hoping to be able to do this...\"\n\nI'm an URM but also am not very attractive to some people. I feel fairly certain that I am being discriminated against by some of these individuals...Be it race or level of attractiveness, I do not know. Is there anything I can do to improve my chances? I'm already wearing a blazer and wearing my hair down, straightened. I definitely am qualified for many of these positions that I am applying for and earned my degree from a well-known, reputable university.", "title": "How to handle interviews while you know you're easily discriminated against in interviews?", "upvote_ratio": 0.67, "url": "https://www.reddit.com/r/jobs/comments/1bdqdia/how_to_handle_interviews_while_you_know_youre/"}, {"author": "EnvironmentalBid2676", "author_flair_text": null, "clicked": false, "created_utc": 1710333295.0, "distinguished": null, "edited": false, "id": "1bdqd77", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1bdqd77", "num_comments": 0, "over_18": false, "permalink": "/r/jobs/comments/1bdqd77/looking_for_a_job_in_canada/", "saved": false, "score": 2, "spoiler": false, "stickied": false, "text": "Appiled like more than 100 places no response trying to get one for 3 months anyone knows or can refer please dm me", "title": "Looking for a job in canada", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/jobs/comments/1bdqd77/looking_for_a_job_in_canada/"}, {"author": "aldp101", "author_flair_text": null, "clicked": false, "created_utc": 1710329528.0, "distinguished": null, "edited": false, "id": "1bdp7r9", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1bdp7r9", "num_comments": 3, "over_18": false, "permalink": "/r/jobs/comments/1bdp7r9/did_i_not_get_the_job/", "saved": false, "score": 2, "spoiler": false, "stickied": false, "text": "I made it to the final interview and have been waiting to hear back for only about 3 days now. I saw someone post on linkedin that they got the job I applied for.. so is it safe to assume I didn’t get it? Really love how they ghosted me if so lmao\n", "title": "Did I not get the job?", "upvote_ratio": 0.76, "url": "https://www.reddit.com/r/jobs/comments/1bdp7r9/did_i_not_get_the_job/"}, {"author": "Nic727", "author_flair_text": null, "clicked": false, "created_utc": 1710325068.0, "distinguished": null, "edited": false, "id": "1bdo005", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1bdo005", "num_comments": 3, "over_18": false, "permalink": "/r/jobs/comments/1bdo005/i_should_be_renamed_mr_bad_luck/", "saved": false, "score": 2, "spoiler": false, "stickied": false, "text": "Ok, so after almost a year of research and no results, I decided last month to apply to volunteer for a NGO I’m following for years and being friend with the founder. Just to get experience you know.\n\nYesterday I wanted some news because result should have been published this week.\n\nThey write back saying they never received my application.\n\nI’m so desperate now. Will need to go back to school and change field, but I have no idea what to do.\n- Archaeology = No job perspective \n- Biology = I suck at Maths and Science. Failed 2 times already.\n- Manual jobs = I hate that\n\nI want to cry 😭", "title": "I should be renamed Mr. Bad Luck", "upvote_ratio": 0.67, "url": "https://www.reddit.com/r/jobs/comments/1bdo005/i_should_be_renamed_mr_bad_luck/"}, {"author": "tflyvt", "author_flair_text": null, "clicked": false, "created_utc": 1710320813.0, "distinguished": null, "edited": 1710322204.0, "id": "1bdmwl5", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1bdmwl5", "num_comments": 1, "over_18": false, "permalink": "/r/jobs/comments/1bdmwl5/different_situation_than_most/", "saved": false, "score": 2, "spoiler": false, "stickied": false, "text": "I just wanted to make this post because this sub is almost entirely negative and depression inducing. I am a little different than most, with a different skillset, and different work/education/experience history. Anyway, I am currently at the end of a working holiday in Australia, after the first few months here (working for my 88days) I struggled extremely badly to find a job, spent months applying to hundreds of jobs and only got one interview, ended up depleting my savings and finally getting a part time offer through my roommate of dishwashing at a local restaurant. Looking at this sub combined with my own experience here in Australia scared me quite a bit for returning to the US, and took out alot of my motivation and drive. But I buckled down and spent the last 2 months applying to almost 50 jobs back in the US (all backcountry guiding positions in the Rocky Mountains) and after a month I had zero responses, not even rejections or interviews, just ghosted. I changed my resume, got an additional reference after a long phone call with an old boss, and started calling places/people back multiple times being a bit more aggressive in my search. In the past week I’ve had 7 interviews. Today, I finally got my dream offer of backcountry horse pack trip/fly fishing guide (I know a mouthful).\n\nTLDR; don’t give up hope, and if things aren’t working try changing things up, and being more aggressive, things suck and its really difficult to find a job right now but it is possible. \n\nAnyway this post may seem useless, but If I had seen this post 2 months ago it may have saved me alot of stress.", "title": "Different situation than most", "upvote_ratio": 0.76, "url": "https://www.reddit.com/r/jobs/comments/1bdmwl5/different_situation_than_most/"}, {"author": "spolarium3829", "author_flair_text": null, "clicked": false, "created_utc": 1710315905.0, "distinguished": null, "edited": 1710316292.0, "id": "1bdlriw", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1bdlriw", "num_comments": 4, "over_18": false, "permalink": "/r/jobs/comments/1bdlriw/recently_hired_at_a_hybrid_job_but_my_boss_and/", "saved": false, "score": 2, "spoiler": false, "stickied": false, "text": "I recently got hired for a hybrid role with the expectation to go into the office two to three times a week, depending on teams/departments. This was mentioned during my interview process and in the employee handbook - I interviewed with a handful of people, mostly senior leads, based in different cities but didn't know who my direct team was going to be so HR asked that I ask my direct team on my first day on their expectation for how often I should come into the office. (For context, my job is project based so teams depend entirely on project needs)\n\nCool. I'm fine with hybrid.\n\nOn my first day, I find out that my manager and direct teammates are all based in a different city than I am. I live in the west coast and they're all in the east coast. When we had our introductory meeting today, all of them were in the same physical conference room while I was miles away via a Zoom call. It was pretty awkward just having me alone on screen vs. all of them together.\n\nWhen I asked my manager the expectation of how often to go into the office, she said 3x a week and that it's mandatory.\n\nIt totally does not make sense for me to go into that office that frequently when I have zero teammates to collaborate and communicate with. I don't mind the time difference as I'm used to working EST, but the mandatory approach just doesn't make sense. \n\nSince my manager is not in my office, I'm not sure how they'll manage to track and enforce how many times I'd come in. But anyone here had the same problem and how they deal with it? Again, I have no issues with going in, my issue lies with it being required when I just take all my meetings via Zoom that can also be done when I'm at home...", "title": "Recently hired at a hybrid job but my boss and teammates are based in a different city so there's no point in me coming to the office.", "upvote_ratio": 0.67, "url": "https://www.reddit.com/r/jobs/comments/1bdlriw/recently_hired_at_a_hybrid_job_but_my_boss_and/"}, {"author": "imandotjpg", "author_flair_text": null, "clicked": false, "created_utc": 1710314843.0, "distinguished": null, "edited": false, "id": "1bdlitu", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1bdlitu", "num_comments": 4, "over_18": false, "permalink": "/r/jobs/comments/1bdlitu/im_nearing_29_and_have_been_a_sahm_all_my_adult/", "saved": false, "score": 1, "spoiler": false, "stickied": false, "text": "Hello everyone! As the title says I am nearing 29 years of age. I am a female and I haven't really had a job apart from a cafe job at 17, some small jobs as caretaker for disabled people at around age 20. \n\nI have been a SAHM since I was 21 apart from studying some college subjects. I am now doing my last subject before applying for an actual college degree in social work which will take 3 years, meaning I will be more than 30 when I graduate. Am I employable? Would anyone actually hire me with my pretty much non existent work history?  ", "title": "I'm nearing 29 and have been a SAHM all my adult life. ", "upvote_ratio": 0.56, "url": "https://www.reddit.com/r/jobs/comments/1bdlitu/im_nearing_29_and_have_been_a_sahm_all_my_adult/"}, {"author": "Lefthippy", "author_flair_text": null, "clicked": false, "created_utc": 1710310103.0, "distinguished": null, "edited": false, "id": "1bdkcjz", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1bdkcjz", "num_comments": 2, "over_18": false, "permalink": "/r/jobs/comments/1bdkcjz/i_want_to_quit_my_job_so_badly_because_of_my_boss/", "saved": false, "score": 2, "spoiler": false, "stickied": false, "text": "Hello everyone, \n\nI recently graduated from University back in May. I was applying to a lot of jobs and finally ended up with the job that I have now. Its basically like a Communications Coordinator position where I make flyers, attend events, record and capture footage from events, manage company social media channels, etc. This jobs has NO benefits either but I get paid decent for a recent graduate. \n\nAt first, I enjoyed my job. It was pretty cool. Overtime, my boss has been micromanaging  me and always gives his two sense with whatever I do. As time went on, he cut my hours due to the holidays and that messed me up financially for a bit. I just recently started getting my hours back but like I said, my boss has been micromanaging me and always has something to say about my work. \n\nHe recently threatened to fire me because “I don’t know what good works looks like” and he told me that I have a “do not care” attitude. I have been doing everything he’s told me to do and even people who I run into at events say that they love what I’m doing with the companies social media page with the flyers, posts, etc. \n\n\nI really want to quit and find another job with benefits and that pays more but this job market right now SUCKS. I talked to my buddies and they said “i should take a risk and quit. Don’t let your boss affect your mental health”. I agree with them but at the same time I need money due to bills. Maybe I should doordash or uber eats until I find a new job? Idk. Any advice would be nice! Thanks. ", "title": "I want to quit my job so badly because of my boss", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/jobs/comments/1bdkcjz/i_want_to_quit_my_job_so_badly_because_of_my_boss/"}, {"author": "Sean_Permana", "author_flair_text": null, "clicked": false, "created_utc": 1710302847.0, "distinguished": null, "edited": false, "id": "1bdi949", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1bdi949", "num_comments": 5, "over_18": false, "permalink": "/r/jobs/comments/1bdi949/instant_freaking_job_interview_process_is_this_a/", "saved": false, "score": 2, "spoiler": false, "stickied": false, "text": " A few weeks ago, I had a job interview for admin job position and the place was very suspicious as hell.\n\nThe interview room contains few people despite their claim that they have multiple branches, and 2 desks and chairs, not even a single computer and paper on desk.\n\nAnd here comes the suspicious part, they say that **one of the employee will escort me to a hospital that worked with them to do the medical checkup, and if I'm free of drug and follow psycho test, I can start working tomorrow**. After hearing that, I make a bullshit by saying I'll take the medical checkup tomorrow because I'm busy soon and they say, **\"If you do it tomorrow, someone will fill the position tomorrow!\"**. And I still want to \"do it tomorrow\"(Again, still bullshitting, not gonna do it), GTFO and never come back.\n\nHell no, what kind of instant job interview process is that? Doesn't help the medical checkup crap sounds very suspicious.\n\n2 days ago, got a job interview for english translator position, and again, **they say that I can start working in next 2 days, if I make my decision that night because it's an urgent stuff**.\n\nHell fuckin no, I'm NOT gonna fall into the same hole again. It doesn't help the company website is very basic. Few words, not even a single picture.\n\nAnd yes, I decline quietly by not responding them, especially the former which I also block their contact. I'm tired of these instant freaking job interview processes, I hope they stub their toe on the corner of a table and receive endless pain someday.\n\nSo, what do you think folks? Are these a sign of red flags?", "title": "Instant freaking job interview process. Is this a huge red flag and scam?", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/jobs/comments/1bdi949/instant_freaking_job_interview_process_is_this_a/"}, {"author": "Ilikehugemen", "author_flair_text": null, "clicked": false, "created_utc": 1710294519.0, "distinguished": null, "edited": false, "id": "1bdfam5", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1bdfam5", "num_comments": 2, "over_18": false, "permalink": "/r/jobs/comments/1bdfam5/references_for_people_who_havent_worked/", "saved": false, "score": 2, "spoiler": false, "stickied": false, "text": "What are some good references that you can have to put down on a job application if you aint work before?", "title": "References for people who havent worked", "upvote_ratio": 0.76, "url": "https://www.reddit.com/r/jobs/comments/1bdfam5/references_for_people_who_havent_worked/"}, {"author": "LifeOfSpirit17", "author_flair_text": null, "clicked": false, "created_utc": 1710291053.0, "distinguished": null, "edited": 1710294288.0, "id": "1bde1ly", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1bde1ly", "num_comments": 5, "over_18": false, "permalink": "/r/jobs/comments/1bde1ly/how_to_verbally_respond_to_negative_feedback/", "saved": false, "score": 2, "spoiler": false, "stickied": false, "text": "I have a review coming up this week. I caught a glimpse of some of the HR notes so I know what's coming. I don't fully agree with the notes, but I need my job, so I'm trying to prepare how to respond so I don't say something stupid. \n\nHow do you respond verbally to negative feedback? I want to try to sound authentic and not just generic. \n\nLooking for a script or the words to use. \n\nAny tips are greatly appreciated. ", "title": "How to verbally respond to negative feedback?", "upvote_ratio": 0.76, "url": "https://www.reddit.com/r/jobs/comments/1bde1ly/how_to_verbally_respond_to_negative_feedback/"}, {"author": "imjust_here_", "author_flair_text": null, "clicked": false, "created_utc": 1710287470.0, "distinguished": null, "edited": false, "id": "1bdco83", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1bdco83", "num_comments": 2, "over_18": false, "permalink": "/r/jobs/comments/1bdco83/do_i_have_a_toxic_boss_or_am_i_just_sensitive_and/", "saved": false, "score": 2, "spoiler": false, "stickied": false, "text": "So, for background I work in sales and marketing in a budding industry (literally, it’s the legal cannabis market). I’ve been at my job for almost a year. When I first got brought on, I grew our account list by 40% and was hitting 6 figures in sales for my first 4 months. \n\nI do all statewide wholesale sales, social media management and content creation, manage our field marketer, and handle marketing campaigns/concepts. Funny thing is, I don’t even have a management title. \n\nAfter my first 4 months, we lost our head grower and our product quality tanked but our prices stayed the same. 4 months after that, we have another new grower. In the year I’ve been here we haven’t put out a consistent product for more than 3-4 months and have had 4 different people growing our product. \n\nMy boss has begun to micromanage me, and tell me I lack substance and don’t bring enough brain storming on how to increase sales to the table anymore. I’ve been trying to sell low quality product, for a top shelf price. The market has gotten really volatile and my boss has no interest in anything I say. I’ve been begging for months for pricing to get dropped and today he finally said he would do it, after calling out my performance in front of the team. Mind you, he hasn’t been present for a sales meeting in 4 weeks. This is a company that offers one product, and has only offered the same 6 strains of that one product for 2.5 years. There are only so many sales campaigns one can come up with while working with such a small product line. \n\nFrom my POV you need 4 things to have a successful sales person - 1. A consistent, quality product that keeps people coming back and good branding. 2. A price point that people are willing to pay, that aligns with the quality of the product. 3. A good engaged sales person who is seeking out new business and maintaining relationships. 4. A closer. It doesn’t matter how good your sales person is, if the first two aren’t in check it’s a set up for failure and those first two things are things not in my control. \n\nI am so burnt out doing multiple people’s jobs and working for someone who is putting millions of dollars into expanding a company that can’t even produce a consistent product and putting the stress of the success of his business on the shoulders of someone who A. Doesn’t have a management title. B. Has been doing multiple jobs on one salary for almost a year. C. The company doesn’t provide good health insurance, commission structure, company stocks. None of that. \n\nApparently our drop in sales has nothing to do with quality, or pricing (which is crazy cuz it’s weed, those are the only things that matter when someone is buying weed) and all to do with my “lack of substance”. I’ve shown him data on why we need to make changes and he hasn’t listened. He doesn’t have a sales or cannabis background, just saw this as an opportunity to make money. \n\nMy performance my first 4 months I clear I can do this job, I haven’t changed the way I do my job all that has changed are things out of my control. Working as a 100% sales person for someone who doesn’t even have a sales background has sucked the life out of me. Being the one person team responsible for bringing in revenue for an entire company and being told it’s all my fault and leadership taking no accountability for what has changed that is out of my control…\n\nAm I sensitive or am I in a toxic workplace, under a toxic CEO and should continue planning my exit? ", "title": "Do I have a toxic boss or am I just sensitive and burnt out?", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/jobs/comments/1bdco83/do_i_have_a_toxic_boss_or_am_i_just_sensitive_and/"}, {"author": "u-r-byootiful", "author_flair_text": null, "clicked": false, "created_utc": 1710284461.0, "distinguished": null, "edited": false, "id": "1bdbgwr", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1bdbgwr", "num_comments": 1, "over_18": false, "permalink": "/r/jobs/comments/1bdbgwr/job_suggestions/", "saved": false, "score": 2, "spoiler": false, "stickied": false, "text": "My husband, was laid off five months ago (not fired but who got laid off was incredibly political, of course). He was VP of operations for a company of about 1,000 employees.\n\nHe’s in a very obscure industry that is in a downturn currently (it will never be obsolete and will rebound eventually). He seems to be holding out for a comparable job to happen. It’s not gonna happen right now, and changing industries isn’t as easy as people think.\n\nIt is time that he just take a job to bring home money; we have multiple kids in college. Any suggestions for jobs that are plentiful and easy to get? They don’t have to be fancy or lucrative. At this point a paycheck—any paycheck—would be nice.", "title": "Job Suggestions", "upvote_ratio": 0.75, "url": "https://www.reddit.com/r/jobs/comments/1bdbgwr/job_suggestions/"}, {"author": "imafraidofoil", "author_flair_text": null, "clicked": false, "created_utc": 1710281886.0, "distinguished": null, "edited": false, "id": "1bdaf8q", "is_original_content": false, "is_self": false, "locked": false, "name": "t3_1bdaf8q", "num_comments": 5, "over_18": false, "permalink": "/r/jobs/comments/1bdaf8q/am_i_getting_fired_working_for_small_business/", "saved": false, "score": 2, "spoiler": false, "stickied": false, "text": "context: working for a small business with two owners who used to only hire their friends until me and one other person reached out to them. we both received this email today without any notice. it seems vague and i can’t tell if they’re just, not having me work for the rest of the month or being spineless about firing me ", "title": "Am I getting fired? (working for small business)", "upvote_ratio": 0.75, "url": "https://i.redd.it/9m91s8v4aznc1.jpeg"}, {"author": "Apprehensive-Ebb6002", "author_flair_text": null, "clicked": false, "created_utc": 1710367365.0, "distinguished": null, "edited": false, "id": "1be4973", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1be4973", "num_comments": 0, "over_18": false, "permalink": "/r/jobs/comments/1be4973/do_internships_tend_to_take_longer_to_hear_back/", "saved": false, "score": 1, "spoiler": false, "stickied": false, "text": "hi! I had my first interview about a month ago and a final round interview exactly two weeks ago.\n\nthe job posting barely closed around the time of my final interview which all felt great. i'm sorta assuming that they might be interviewing other people and normal jobs just want to fill the position asap - ish but I also did a followup a few days ago with no response. \n\ni hate waiting lol but ig im gonna keep applying in the meantime...", "title": "Do internships tend to take longer to hear back from(than normal job openings)", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/jobs/comments/1be4973/do_internships_tend_to_take_longer_to_hear_back/"}, {"author": "Banananickle", "author_flair_text": null, "clicked": false, "created_utc": 1710366900.0, "distinguished": null, "edited": false, "id": "1be420c", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1be420c", "num_comments": 0, "over_18": false, "permalink": "/r/jobs/comments/1be420c/how_long_does_a_company_take_to_let_you_know_if/", "saved": false, "score": 1, "spoiler": false, "stickied": false, "text": "For some context, I am currently a third year business major that has had 4 interviews so far, 2 of them I did not make it past the first round and the other two I am still waiting on. For this one company I had a first round interview for, the proctor said I did great and that she really liked my interview skills and the way I answered my questions. Thats good right? Then she said that I will hear back in a week to a week and a half about whether I made it to the second round or not.\n\nThis first round interview took place on 2/29 and its about to be two weeks since I interviewed them. Should I be worried at this point? I sent a follow-up interview to the recruiter yesterday but she has not gotten back to me yet. If they would tell me I wouldn't make it to the second round, wouldn't they already done so? \n\nIm just very anxious about this because I really want an internship this summer and I felt like this company would be an extremeley good fit for me, I just want to know if I made it to the second round or not. ", "title": "How Long Does a Company Take to Let You Know if You Made it to the 2nd Round Interview?", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/jobs/comments/1be420c/how_long_does_a_company_take_to_let_you_know_if/"}, {"author": "nicotinepercocet", "author_flair_text": null, "clicked": false, "created_utc": 1710366644.0, "distinguished": null, "edited": false, "id": "1be3y6b", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1be3y6b", "num_comments": 2, "over_18": false, "permalink": "/r/jobs/comments/1be3y6b/reference_check_after_final_interview_is_this/", "saved": false, "score": 1, "spoiler": false, "stickied": false, "text": "This is for a technical internship. I did the final interview at 11am, got the request at around 6pm for drug screen and background check authorization, 5 references, citizenship, and conflict of employment form, and they said to send it back ASAP which I did. From what I know, they said they still had a couple others to interview(like 2 ppl), but this seems pretty intense for it not to be indicative of an offer right? I made sure my references knew and consented to being contacted, so I doubt they'll say anything too bad. However, I am SO anxious because i really really want this role, I haven't been this excited about working with any other company. Does anyone have an idea of how long it'll take for me to hear back? I want to stop checking my email lol. ", "title": "Reference check after final interview - is this related to an offer? plz help", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/jobs/comments/1be3y6b/reference_check_after_final_interview_is_this/"}, {"author": "Revolutionary000001", "author_flair_text": null, "clicked": false, "created_utc": 1710366464.0, "distinguished": null, "edited": false, "id": "1be3vhh", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1be3vhh", "num_comments": 0, "over_18": false, "permalink": "/r/jobs/comments/1be3vhh/first_ever_interview/", "saved": false, "score": 1, "spoiler": false, "stickied": false, "text": "Currently a high school junior, and I got an interview in 2 days for a shift lead. Never previously had a job before, but do have several leadership positions in school, so hopefully that is ok. Any tips on how to get the job? Thanks.", "title": "First Ever Interview", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/jobs/comments/1be3vhh/first_ever_interview/"}, {"author": "FaceAffectionate7572", "author_flair_text": null, "clicked": false, "created_utc": 1710366220.0, "distinguished": null, "edited": false, "id": "1be3rs4", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1be3rs4", "num_comments": 1, "over_18": false, "permalink": "/r/jobs/comments/1be3rs4/i_think_my_job_is_retaliating_against_me_for/", "saved": false, "score": 1, "spoiler": false, "stickied": false, "text": "I asked for paternity leave and exactly 2 days later I get written up for the first time for not “closing right” my manager claims he told me to clean a specific part of a hallway which I don’t ever remember him telling me to do. I thought I was fine to leave and left supposedly not cleaning that part of the hallway well enough.  Therefore, I got a written warning for insubordination and not working hard enough. Until this, Iv never once been told I was closing wrong or didn’t complete something.  Iv also never gotten in trouble once or even gotten a verbal warning before. I was told if I get written up again I’ll get suspended/fired. I’m scared I can’t afford to lose this job.", "title": "I think my job is retaliating against me for asking for paternity leave ", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/jobs/comments/1be3rs4/i_think_my_job_is_retaliating_against_me_for/"}, {"author": "Turbulent_Hornet_802", "author_flair_text": null, "clicked": false, "created_utc": 1710364212.0, "distinguished": null, "edited": false, "id": "1be2x1e", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1be2x1e", "num_comments": 0, "over_18": false, "permalink": "/r/jobs/comments/1be2x1e/does_jpm_asset_wealth_management_private_bank/", "saved": false, "score": 1, "spoiler": false, "stickied": false, "text": "I am an international student with STEM OPT interested in asset management. Could anyone provide insight on whether JP Morgan provide sponsorship to international students", "title": "Does JPM Asset & Wealth management Private bank offers h1b sponsorship", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/jobs/comments/1be2x1e/does_jpm_asset_wealth_management_private_bank/"}, {"author": "lilbakeshop", "author_flair_text": null, "clicked": false, "created_utc": 1710363620.0, "distinguished": null, "edited": false, "id": "1be2ntx", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1be2ntx", "num_comments": 6, "over_18": false, "permalink": "/r/jobs/comments/1be2ntx/a_potential_dream_job_just_contacted_me_when_i/", "saved": false, "score": 1, "spoiler": false, "stickied": false, "text": "HELP they want to know if im interested and i am because money but i like my job now GOOD GOD", "title": "a potential dream job just contacted me when i now have a part time job that i just started a few weeks ago", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/jobs/comments/1be2ntx/a_potential_dream_job_just_contacted_me_when_i/"}, {"author": "gridtunnel", "author_flair_text": null, "clicked": false, "created_utc": 1710363212.0, "distinguished": null, "edited": false, "id": "1be2htq", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1be2htq", "num_comments": 1, "over_18": false, "permalink": "/r/jobs/comments/1be2htq/what_is_the_highest_experience_requirement_youve/", "saved": false, "score": 1, "spoiler": false, "stickied": false, "text": "I think the highest I've seen was around 10 years of experience, but it's been a while since I've looked in earnest.", "title": "What is the highest experience requirement you've ever seen on a job posting?", "upvote_ratio": 0.67, "url": "https://www.reddit.com/r/jobs/comments/1be2htq/what_is_the_highest_experience_requirement_youve/"}, {"author": "mochi-meido", "author_flair_text": null, "clicked": false, "created_utc": 1710363204.0, "distinguished": null, "edited": false, "id": "1be2hpi", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1be2hpi", "num_comments": 0, "over_18": false, "permalink": "/r/jobs/comments/1be2hpi/i_got_put_on_a_plan/", "saved": false, "score": 1, "spoiler": false, "stickied": false, "text": "Hi all. My morale and motivation is pretty low because I got put on a “success plan” at work this week.\n\nI’m a customer support agent, and so of course there are certain metrics they want us to hit. Our median handling time is supposed to be 6 minutes on email cases, and 12 on phones (which includes talk time, hold time, and any wrap-up tasks).\n\nTo me, these metrics feel unrealistic. I’ve been with the company for over a year now and have worked really hard to improve my handling times, and I feel like I’m working as quickly as I can and using all the strategies and taking hits to my mental health but I’m still a minute or two too slow most weeks. I could maybe go faster on emails if I didn’t put as much effort and care as I do into answering questions but I don’t want my quality score to take a hit as a result. Phones are hard to control because some customers just talk a lot.\n\nIn addition, the questions we’re answering are often complex and require thorough research to find an answer or a solution.\n\nIt’s also affecting my ability to get promoted, get a raise, apply for roles in other departments, or take on professional development side projects. \n\nI know I’m a good worker and a hard worker but not meeting these targets makes me feel like a failure, and I’m scared of losing my job. \n\nI want to apply elsewhere but I’ve worked in customer support for almost 7 years and I’m not sure how to break away from it.\n\nHas anyone else ever been put on a plan at work? Were you able to improve?", "title": "I got put on a “plan”", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/jobs/comments/1be2hpi/i_got_put_on_a_plan/"}, {"author": "Zealousideal-Cow6626", "author_flair_text": null, "clicked": false, "created_utc": 1710362359.0, "distinguished": null, "edited": false, "id": "1be24yh", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1be24yh", "num_comments": 0, "over_18": false, "permalink": "/r/jobs/comments/1be24yh/how_can_i_negotiate_the_salary_for_an_internal/", "saved": false, "score": 1, "spoiler": false, "stickied": false, "text": " \n\nHi all! I recently just got off the phone with my manager and got a promotion with a 10% increase. I am very thrilled because I have been looking for a new role for more money and stability. We have been having layoffs but our company has been leveraging very well so I can still have a job with the company for maybe 3 or more years. I say this because I work in Finance and I literaly handle our numbers lol. Anyways, I wanted to negotiate the salary. I've never done this before with an internal promotion so I don't know how to go about it. It'd be a $2k additional raise. I know the worst thing they can say is no but I want to be prepared and settle my case. I do have interviews coming up but I'd rather stay at my current one and would love to stay for another year or so. If I get a new job, it'd be a $25k increase which I know my current company can't match but the work life balance is amazing and I have a gut feeling if I leave to another higher paying job, I'd be working endlessly. HELP!\n\nEDIT: Our annual raises are coming in July which is about 3% and this is why I'm hesistant to even ask.", "title": "How can I negotiate the salary for an internal promotion?", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/jobs/comments/1be24yh/how_can_i_negotiate_the_salary_for_an_internal/"}, {"author": "Mangon09", "author_flair_text": null, "clicked": false, "created_utc": 1710362258.0, "distinguished": null, "edited": false, "id": "1be23ga", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1be23ga", "num_comments": 0, "over_18": false, "permalink": "/r/jobs/comments/1be23ga/how_can_i_get_entry_level_hr_jobs_please_help/", "saved": false, "score": 1, "spoiler": false, "stickied": false, "text": "I am currently a college student majoring in Psychology and am interested in working in HR in the future. I would like to know what type of entry level jobs (mostly minimum wage jobs) look good that I could do while I am in school so that when I graduate from college I will be able to get positions like HR assistant or HR adjacent positions (and possibly work my way up).\n\n  \nI currently work as a merchandising associate at a big Baseball Stadium for a MLB team and get around minimum wage, so I would like to know if these types of jobs would help me get entry level HR jobs.\n\n  \nIs there anything else that I could do to help get an HR job while I am in college? I am nearly done with school so changing my major isn't an option, in addition, there is no human resources major/minor or anything similar at my school. Is there skills I can specifically learn like Excel or something that would help my resume? Any certificates or such that can be done while I am still in school?\n\nLocation: LA, California.\n\nThanks!", "title": "How Can I Get Entry Level HR Jobs? Please Help..", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/jobs/comments/1be23ga/how_can_i_get_entry_level_hr_jobs_please_help/"}, {"author": "badboyzpwns", "author_flair_text": null, "clicked": false, "created_utc": 1710362039.0, "distinguished": null, "edited": false, "id": "1be209p", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1be209p", "num_comments": 1, "over_18": false, "permalink": "/r/jobs/comments/1be209p/when_does_your_employer_look_at_your_private/", "saved": false, "score": 1, "spoiler": false, "stickied": false, "text": "I know its not private despite you sending a private message and I keep everything appropriate. But, i'm curious - in what cases would an employer look at a private slack message? Do they do it periodically, do they search for certian keywords like 'unionize'  or the CEO's name every week in the private message database, etc.\n\n&#x200B;", "title": "When does your employer look at your private Slack messages?", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/jobs/comments/1be209p/when_does_your_employer_look_at_your_private/"}, {"author": "SurgicalWeedwacker", "author_flair_text": null, "clicked": false, "created_utc": 1710361606.0, "distinguished": null, "edited": false, "id": "1be1tqd", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1be1tqd", "num_comments": 6, "over_18": false, "permalink": "/r/jobs/comments/1be1tqd/which_job_sites_have_been_the_most_useful_for_you/", "saved": false, "score": 1, "spoiler": false, "stickied": false, "text": "Also, why is LinkedIn suddenly obsolete? Did something replace it?", "title": "Which job sites have been the most useful for you?", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/jobs/comments/1be1tqd/which_job_sites_have_been_the_most_useful_for_you/"}, {"author": "organicsauce21", "author_flair_text": null, "clicked": false, "created_utc": 1710360605.0, "distinguished": null, "edited": false, "id": "1be1emz", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1be1emz", "num_comments": 1, "over_18": false, "permalink": "/r/jobs/comments/1be1emz/worth_applying_to_other_jobs_outside_of_my_target/", "saved": false, "score": 1, "spoiler": false, "stickied": false, "text": "Currently unemployed, looking to get in IT as a help desk tech. I dont need cash atm since my living situation is taken care of. I see some opportunities like working part time at a pizza place or something, but would I just be wasting my time since Its not really in my target field? Any advice on what I could do?", "title": "Worth applying to other jobs outside of my target field?", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/jobs/comments/1be1emz/worth_applying_to_other_jobs_outside_of_my_target/"}, {"author": "Puddle_Fisher", "author_flair_text": null, "clicked": false, "created_utc": 1710360420.0, "distinguished": null, "edited": 1710360720.0, "id": "1be1bwl", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1be1bwl", "num_comments": 1, "over_18": false, "permalink": "/r/jobs/comments/1be1bwl/should_i_not_mention_i_was_let_go_while_on/", "saved": false, "score": 1, "spoiler": false, "stickied": false, "text": "In my previous company, I worked in customer operations. Large loss claims investigations in insurance. The company was paying for my education in CS. Long story short I got an internal infection needed surgery and was out for a month. I was promoted and shadowed as a department tech analyst. Internal company web tools, and hardware within the department. A lot of my innovative ideas took off. It seemed everything was going well then when I came back and signed into work everything seemed normal and fine. The following day I was pulled into a meeting and right to work with my new manager and HR, my old manager was promoted while I was out. Fired no reason given even when I asked as to why performance or missing an extended period of work even though it was covered by FMLA/STD. I was given no reason.\n\n&#x200B;\n\nI've gotten numerous interviews and when asked why I left, (Fortune 100 insurance company) I'm pretty truthful.\n\n&#x200B;\n\nI summarize that it was going well, I started in the customer-facing and investigation role, and education was being paid for, I had the opportunity to shadow and innovate ideas in the department's web tools, and hardware space. Due to a temporary health issue that required surgery, I came back to being let go with no reason or contests given afterward. I'm a pretty cool person and usually summarize it's life and people and entities both have their rights.", "title": "Should I not mention I was let go while on disability?", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/jobs/comments/1be1bwl/should_i_not_mention_i_was_let_go_while_on/"}, {"author": "serolfainexx", "author_flair_text": null, "clicked": false, "created_utc": 1710360368.0, "distinguished": null, "edited": 1710362862.0, "id": "1be1b67", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1be1b67", "num_comments": 1, "over_18": false, "permalink": "/r/jobs/comments/1be1b67/what_can_i_do_for_work_that_doesnt_require_too/", "saved": false, "score": 1, "spoiler": false, "stickied": false, "text": "I’ve been having trouble on what I want to do for work for the last ten years. All my history is restaurants and I don’t want to do that anymore. I don’t even really care what it is as long as it’s little to no stress, but if anyone can point out any positions that you only need about 2 years of school tops or less and make a decent living. Thanks in advance! ", "title": "What can I do for work that doesn’t require too much school? ", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/jobs/comments/1be1b67/what_can_i_do_for_work_that_doesnt_require_too/"}, {"author": "iketheidiot", "author_flair_text": null, "clicked": false, "created_utc": 1710360342.0, "distinguished": null, "edited": false, "id": "1be1at1", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1be1at1", "num_comments": 1, "over_18": false, "permalink": "/r/jobs/comments/1be1at1/can_i_create_a_pest_control_business_as_a_teenager/", "saved": false, "score": 1, "spoiler": false, "stickied": false, "text": "Can I just kill rodents for people and earn a small amount of money?", "title": "Can I create a pest control business as a teenager", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/jobs/comments/1be1at1/can_i_create_a_pest_control_business_as_a_teenager/"}, {"author": "HyenaReasonable6259", "author_flair_text": null, "clicked": false, "created_utc": 1710360311.0, "distinguished": null, "edited": false, "id": "1be1abi", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1be1abi", "num_comments": 0, "over_18": false, "permalink": "/r/jobs/comments/1be1abi/getting_anxious/", "saved": false, "score": 1, "spoiler": false, "stickied": false, "text": "Hi everyone,\nI recently received an offer for a PM position. I spoke to them on Friday for a negotiation on total comp and to change my start date. Which they agreed on.\n\nI’ve not heard back with the updated offer letter yet. Should I be worried?", "title": "Getting anxious", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/jobs/comments/1be1abi/getting_anxious/"}, {"author": "Vanish49", "author_flair_text": null, "clicked": false, "created_utc": 1710359565.0, "distinguished": null, "edited": false, "id": "1be0ywd", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1be0ywd", "num_comments": 1, "over_18": false, "permalink": "/r/jobs/comments/1be0ywd/does_linkedin_easy_apply_work/", "saved": false, "score": 1, "spoiler": false, "stickied": false, "text": "I am decently qualified in my field and am graduating this semester. I’m mass-applying to jobs on LinkedIn and the easy apply feature makes it very efficient. However, I’m not hearing back at all. I’ve applied to 10ish jobs every day for the last 3 days, but I can’t figure out what is wrong. \n\nIs it my CV format, or am I not choosing the right jobs? Or does this feature just not work? I am completing my PhD in Economics from an R1 university, and am looking to switch from academia to industry. \n\nI’m looking for advice from people who have used this feature. Thanks!", "title": "Does LinkedIn Easy Apply work?", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/jobs/comments/1be0ywd/does_linkedin_easy_apply_work/"}, {"author": "biggatyboom", "author_flair_text": null, "clicked": false, "created_utc": 1710358708.0, "distinguished": null, "edited": false, "id": "1be0lxl", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1be0lxl", "num_comments": 1, "over_18": false, "permalink": "/r/jobs/comments/1be0lxl/how_to_respond_to_a_job_application_question_tell/", "saved": false, "score": 1, "spoiler": false, "stickied": false, "text": "Hi, \n\nI'm filling out a job application and one of the questions to respond to is \"tell us about one of your latest achievements\". To be honest, I don't have any latest achievements dating the past year...its been pretty quiet. Do you have any examples you could share to spark an idea in my brain? ", "title": "How to respond to a job application question \"tell us about one of your latest achievements\"", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/jobs/comments/1be0lxl/how_to_respond_to_a_job_application_question_tell/"}, {"author": "majesticmarbles_", "author_flair_text": null, "clicked": false, "created_utc": 1710358112.0, "distinguished": null, "edited": false, "id": "1be0cpg", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1be0cpg", "num_comments": 0, "over_18": false, "permalink": "/r/jobs/comments/1be0cpg/change_in_start_date/", "saved": false, "score": 1, "spoiler": false, "stickied": false, "text": "Is possible for a company to move my start date earlier? I already have signed a contract with them but I am concerned that they might change the joining date. I am moving to another country for a job.", "title": "Change in start date", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/jobs/comments/1be0cpg/change_in_start_date/"}, {"author": "Right-Training954", "author_flair_text": null, "clicked": false, "created_utc": 1710357752.0, "distinguished": null, "edited": false, "id": "1be07h3", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1be07h3", "num_comments": 3, "over_18": false, "permalink": "/r/jobs/comments/1be07h3/promised_bonus_if_i_got_certification_rules/", "saved": false, "score": 2, "spoiler": false, "stickied": false, "text": "Title. I did get my certification, which according to my employee manual would earn me a $5,000 bonus. I submitted my paperwork for the bonus and they said “we are looking into changing the bonus structure so no bonus will be granted at this time.” What would you all recommend at this point? Surely if the published rules at the time of me receiving the credentials stated I’d earn a bonus, that should be given, right? Anything I can do?", "title": "Promised Bonus if I got certification, rules changed after receiving the certification", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/jobs/comments/1be07h3/promised_bonus_if_i_got_certification_rules/"}, {"author": "Coffeegirl0526", "author_flair_text": null, "clicked": false, "created_utc": 1710357586.0, "distinguished": null, "edited": false, "id": "1be04ym", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1be04ym", "num_comments": 1, "over_18": false, "permalink": "/r/jobs/comments/1be04ym/example_of_an_insight_you_gave_through_analyzing/", "saved": false, "score": 1, "spoiler": false, "stickied": false, "text": "I really struggled at this question at an interview today. I am a Marketing Analyst with three years of experience. I worked with some very big brands. All I had to do was basic reporting, data visualizations sometime provide recommendations. My insights didn't really affect the revenue or sales. I worked at an agency side and I do not face the client directly so I do not really have access to that kind of data. How should I answer this question. Can Someone provide me an example? This will help me in my future interviews.", "title": "Example of an insight you gave through analyzing data and what was the solution or impact?", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/jobs/comments/1be04ym/example_of_an_insight_you_gave_through_analyzing/"}, {"author": "sorakapudding", "author_flair_text": null, "clicked": false, "created_utc": 1710356470.0, "distinguished": null, "edited": false, "id": "1bdzoch", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1bdzoch", "num_comments": 1, "over_18": false, "permalink": "/r/jobs/comments/1bdzoch/high_paying_job_or_less_pay_but_more_interesting/", "saved": false, "score": 1, "spoiler": false, "stickied": false, "text": "Hi all,\n\nI’m currently considering two offers. One is higher paying, with great benefits, PTO and bonuses. However, the job is not my desired field of work. I have worked in this field before, and although I didn’t love the work, I became close with me team and made the best of the job. It’s a similar field to what I want to be in, but I’m not sure if it would lead me to a dream role/position.\n\nThe other opportunity pays less and the work is seasonal, but is exactly the type of work I went to school for. It pays approximately 20-25k less and has not benefits or PTO because of the contract. This would set me up well for my desired career path, but I would likely be job hunting again in the fall/winter with only 6-8months of additional experience. There is also potential for me to stay with this company, and then the pay and benefits would be better, but still not as much as the first option.\n\nI am very conflicted, I returned to school to pursue this field but I am still not even qualified for many entry level positions, so this opportunity is very tempting to me. However, the higher paying role would allow me to pursue interests outside of work. \n\nIf it matters, I am 25, with no debts/loans, and a small amount of savings (for my age). Thanks in advance!", "title": "High paying job or less pay but more interesting", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/jobs/comments/1bdzoch/high_paying_job_or_less_pay_but_more_interesting/"}, {"author": "antiraisins", "author_flair_text": null, "clicked": false, "created_utc": 1710355772.0, "distinguished": null, "edited": false, "id": "1bdzdit", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1bdzdit", "num_comments": 1, "over_18": false, "permalink": "/r/jobs/comments/1bdzdit/need_help_asking_boss_for_lor/", "saved": false, "score": 1, "spoiler": false, "stickied": false, "text": "How do I ask my boss for a letter of recommendation for college without them thinking I'll quit soon and jeopardize my position?\n\nThey've asked before hiring if I'm thinking of going to college, to which I said 'I'm not sure' at the time, since I was desparate for a job. I'm sure they wouldn't have hired me if there was a possibility I'd leave in a year.\n\nIt's kind of annoying and I have no other points of contact to ask for an LoR. Please help :(", "title": "Need help asking boss for LoR", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/jobs/comments/1bdzdit/need_help_asking_boss_for_lor/"}, {"author": "CalmOrganization8298", "author_flair_text": null, "clicked": false, "created_utc": 1710355740.0, "distinguished": null, "edited": false, "id": "1bdzd0v", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1bdzd0v", "num_comments": 0, "over_18": false, "permalink": "/r/jobs/comments/1bdzd0v/bad_work_environment/", "saved": false, "score": 1, "spoiler": false, "stickied": false, "text": "Thave been working at my job for 9 months. The fourth month my supervisor began to start acting funny towards me after giving my opinion on a rude co worker that is her friend. She began to start making little insults towards me. Making smart comments even turning other co workers against me and I can feel the tone in the room when I walk in. Recently I'm January I told her I was pregnant. And a couple of weeks later I was pulled aside by a lead (her friend) and supervisor to tell me I am disrespectful. She said I pop bubble wrap which is a distraction but, others pop bubble wrap and she says nothing to them. She said I am on my phone and others including her self are on their phone and she says nothing. I am not rude to her I only say okay to her when she tells me things. She targets me. So after that day I set up a meeting with hr. After writing a statement I came back in the room and all eves were on me she had to write a statement against me back and included her friends that work there to help her write it. For days the tension was high. After I had a full on meeting with hr. Recently she told another employee not to talk to me. After that day the manager comes in and watches me work. This week another employee took my desk at the computers knowingly it was my seat because it had my personal items at the desk I confronted the other employee and told her she can just sit there and my supervisor laughed.\nUsually if someone set in the wrong seat she would tell them someone sits there. So later that day my manager held a conversation with me and my supervisor in a room saying my language is vulgar when I told him I'm not the only one who curses he dismissed me. Then he told me I'm too social and they want me to stop talking and isolate myself. The last thing the manager brought up was \"I heard you have a letter\" I said yes I'm pregnant and he cut me off and asked what does it say. I said it says to sit as needed. He then asked my supervisor when wast y end date for my accommodations. I was crying and in tears because my supervisor plays innocent to what she does to me even other employees see it that she picks on me. So today went to hr again to give the hr lady my accommodations. She says i don't know if we can accommodate you sitting. The note says when needed.\nThere are other employees who always sit every day. Everything I do they watch and neglect others actions.", "title": "Bad work environment ", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/jobs/comments/1bdzd0v/bad_work_environment/"}, {"author": "bangtaneki", "author_flair_text": null, "clicked": false, "created_utc": 1710355227.0, "distinguished": null, "edited": 1710356507.0, "id": "1bdz4zi", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1bdz4zi", "num_comments": 1, "over_18": false, "permalink": "/r/jobs/comments/1bdz4zi/should_i_apply_for_these_licenses/", "saved": false, "score": 1, "spoiler": false, "stickied": false, "text": "Hi everyone. \n\nI am a 23 year old recent graduate with little to no experience. I majored in Psychology and WGST with a minor in Communications. I have plans to get my masters degree, probably in something related to SW or HR as I would like to work in corporate. \n\nBut for now, I need to gather enough money for other things, such as moving out. So, I am trying to get a job (possibly two) that can help me get as much money to make that possible. I have looked at insurance agent positions that require licenses like Life and Health Insurance and Property and Causality licenses. They seem to be decent. \n\nIf I obtain these licenses, do I need anything else to work in such positions? Also, should I get both, or is one enough? Can I work a second (remote) job alongside this or will I be too busy? Any advice would also be appreciated 😊\n", "title": "Should I apply for these licenses? ", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/jobs/comments/1bdz4zi/should_i_apply_for_these_licenses/"}, {"author": "dropofred", "author_flair_text": null, "clicked": false, "created_utc": 1710354659.0, "distinguished": null, "edited": false, "id": "1bdyvxq", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1bdyvxq", "num_comments": 7, "over_18": false, "permalink": "/r/jobs/comments/1bdyvxq/please_help_me_write_an_email_to_my_manager_about/", "saved": false, "score": 1, "spoiler": false, "stickied": false, "text": "Here's my rough draft: \n\n\"Hi (Name),\n\nI would like to inform you that I have received a job offer from another company. I would prefer to stay at (name of our company) if their offer of compensation can be matched. However, I do have to do what's best for myself and my family in the long run. Call me at your earliest convenience.\n\nRegards,\n\nMy name\" ", "title": "Please help me write an email to my manager about bringing him a competing job offer asking him to match.", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/jobs/comments/1bdyvxq/please_help_me_write_an_email_to_my_manager_about/"}, {"author": "iAn1sha", "author_flair_text": null, "clicked": false, "created_utc": 1710354340.0, "distinguished": null, "edited": false, "id": "1bdyqrx", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1bdyqrx", "num_comments": 1, "over_18": false, "permalink": "/r/jobs/comments/1bdyqrx/how_do_i_respond_when_my_new_manager_asks_me_for/", "saved": false, "score": 1, "spoiler": false, "stickied": false, "text": "My company recently had layoffs and my manager was impacted which resulted in me getting switched to a different team. \nMy new manager seems super paranoid about job security and is taking on loads of new projects for the team. I have been assigned an extensive bi weekly KPI report which involves a lot of deep diving. \nI am still learning about this new domain and my manager keeps asking me to set a goal on when I would be able to take over from the previous owner and handle it on my own. I haven’t gotten to help out with the deep dive process yet or for that matter even shadow with the deep dive process. \nThe guy who has been doing it so far took help for around 2 months before doing it on his own but seems like I won’t be given that amount of time since I’ve been with the company for a while and my manager is in a hurry to have it transferred to me so that he can dump some new projects on the previous owner. \nHow do I respond when he asks me for my time frame goal?", "title": "How do I respond when my new manager asks me for a time frame of when I can take over an extensive report", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/jobs/comments/1bdyqrx/how_do_i_respond_when_my_new_manager_asks_me_for/"}, {"author": "taway7440", "author_flair_text": null, "clicked": false, "created_utc": 1710354333.0, "distinguished": null, "edited": false, "id": "1bdyqol", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1bdyqol", "num_comments": 0, "over_18": false, "permalink": "/r/jobs/comments/1bdyqol/how_tough_is_it_to_come_back_and_work_for_a/", "saved": false, "score": 1, "spoiler": false, "stickied": false, "text": "I'm a technical/scientific writer looking to work for a company after 8+ years of being a contractor/freelancer and am completely terrified I'm out of my league. \n\nAfter finishing my masters in science, I worked for a university lab for a couple of years and left because it was a very toxic environment.\n\nAnyone have similar experiences, coming to work for corporate after years of freelancing? Any tips/experience welcome. Thanks in advance. ", "title": "How tough is it to come back and work for a company after years of being a contractor/freelancer? ", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/jobs/comments/1bdyqol/how_tough_is_it_to_come_back_and_work_for_a/"}, {"author": "moose_nut", "author_flair_text": null, "clicked": false, "created_utc": 1710354141.0, "distinguished": null, "edited": false, "id": "1bdynil", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1bdynil", "num_comments": 0, "over_18": false, "permalink": "/r/jobs/comments/1bdynil/fiancé_needs_help_finding_a_job_any_advice/", "saved": false, "score": 1, "spoiler": false, "stickied": false, "text": "My fiancé (F26) is having a hard time. She's currently employed but doesn't enjoy any aspect of her job. She's looking for something new but is in that hole that many of us have been in; she's no idea what industry to look in and what roles to apply for. We're in the UK.\n\nLooking for some advice or industries that we may not have thought of. Sometimes a fresh pair of eyes/ears helps!\n\nHer skills and previous jobs are in catering, music and arts; she isn't the most academic. She's extremely strong-willed and has an incredible work ethic. She wouldn't ever let herself let anybody down.\n\nWe are part of the Seventh-day Adventist Church meaning we don't work Saturday's. Typically all of the subjects she's interested in involve weekend working! She's also spent the last eight years working evening/early morning shifts, so I think we can rule out evening working hours.\n\nI'd love for her to find a job in catering as this seems to be where her heart really is, but it needs to be something Monday to Friday.\n\nDoes anyone have any ideas at all? I've probably missed some really useful information out as I've rushed this, so please ask and I'll answer. Any help is massively appreciated.", "title": "Fiancé needs help finding a job - any advice", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/jobs/comments/1bdynil/fiancé_needs_help_finding_a_job_any_advice/"}, {"author": "acidt00th", "author_flair_text": null, "clicked": false, "created_utc": 1710354007.0, "distinguished": null, "edited": false, "id": "1bdylce", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1bdylce", "num_comments": 2, "over_18": false, "permalink": "/r/jobs/comments/1bdylce/which_is_worse_on_a_resume_a_4month_job_or_a/", "saved": false, "score": 1, "spoiler": false, "stickied": false, "text": "I got fired today after \\~4 months on the job. Before this job, I got fired/\"laid off\" from a job of 2.5 years in September. Before that, I had never been fired before. Both jobs were operations/production manager roles for live events companies.\n\nI got fired today for poor performance, even though I met my deadlines and got my work done well. They have only **two** employees (pres and VP) and I was never allowed to talk to the president, questions were frowned upon, my suggestions were consistently shot down, the VP would commandeer all my tasks without explanation, and they only cared about keeping the internal Slack channels organized rather than actually producing events. I can't imagine they'd be good references.\n\nI was planning to quit once I found another opportunity, but they beat me to it today. That being said, I wasn't able to accomplish anything significant in my time there, as much as I tried. \n\nI don't know whether I should list this 4-month job and fudge my experience a tad to make it more significant or if I should keep it off completely -- leaving a 7-month gap. I'm very close with the VP at my old job of 2.5 years and they said they would vouch for me if I extend my date of employment there by a couple months, effectively making the gap a little shorter. \n\nIf I leave out the short job, do I mention it if an interviewer ask about the gap? Would I ruin my credibility if my date of employment for my old job doesn't match a background check? I don't even know if that's typically checked. \n\nI've read that jobs shorter than 6 months are a red flag and that gaps longer than 6 months are a red flag, so I don't know the best course of action here. \n\nI didn't receive any severance this time, so I'm looking to get back on the horse as quick as humanly possible. Took me 3+ months to land this one I just got fired from. Trying to keep my head up here and not succumb to a \"I can't hold down a job\" mentality. ", "title": "Which is worse on a resume, a 4-month job or a 7-month gap?", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/jobs/comments/1bdylce/which_is_worse_on_a_resume_a_4month_job_or_a/"}, {"author": "Cheap_Meringue_8922", "author_flair_text": null, "clicked": false, "created_utc": 1710353230.0, "distinguished": null, "edited": false, "id": "1bdy9fu", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1bdy9fu", "num_comments": 2, "over_18": false, "permalink": "/r/jobs/comments/1bdy9fu/data_jobintern/", "saved": false, "score": 1, "spoiler": false, "stickied": false, "text": "Anyone looking for a data science intern? I have sent 500 applications and not even one interview so far. ", "title": "Data job/intern", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/jobs/comments/1bdy9fu/data_jobintern/"}, {"author": "Exquisite_Poupon", "author_flair_text": null, "clicked": false, "created_utc": 1710352705.0, "distinguished": null, "edited": false, "id": "1bdy1ay", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_1bdy1ay", "num_comments": 2, "over_18": false, "permalink": "/r/jobs/comments/1bdy1ay/how_to_ask_an_hr_recruiter_about_the_exempt/", "saved": false, "score": 1, "spoiler": false, "stickied": false, "text": "I received a job offer for an entry-level supply chain role that states the position is exempt. The duties in the job listing appear to be general entry-level work (completing daily tasks, answering questions from suppliers, etc.). I understand the FLSA duties requirement for exempt status and it doesn't seem like the majority of the work I will be doing is Executive, Administrative, or Professional (the line for Administrative is always a bit blurry, but going off these guidelines the job doesn't meet the criteria).\n\nIs there a way to ask the HR recruiter about this? Maybe just ask about overtime in general (but then they can just say it is exempt)? Is it a red flag if a candidate asks this question? If they can back up the status with good reasoning, I'm comfortable with that, but it seems like a lot of places are quick to classify a position as exempt because it is salaried.", "title": "How to ask an HR recruiter about the exempt status of a job offer?", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/jobs/comments/1bdy1ay/how_to_ask_an_hr_recruiter_about_the_exempt/"}]