[{"author": "minimaxir", "created_utc": 1546360274.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 381, "post_id": "abjg2y", "score": 3959, "subreddit": "LegalAdviceOffTopic", "text": "\"It's a new year, I figured it might be funny to give the AI another shot at generating /r/legaladvice titles (using [textgenrnn](https://github.com/minimaxir/textgenrnn)), and boy did it succeed.\\n\\nSome highlights:\\n\\n>My friend was arrested and she wants a divorce. (California)  \\n>  \\n>Received a clerk.  \\n>  \\n>\\\\[USA - CA\\\\] Minor is charging me for bankruptcy appliances on my property?  \\n>  \\n>My gym has been in another state.  \\n>  \\n>Dealership sent me a copyright custody of my child (PA)  \\n>  \\n>Ex wife threw away my car with a friend of a friend who passed away (Illinois)  \\n>  \\n>\\\\[AZ\\\\] Can I be fined because the competitor was turned off to a few weeks. What are my options?  \\n>  \\n>Is it legal for me to get in legal trouble?  \\n>  \\n>\\\\[CA\\\\] I was a victim of an apartment in a company and I won anyway, when you can refuse to pay a fee for 3 months  \\n>  \\n>\\\\[NY\\\\] Got in an accident with a child. What are my options?  \\n>  \\n>Someone is trying to steal my passport for a parking lot, what can I do?  \\n>  \\n>Can my employer require me to come into my apartment without my consent or try to get a lawyer?  \\n>  \\n>\\\\[USA\\\\] I was told I was at fault in Timeland, what are my options?  \\n>  \\n>\\\\[CA\\\\] Employer is selling my girlfriend and I received a call from a state when I didn't have to call police because they continue to pay them back.  \\n>  \\n>Neighbors dog keeps claiming they do not live with me. We are not on the lease. What are my options?  \\n>  \\n>(USA, CA, USA) Minors  \\n>  \\n>Someone stole my car, and I have to pay rent. What can I do?  \\n>  \\n>Discovered the city is threatening to sue me because I have some questions.  \\n>  \\n>\\\\[Michigan\\\\] I'm a boy on my wall without notice  \\n>  \\n>20 year old girlfriend accused me of stealing my money because I am not the father.  \\n>  \\n>(NY) I was terminated from a job and they are trying to kick me out.  \\n>  \\n>Just found out I am scared for a decade.  \\n>  \\n>(CA) I was arrested because I had a fence  \\n>  \\n>The Bank Company Refuses to Help!  \\n>  \\n>A friend of mine has been separated. Now what?  \\n>  \\n>Got hit by a car while with it. But won't return the money.  \\n>  \\n>\\\\[USA\\\\] Can I be served with a divorce?  \\n>  \\n>Texas - Dentist Officer violating child support in the UK. What can I do?  \\n>  \\n>(NY) I work as a child abuse and my husband decided to be destroyed. What can I do?  \\n>  \\n>\\\\[CA\\\\] My boss wants to charge me $1500 for a divorce even though I was a victim of a Personal Background check?  \\n>  \\n>Girlfriend wants to take my baby to small claims court?  \\n>  \\n>Married by a company who is on the lease. What can I do? (Canada/NJ)  \\n>  \\n>\\\\[Massachusetts\\\\] Employer won\\u2019t provide parental accommodations on a DUI question.  \\n>  \\n>Someone attempted suicide, and the party was denied to me and my song and now they are threatening to sue me because I have no idea what to do.  \\n>  \\n>(USA - CA) I'm a good scared contract window  \\n>  \\n>(California) Someone broke my cat and the contract says I need to pay for this matter?  \\n>  \\n>Grandfather passed away and refuses to give me my dog.  \\n>  \\n>\\\\[OH\\\\] Can I be forced to report a security camera in Missouri  \\n>  \\n>Can I be sued for threat of a product in California  \\n>  \\n>(FL) How do I get my sister's mom to sue me for services. Is this legal?  \\n>  \\n>Was pulled over for getting out of an accident in the US. I am a gun.  \\n>  \\n>Can a landlord evict my neighborhood. What can I do?  \\n>  \\n>\\\\[TX\\\\] I was arrested and caught my sister and I filed a courthouse into a lawyer in the morning about the professional things.  \\n>  \\n>\\\\[PA\\\\] I was abandoned and I was told it was a problem.  \\n>  \\n>A friend of mine was a victim of room in the first person and I don't know what to do.  \\n>  \\n>\\\\[OH\\\\] I have proof that I didn't return it.  \\n>  \\n>How to prove a cease and desist I missed, and they sent a personal loan contract, what are my options?  \\n>  \\n>(NY) Dog bit my car and the company keeps threatening to sue me (MA)  \\n>  \\n>Can I be arrested for a mortgage? (WI)  \\n>  \\n>(FL) I work at a stolen property  \\n>  \\n>Being sued for a friend who keeps stealing my money.  \\n>  \\n>Father is being harassed by ex-wife stating that I was a victim of affidavit  \\n>  \\n>Update: property manager took my girlfriend 3 months ago, no idea what to do.  \\n>  \\n>\\\\[CA\\\\] Can a landlord legally contact a lawyer. Is this legal?  \\n>  \\n>My ex-wife is threatening to call the police on false police  \\n>  \\n>I was fired from my life, what can I do?  \\n>  \\n>Rental company is trying to steal my car.  \\n>  \\n>\\\\[CA\\\\] My fiance is a minor, what should I do?  \\n>  \\n>(GA) I was arrested and won't leave  \\n>  \\n>\\\\[TX\\\\] Parents are trying to sell my car. Can I sue for damages?  \\n>  \\n>Just got a copyright infestation.  \\n>  \\n>Purchased a new house. WTF do I do?  \\n>  \\n>URGENT: Bought a car that was sent to the police and is now threatening my friends and my mother. What can I do?  \\n>  \\n>Can we sue the police if I die?  \\n>  \\n>Can I sue my home for a hospital bill  \\n>  \\n>(VA) I was attacked by an unpaid lease and trying to get me to pay for the past year.  \\n>  \\n>My mom is a contract I applied to serve property?  \\n>  \\n>Neighbor has confiscated an old neighbor.  \\n>  \\n>\\\\[MA\\\\] Employer is claiming I fired me, what can I do?!  \\n>  \\n>Neighbor\\u2019s dog blocked me out of his will. Is this legal?  \\n>  \\n>My friend is a scam attorney.  \\n>  \\n>I was in a class action lawsuit against a private property I own.  \\n>  \\n>Credit card charge for discrimination?  \\n>  \\n>\\\\[PA\\\\] I was arrested for violating the law?  \\n>  \\n>Neighbor cut down my neighborhood. What can I do?  \\n>  \\n>Assaulted by my house and it wasn't even legal.  \\n>  \\n>\\\\[FL\\\\] A friend of mine is getting repossessed.  \\n>  \\n>I want to get a restraining order against me  \\n>  \\n>Can I sue my child over my phone?  \\n>  \\n>How do I get fired from a job?  \\n>  \\n>Kentucky was in a car accident and the divorce is a service dog...  \\n>  \\n>\\\\[MA\\\\] My dad passed away and he was seized. What do I do? \\\\[CA, USA\\\\]  \\n>  \\n>I was just found from a person I was confiscated by Texas and I need help.  \\n>  \\n>Father passed away and I was at the gym.  \\n>  \\n>My grandfather died and destroyed my car while I was at work!  \\n>  \\n>I want to leave my apartment  \\n>  \\n>\\\\[MA\\\\] Can I buy a dog bite  \\n>  \\n>Neighbors stole my car and now they don't know what to do.  \\n>  \\n>Neighbors dog keeps sending photos of me cheating on rent.  \\n>  \\n>\\\\[Ontario\\\\] Can I Sue Child Support Animal Infringement  \\n>  \\n>Legal responsibility for medical malpractice. Is this legal? (California)  \\n>  \\n>Can a probation officer sue a lawyer to enforce the law?  \\n>  \\n>\\\\[NY\\\\] I was attacked by a dog unit but the company is now threatening to take me to court, what can I do?  \\n>  \\n>Neighbor cut down my car without permission  \\n>  \\n>Texas - Was Fired for Damage To My Head  \\n>  \\n>Can restaurants have a license?  \\n>  \\n>\\\\[PA\\\\] Someone is pregnant  \\n>  \\n>I was arrested for a sex assault charge in my name and now they told me to go to small claims court?!!!!  \\n>  \\n>How much trouble can I get into?  \\n>  \\n>Someone hit my car with dementia. What can I do? (CA)\\n\\nDumps:\\n\\n[1/6](https://pastebin.com/BknzNYPj)\\n\\n[2/6](https://pastebin.com/1uuAeyZa)\\n\\n[3/6](https://pastebin.com/brYaeeZM)\\n\\n[4/6](https://pastebin.com/0F3qTgz4)\\n\\n[5/6](https://pastebin.com/6uXF2HCC)\\n\\n[6/6](https://pastebin.com/8ehDszv0)\\n\\n&#x200B;\\n\\nThe AI doesn't say much about tree law, but it sure likes evil dogs.\"", "title": "I trained an AI to generate /r/legaladvice post titles, and it asks \"Is it legal for me to get in legal trouble?\"", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/legaladviceofftopic/comments/abjg2y/i_trained_an_ai_to_generate_rlegaladvice_post/"}, {"author": "Noirradnod", "created_utc": 1505050356.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 124, "post_id": "6z88pl", "score": 3876, "subreddit": "LegalAdviceOffTopic", "text": "\"Experimental evidence contradicting OP's claim of semen on the exterior of a motor vehicle.\\n\\n**The Facts** \\nSix days ago u//Fuzzpuffs posted [a thread](https://www.np.reddit.com/r/legaladvice/comments/6xykeb/someone_has_been_masturbating_next_to_my_vehical/) in r//legaladvice that she believed their neighbor had been engaged in a transgressive sexual act, namely ejaculating multiple times onto the rear driver's side door of OP's car. As evidence, she provided a picture of off-white material on the door as well as testimony that the material glowed under UV light. She further stated that she \\\"just knows how perverts are\\\" and that the residue was at waist height. Lastly, she claimed that, because she resides in a hot and arid locale, it was unlikely to be caused by some natural liquid event.\\n\\n**Response**\\nPosters in the thread tended to be dismissive of the claims for several reasons. First. many provided personal experience with a variety of other fluids, including puddles on the road, lawn sprinklers, tree sap, and bird excrement, all of which have left splash patterns and residues similar to the provided picture. To counter the UV claim, especially in light of the CSI trope that bodily fluids glow under this light, it was pointed out that numerous other substances exhibit similar fluorescence, including some of the alternative suggested causes. There was also a professed belief that dried semen does not take on the depicted form. Finally, questions were raised regarding the plausibility of the action, as despite massive evidence that extreme sexual perversions do exist (cf. *United States vs. One Book Called Ulysses*), it was hard to fathom someone gaining sexual pleasure from this particular act. Despite this rejection, OP remained steadfastly devoted to their claim.\\n\\nAs such, I felt that it would be necessary to provide more evidence against this belief. To this end, I engaged\\nin several masturbatory events with a car to create a visual record of what ejaculate on a car door looks\\nlike.\\n\\n**Experimental methodology** \\nThe subject is a young adult male with no history of sexual dysfunction. To guarantee a large volume of the ejaculate, subject refrained from release for a period of four days prior to the test. Furthermore, normal diet was supplemented with extra water to guarantee hydration and eight stalks of celery, which anecdotally is claimed to increase semen production. The exact experiment consisted of three sessions, spaced four hours apart, conducted in a chair and concluded by standing and ejaculating onto a car's door. Subject was provided approximately two teaspoons of lubricant per session, and all external stimulation was limited to a January 2013 Penthouse magazine. The results were photographed until the ejaculate dried.\\n\\n[Pictures Here](https://imgur.com/a/yUV9T)\\n\\n**Conclusion**\\nThis album contains the original pictures of OP as well as the results of the experiment. As can be seen, there is a noticeable difference between the appearance of what was claimed to be semen and what actually is semen. Therefore, it is very doubtful that anyone masturbated onto OP's car, and it can be assumed that some other substance is the cause of the residue.\\n\"", "title": "That was probably not jizz on OP's car", "upvote_ratio": 0.99, "url": "https://www.reddit.com/r/legaladviceofftopic/comments/6z88pl/that_was_probably_not_jizz_on_ops_car/"}, {"author": "Joseph-King", "created_utc": 1589857010.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 97, "post_id": "gmgb0e", "score": 2773, "subreddit": "LegalAdviceOffTopic", "text": "\"\"", "title": "This belongs here", "upvote_ratio": 0.96, "url": "https://i.redd.it/mp4lu2oa4mz41.jpg"}, {"author": "probonolawyer2017", "created_utc": 1513377592.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 422, "post_id": "7k37fj", "score": 2220, "subreddit": "LegalAdviceOffTopic", "text": "\"Somebody suggested I post about my issue on this subreddit. \\n\\nI recently graduated law school and started working at a non-profit firm, providing free legal services to low income individuals.\\n\\nI always wanted to work in either government or non-profit, as I always believed in St. Thomas' principles of helping others. However, it has turned to be a complete headache.\\n\\nThe clients are driving me nuts!\\n \\nThe main problem is the walk ins. \\nThey walk-in every day without appointments, and expect me to stop what I am doing to help them. One who expected me to stop during my appointment I had with another client to help her. I will have up to five walk ins in one day. The problem with the constant walk ins is that the receptionist speaks English, and does not speak Spanish, so if they walk in I have to be the one who speaks to them. With the constant walk ins, I have to be a part-time receptionist. The constant walk ins burn me out by the end the day. Additionally, it is hard for me to get the other work I have done if I have to play receptionist all day.\\n\\nMy second problem is how many \\\"no show\\\" appointments I have. I can understand if somebody calls and cancels in advance because of work schedules fluctuate and I'm usually understanding,  but some literally do not show up. Two or three times. It's frustrating because it not only delays finishing up their case, but it takes time away that I could be helping another person. \\n\\nThe third problem is when I give them a list of documents they *need* to bring to the next appointment in order to do the next part, and they don't bring them, and then they have to come back multiple times to finish. I have assignments that should have finished in one day that take two months to finish.  It makes the process completely slow and all the extra time I am taking to finish these cases, it makes the entire system slow. \\n\\nIt's complete inefficiency and it makes the job not just hard but frustrating.  I am always burnt out by the end of the day. \\n\\nLastly, while most of my clients are wonderful, some of them are rude. One lady sucked her teeth at me when I told her that it was out of my job description to get her an info pass appointment (I'd have to get up at 5 am to try to get her an open slot). I called another lady back and she said: \\\"It took you guys that long to call me back?\\\" I'm putting 110% in my cases, and put hours and hours in a case to make sure they get the best representation, so it is shocking that my effort is so undervalued to them. \\n\\nMaybe I was naive to think there would always be some form of appreciation because a private lawyer would cost thousands of dollars, money that they cannot afford. \\n\\nAny advice on how to go about with pro-bono clients and serving a low income population?\\n\\nUPDATE: Thanks for the responses. I have been thinking about this all night and it really opened my eyes. Now that I think about it, some of my clients are not just poor, but the poorest of the poor. They are adults, but in reality they're like children. The social norms that we know about appointments, etc., they may not have had the opportunity to learn. \\n\\nWith all that in mind, I am starting to believe I am not cut out for his, no matter how good my intentions are.  I am burnt out after only 3 1/2 months. \\n\\nMy only concern is, if and when it is time for me to leave, who helps these people?  And if people are constantly leaving non-profit, who helps these people?\"", "title": "Pro-bono clients are driving me mad. HELP.", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/legaladviceofftopic/comments/7k37fj/probono_clients_are_driving_me_mad_help/"}, {"author": "spookyb0ii", "created_utc": 1608066666.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 134, "post_id": "kdum8l", "score": 2045, "subreddit": "LegalAdviceOffTopic", "text": "\"\"", "title": "Is this allowed? (State unknown)", "upvote_ratio": 0.98, "url": "https://i.redd.it/e4i4p6ga2f561.jpg"}, {"author": "honestmango", "created_utc": 1610074075.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 43, "post_id": "kstdi7", "score": 1889, "subreddit": "LegalAdviceOffTopic", "text": "\"\"", "title": "Lawyer who used to work for me framed this one. (F bomb warning)", "upvote_ratio": 0.98, "url": "https://i.redd.it/7bwokfecv0a61.jpg"}, {"author": "iTrickzGG", "created_utc": 1593352470.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 146, "post_id": "hheqs8", "score": 1619, "subreddit": "LegalAdviceOffTopic", "text": "\"\"", "title": "If I actually go in the store naked, as they instruct, can I be held accountable, say for public indecency or something?", "upvote_ratio": 0.97, "url": "https://i.redd.it/4kt4jwhfpn751.jpg"}, {"author": "Guygan", "created_utc": 1624049043.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 62, "post_id": "o2zspa", "score": 1603, "subreddit": "LegalAdviceOffTopic", "text": "\"\"", "title": "Belongs here:", "upvote_ratio": 0.98, "url": "https://i.imgur.com/ggmLq1g.jpg"}, {"author": "Dinoswordfish", "created_utc": 1587829168.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 120, "post_id": "g7vhs2", "score": 1519, "subreddit": "LegalAdviceOffTopic", "text": "\"\"", "title": "I see more and more of these stories lately. How is it legal for the hospital to overcharge people like this? And could this be a lawsuit?", "upvote_ratio": 0.97, "url": "https://i.redd.it/ckgjaphthzu41.jpg"}, {"author": "Fourfootone85", "created_utc": 1585149617.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 93, "post_id": "fos278", "score": 1395, "subreddit": "LegalAdviceOffTopic", "text": "\"\"", "title": "Can an author’s publisher prevent them from giving this kind of blanket permission to use their works?", "upvote_ratio": 0.99, "url": "https://i.redd.it/y5uyb0jhsqo41.jpg"}, {"author": "curiousnboredd", "created_utc": 1694266058.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 80, "post_id": "16e5s86", "score": 1359, "subreddit": "LegalAdviceOffTopic", "text": "\"\"", "title": "assuming the details are true, is there anything legally that can stop that psychic business?", "upvote_ratio": 0.98, "url": "https://i.redd.it/yk4nb7nue8nb1.jpg"}, {"author": "bug-hunter", "created_utc": 1608872401.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 67, "post_id": "kjtfyn", "score": 1355, "subreddit": "LegalAdviceOffTopic", "text": "\"So, I heard some weird ringing noises just a few minutes ago, and went outside to see what was up.\\n\\nSome fat dude had a bunch of livestock on my roof, and fled when I threatened to call the cops. Now there's reindeer poop on my roof.\\n\\nCan I sue?\\n\\nEdit: [Shitty MS Paint, by request](https://imgur.com/a/DscDZZd)  \\n\"", "title": "Trespasser's livestock got onto my roof and left poop, what do I do?", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/legaladviceofftopic/comments/kjtfyn/trespassers_livestock_got_onto_my_roof_and_left/"}, {"author": "benjaminikuta", "created_utc": 1586084964.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 70, "post_id": "fvc6hi", "score": 1321, "subreddit": "LegalAdviceOffTopic", "text": "\"\"", "title": "Does the second tweet have any legal significance?", "upvote_ratio": 0.98, "url": "https://i.redd.it/ogl9oxpcfzq41.jpg"}, {"author": "madv_willneed", "created_utc": 1630706421.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 106, "post_id": "pheu78", "score": 1281, "subreddit": "LegalAdviceOffTopic", "text": "\"\"", "title": "Curious as to the legality of this clause, and enforceability if it is legal.", "upvote_ratio": 0.98, "url": "https://i.redd.it/dnhzgj8p1dl71.jpg"}, {"author": "silverwolfdude", "created_utc": 1599777035.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 73, "post_id": "iqdwoz", "score": 1286, "subreddit": "LegalAdviceOffTopic", "text": "\"\"", "title": "How would this be handled in court if it was taken to court? Basically I want to know if she could possibly be charged with murder / manslaughter by attempted suicide.", "upvote_ratio": 0.98, "url": "https://i.redd.it/yeqm0bnycem51.jpg"}, {"author": "bolivar-shagnasty", "created_utc": 1583458203.0, "link_flair_template_id": "76d5ca8a-324e-11e6-b97b-0e0378709321", "link_flair_text": "Update", "num_comments": 76, "post_id": "fe5vq8", "score": 1267, "subreddit": "LegalAdviceOffTopic", "text": "\"\"", "title": "Update to the broken stove. Cut the cord on my stove and put signs on it. Hopefully nobody uses it and gets exploded.", "upvote_ratio": 0.99, "url": "https://i.imgur.com/SX26ldA.png"}, {"author": "beerbellybegone", "created_utc": 1580224909.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 81, "post_id": "ev6xds", "score": 1214, "subreddit": "LegalAdviceOffTopic", "text": "\"\"", "title": "How legal/enforceable is this contract?", "upvote_ratio": 0.98, "url": "https://i.redd.it/rw45hnavbgd41.jpg"}, {"author": "AriAncom", "created_utc": 1580994606.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 52, "post_id": "ezs522", "score": 1197, "subreddit": "LegalAdviceOffTopic", "text": "\"\"", "title": "Would this count as crossing an international border without a visa?", "upvote_ratio": 0.98, "url": "https://i.redd.it/4h4ngt65zaf41.jpg"}, {"author": "hojokono", "created_utc": 1599975627.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 35, "post_id": "irsnjv", "score": 1150, "subreddit": "LegalAdviceOffTopic", "text": "\"\"", "title": "So, the president said for NC to vote twice, Attorney General said it was a felony. If someone gets put a felony charge on them for this, can they drag the president to court? (lets say they didnt see the Attorney General's message)", "upvote_ratio": 0.96, "url": "https://i.redd.it/y24cj5ftqum51.png"}, {"author": "None", "created_utc": 1558991156.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 88, "post_id": "btrdin", "score": 1154, "subreddit": "LegalAdviceOffTopic", "text": "\"\"", "title": "Since it's legal to show male nipples on TV, would it be legal to censor female nipples with male nipples?", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/legaladviceofftopic/comments/btrdin/since_its_legal_to_show_male_nipples_on_tv_would/"}, {"author": "ifukupeverything", "created_utc": 1579312560.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 107, "post_id": "eqa6ad", "score": 1149, "subreddit": "LegalAdviceOffTopic", "text": "\"\"", "title": "Thought you guys would like to ponder this.", "upvote_ratio": 0.97, "url": "https://i.redd.it/gd8ye2wj1gb41.jpg"}, {"author": "AJSSPACEPLACE", "created_utc": 1555575620.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 87, "post_id": "bej1zr", "score": 1136, "subreddit": "LegalAdviceOffTopic", "text": "\"I know  a very nice piece of property, it\\u2019s an old  mansion, with several legends about what supposedly lingers inside. \\n\\nMy plan is to dress as a ghost, and scare off potential buyers, until the real estate aganey is forced to sell it for far below market value. Then I\\u2019ll buy the property, and dig up the treasure a previous owner buried in the back yard, AND ILL BE RITCH! MUAAHAHA HA HA.\\n\\nIf I happen to be foiled during the execution of this plot, what could my potential charges be?\\n\\nUpdate: A pesky group of do-gooding kids have ruined my scheme! I knew I should have used more than 12 fog machines, and I should have worked out the glitches in my holographic projector. \\n\\nAnyway, I was charged with breaking and entering, assault, trespassing, false imprisonment, etc. oh, I did technically steal thier van, when i made it appear to vanish in the fog, so that\\u2019s another charge to throw on the pile.\\n\\nEdit: in all seriousness, thank everyone, I honestly did not expect that my shitpost would get hundreds and of upvotes. Additionally I never expected any of my posts to get given gold! Thank you to everyone on this lovely subreddit!\"", "title": "Is my dastardly scheme illegal?", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/legaladviceofftopic/comments/bej1zr/is_my_dastardly_scheme_illegal/"}, {"author": "None", "created_utc": 1611056083.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 118, "post_id": "l0i4z9", "score": 1136, "subreddit": "LegalAdviceOffTopic", "text": "\"Need to know before midday (est) tomorrow.\"", "title": "If I pardon myself for a crime, but the pardon is overturned, can the pardon be seen as a confession?", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/legaladviceofftopic/comments/l0i4z9/if_i_pardon_myself_for_a_crime_but_the_pardon_is/"}, {"author": "pintxa_", "created_utc": 1548002406.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 171, "post_id": "ahz7x0", "score": 1131, "subreddit": "LegalAdviceOffTopic", "text": "\"The owner's reasoning aside, surely this can't be legal? Especially if the ban doesn't apply to single men? \\n\\nhttps://guestofaguest.com/new-york/restaurants/upper-east-side-restaurant-nello-bans-single-women-from-eating-at-the-bar\"", "title": "A restaurant in NYC has banned single women from eating at the bar. But men can dine alone, no problem. Is that legal?", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/legaladviceofftopic/comments/ahz7x0/a_restaurant_in_nyc_has_banned_single_women_from/"}, {"author": "Opus-the-Penguin", "created_utc": 1703813589.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 219, "post_id": "18tanvg", "score": 1124, "subreddit": "LegalAdviceOffTopic", "text": "\"\"", "title": "Is this legal? Kansas restaurant will be deducting 2.5% from waitstaff tip when the check is paid via credit card. 3.25% if it's AmEx.", "upvote_ratio": 0.95, "url": "https://i.redd.it/nxyk6i0a059c1.jpeg"}, {"author": "bug-hunter", "created_utc": 1640430017.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 69, "post_id": "ro7sqv", "score": 1121, "subreddit": "LegalAdviceOffTopic", "text": "\"So, I heard some weird ringing noises just a few minutes ago, and went outside to see what was up.\\n\\nI started to run outside, and when I got to the living room, I saw this fat dude wearing red jumping into my fireplace!\\n\\nI ran to try and catch him, but he got away. And then I looked back, **and that bastard ate all my cookies!** [I think it's the same guy who left poop on my roof last year.](https://www.reddit.com/r/legaladviceofftopic/comments/kjtfyn/trespassers_livestock_got_onto_my_roof_and_left/)\\n\\nCan I sue?\\n\\nShitty MSPaint:\\n\\n&#x200B;\\n\\nhttps://preview.redd.it/f52po9ls8y581.png?width=822&format=png&auto=webp&s=3e096e43cacebeddc40dc3f48bf1c88f2bb2278f\"", "title": "Trespasser broke into my house and ate my cookies, what do I do?", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/legaladviceofftopic/comments/ro7sqv/trespasser_broke_into_my_house_and_ate_my_cookies/"}, {"author": "imasassypanda", "created_utc": 1603314536.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 147, "post_id": "jflqvm", "score": 1097, "subreddit": "LegalAdviceOffTopic", "text": "\"\"", "title": "How was this legal? Isn’t this textbook entrapment? (Tried to cross post and couldn’t.)", "upvote_ratio": 0.97, "url": "https://i.redd.it/oe2fsumrjiu51.jpg"}, {"author": "OldSport416", "created_utc": 1600981607.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 140, "post_id": "iz5uv3", "score": 1102, "subreddit": "LegalAdviceOffTopic", "text": "\"\"", "title": "Found this post on r/technicallythetruth. If I froze my liquids, can I bring them onboard a plane in the US?", "upvote_ratio": 0.99, "url": "https://i.redd.it/d9c07ulpu5p51.jpg"}, {"author": "Firm-Mail1976", "created_utc": 1691258356.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 104, "post_id": "15j27d8", "score": 1082, "subreddit": "LegalAdviceOffTopic", "text": "\"\"", "title": "Curious as to the legality of this clause, and enforceability if it is legal.", "upvote_ratio": 0.98, "url": "https://i.redd.it/xcqs6qjezbgb1.jpg"}, {"author": "ops-name-checks-out", "created_utc": 1558535936.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 14, "post_id": "brpkvr", "score": 1080, "subreddit": "LegalAdviceOffTopic", "text": "\"\"", "title": "[Wednesday Shitpost] Kids...", "upvote_ratio": 0.97, "url": "https://i.imgur.com/BZoiDUC.jpg"}, {"author": "spookyb0ii", "created_utc": 1611702863.0, "link_flair_template_id": "76d5ca8a-324e-11e6-b97b-0e0378709321", "link_flair_text": "Fake - see comments ", "num_comments": 175, "post_id": "l5qf87", "score": 1081, "subreddit": "LegalAdviceOffTopic", "text": "\"\"", "title": "Is this even close to being legal?", "upvote_ratio": 0.93, "url": "https://i.redd.it/jc5ra2jkerd61.jpg"}, {"author": "bug-hunter", "created_utc": 1591124947.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 39, "post_id": "gvdkky", "score": 1062, "subreddit": "LegalAdviceOffTopic", "text": "\"\"", "title": "Hockey Law meets Admiralty Law (from r/WatchPeopleDieInside)", "upvote_ratio": 0.98, "url": "https://i.redd.it/vduw8erspj251.png"}, {"author": "Dungeon_Master_Lucky", "created_utc": 1588538490.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 104, "post_id": "gcxtbb", "score": 1037, "subreddit": "LegalAdviceOffTopic", "text": "\"The peeps over at r/legaladvice got angy with meh.\"", "title": "If you shoot a pirate in their wooden leg, is it bodily harm or property damage?", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/legaladviceofftopic/comments/gcxtbb/if_you_shoot_a_pirate_in_their_wooden_leg_is_it/"}, {"author": "Nooner827", "created_utc": 1621281104.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 76, "post_id": "nepznb", "score": 1023, "subreddit": "LegalAdviceOffTopic", "text": "\"I wanted to post this in /r/legaladvice, but since I don't have a question, the mods thought I should post in here instead. I'll try to keep it short and to the relevant points.\\n\\nMy wife and were living in CA at the time and my ex-wife was living in SC. My three children (14M, 16F, and 18M) I had with my ex-wife had been living with me for almost 10 years at the time of this story. Our custody was technically joint, but the military moved me out to the other side of the country, so the reality was that they lived with me except for Christmas, Spring, and Summer breaks. \\n\\nOur oldest graduated at the very end of May and my ex and her parents flew out to CA for the graduation. She was coolly cordial, which was the nicest she'd been to me in years. I thought things were turning around and that we could be maybe be friendly again. Well, a couple of weeks later, there was a knock at my door and it was a summons for a custody hearing in SC less than a week away.\\n\\nObviously, I was panicked because I'd have to arrange for PTO, plane tickets, lodging, etc. just to make it to the hearing in time. Oh yeah, I'm going to need a lawyer ASAP and she filed in a different county than our original fights had been in so, my previous lawyer wouldn't work.\\n\\nMy current wife had been a court reporter for years and, although she still knew tons of contacts, they were in yet a different district. What she did, instead, was to pull the county's family court roster for the county where this action was filed. She made note of whose names popped up the most and we started working our way down that list. Her thought being that these lawyers not only handled family court issues, but were in front of those judges on a regular basis. They'd know the judges and the judges would know them. One of the top three got back to us for a consult. During the consult he asked, \\\"So how did you find me?\\\" My wife explained her method and reasoning and his response was \\\"Wow. That's really smart.\\\" He took the case and we won.\\n\\nI often see the advice to lawyer up immediately, but if it hadn't been for my wife's real-world knowledge of the court system I would have been lost about how to find a good lawyer in time. I know that's what my ex was hoping, seeing that she had filed the action back in April and could easily have clued me in when she saw me three weeks earlier. Hopefully someone out there will find this useful.\"", "title": "I had to \"lawyer up yesterday\" once. Here's what worked for me", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/legaladviceofftopic/comments/nepznb/i_had_to_lawyer_up_yesterday_once_heres_what/"}, {"author": "reverendsteveii", "created_utc": 1605228267.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 79, "post_id": "jt758g", "score": 1023, "subreddit": "LegalAdviceOffTopic", "text": "\"\"", "title": "Is the Lt Gov of Texas obligated to pay up here? Is there any situation in which he would be?", "upvote_ratio": 0.97, "url": "https://i.imgur.com/ETopRAh.jpg"}, {"author": "Thurgood_Marshall", "created_utc": 1592357972.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 68, "post_id": "hahh67", "score": 1005, "subreddit": "LegalAdviceOffTopic", "text": "\"\"", "title": "Did Scalia violate the Constitution by dying?", "upvote_ratio": 0.96, "url": "https://i.redd.it/sq5qx4h8kd551.png"}, {"author": "eatnumber1", "created_utc": 1595916239.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 88, "post_id": "hz99jh", "score": 1006, "subreddit": "LegalAdviceOffTopic", "text": "\"\"", "title": "Is a ticket for parking a green (but non-electric) vehicle in a spot marked “reserved for green vehicles” enforceable in any state in the US?", "upvote_ratio": 0.99, "url": "https://i.imgur.com/WdZFLnf.jpg"}, {"author": "DivineZenith", "created_utc": 1697917503.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 122, "post_id": "17dapa9", "score": 1006, "subreddit": "LegalAdviceOffTopic", "text": "\"This was in front of me today. Granted it's good advice, but are they legally not responsible if something flys out the back of the trailer and breaks my windshield? Seems like nothing more than theatrical scare tactics. Nothing happened, just seems silly to have that sticker.\"", "title": "Does this sticker hold any real protection?", "upvote_ratio": 0.98, "url": "https://i.redd.it/93mdks4h0mvb1.jpg"}, {"author": "HonestShyster", "created_utc": 1588860213.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 65, "post_id": "gf74oo", "score": 984, "subreddit": "LegalAdviceOffTopic", "text": "\"\"", "title": "Why is it that USA churches, which are exempt from paying federal taxes as they are considered charities, are allowed to apply for for federal aid/money which? Doesn't that money ultimately come from taxpayers?", "upvote_ratio": 0.96, "url": "https://www.npr.org/sections/coronavirus-live-updates/2020/05/06/851666065/many-houses-of-worship-have-sought-government-aid-surveys-show"}, {"author": "ScathedRuins", "created_utc": 1586312816.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 122, "post_id": "fwy0da", "score": 986, "subreddit": "LegalAdviceOffTopic", "text": "\"\"", "title": "Could he theoretically press charges after you enter a verbal agreement for permission to hit him?", "upvote_ratio": 0.99, "url": "https://i.redd.it/48uhzwdx8ir41.jpg"}, {"author": "legaladvicesavedme", "created_utc": 1545846245.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 53, "post_id": "a9qkne", "score": 980, "subreddit": "LegalAdviceOffTopic", "text": "\" I'm a long time lurker, and I just wanted to make this post to thank Legaladvice for its existence. There's nowhere really to put this on the official sub so I will put it here. I am having trouble not talking about this because it was kind of traumatic, but I learned a lot about myself and the world.\\n\\nIf  I hadn't read all the stories here, I wouldn't have known what to do on  the scariest day in my life, the day the cops showed up with a search  warrant and took my stuff.\\n\\n\\\\- I said nothing\\n\\n\\\\- I did not immediately go to the station for questioning like they wanted me to\\n\\n\\\\- I instead went directly to a criminal defense lawyer and got advice\\n\\n\\\\-  I knew I was innocent and he gave me the advice I needed to safely  interview (he suggested this after I explained to him what I thought was  going on)\\n\\n\\\\- He didn't even make me pay\\n\\n\\\\- I interviewed with the police with my counsel\\n\\n\\\\- The police closed the investigation and I got my stuff back\\n\\nSo,  this was definitely an absolute fucking nightmare, and I'm still sort  of scarred by it, but....at least everything was ok. So, thank you legal  advice for existing and at least giving me the fundamentals I needed to  protect myself and not have my life ruined over something that wasn't  my fault.\"", "title": "Legal Advice Saved My Life", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/legaladviceofftopic/comments/a9qkne/legal_advice_saved_my_life/"}, {"author": "iTrickzGG", "created_utc": 1584679883.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 15, "post_id": "flp0qw", "score": 967, "subreddit": "LegalAdviceOffTopic", "text": "\"\"", "title": "What way to feel better about the whole corona situation than with some law puns", "upvote_ratio": 0.96, "url": "https://i.redd.it/ufdaeolddrn41.jpg"}, {"author": "LengthinessAdorable1", "created_utc": 1631052420.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 60, "post_id": "pjx2k2", "score": 961, "subreddit": "LegalAdviceOffTopic", "text": "\"In the United States, [it is federally illegal to trade futures contracts on onions.](https://en.wikipedia.org/wiki/Onion_Futures_Act) A futures contract is an agreement to buy or sell something at a certain price at a time in the future.\\n\\nI bought a coupon book and received a coupon for my local grocery store which reads \\\"Buy 2 lb of onion, get 1lb for 50 cents. Expires Dec 1.\\\"\\n\\nIt would appear to me that this meets all of the conditions to qualify as an onion futures contract. It is a contract, it defines a specific price (1 lb for 50 cents), and I can use it any time in the future until December 1st. Additionally, just like any other futures contract, I had to pay for the contract, as it was part of a coupon book.\\n\\nAs we know, the compass of the law always aligns with our moral compasses, which raises the question: How do I go about reporting such immoral behavior from my grocer, if it is in fact illegal?\\n\\n>!That last part is a joke, by the way.!<\"", "title": "Is my grocer violating the Onion Futures Act?", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/legaladviceofftopic/comments/pjx2k2/is_my_grocer_violating_the_onion_futures_act/"}, {"author": "CloverBun", "created_utc": 1611943468.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 56, "post_id": "l7zend", "score": 954, "subreddit": "LegalAdviceOffTopic", "text": "\"\"", "title": "Human has set my meals on a timer; I think she is trying to starve me. I tried the appeals process but got nowhere. What are my optons?", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/legalcatadvice/comments/l7lcwe/human_has_set_my_meals_on_a_timer_i_think_she_is/?utm_source=share&utm_medium=ios_app&utm_name=iossmf"}, {"author": "channingman", "created_utc": 1587320918.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 13, "post_id": "g4cof3", "score": 950, "subreddit": "LegalAdviceOffTopic", "text": "\"\"", "title": "I found it! The definition of attractive nuisance", "upvote_ratio": 0.97, "url": "https://i.redd.it/66rd632jitt41.jpg"}, {"author": "Herbivorus_Rex", "created_utc": 1591362598.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 113, "post_id": "gx49ze", "score": 917, "subreddit": "LegalAdviceOffTopic", "text": "\"\"", "title": "“Heavily armed men who refuse to identify themselves are patrolling the streets of Washington, DC. They were sent by the Bureau of Prisons.” Are these men legally bound to explain who they are if asked?", "upvote_ratio": 0.98, "url": "https://www.businessinsider.com/unidentified-prison-agents-patrol-dc-amid-protests-curfew-2020-6"}, {"author": "ops-name-checks-out", "created_utc": 1561570722.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 1, "post_id": "c5st3p", "score": 900, "subreddit": "LegalAdviceOffTopic", "text": "\"The_Donald has been quarantined.  No this doesn't violate the First Amendment.  No this doesn't violate any other law.  No this doesn't violate the Reddit TOS.\\n\\nWe will not be discussing the reasons for the quarantine or the legality of the quarantine beyond this.  Sorry, people have proven they cannot be civil about this matter.\"", "title": "The_Donald quarantine Mega Thread", "upvote_ratio": 0.89, "url": "https://www.reddit.com/r/legaladviceofftopic/comments/c5st3p/the_donald_quarantine_mega_thread/"}, {"author": "None", "created_utc": 1564299927.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 25, "post_id": "cit5w8", "score": 893, "subreddit": "LegalAdviceOffTopic", "text": "\"\"", "title": "I just realized that the frequent use of \"LAOP\" in r/bestoflegaladvice doesn't actually imply that like half of the submitters are from Los Angeles.", "upvote_ratio": 0.94, "url": "https://www.reddit.com/r/legaladviceofftopic/comments/cit5w8/i_just_realized_that_the_frequent_use_of_laop_in/"}, {"author": "iTrickzGG", "created_utc": 1621107274.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 61, "post_id": "nd6og4", "score": 895, "subreddit": "LegalAdviceOffTopic", "text": "\"\"", "title": "Out of curiosity, is this legal? 😂", "upvote_ratio": 0.98, "url": "https://i.redd.it/fk1u12lp6cz61.jpg"}, {"author": "richunclepennybags27", "created_utc": 1596053859.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 57, "post_id": "i07uqp", "score": 890, "subreddit": "LegalAdviceOffTopic", "text": "\"\"", "title": "Is this legal?", "upvote_ratio": 0.98, "url": "https://i.redd.it/jznchav0uud51.jpg"}, {"author": "loginheremahn", "created_utc": 1697058439.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 162, "post_id": "175oylk", "score": 888, "subreddit": "LegalAdviceOffTopic", "text": "\"You ask for the cheque, then sit and wait. 30 minutes. An hour. Two hours. You've gotten up and gone to the kitchen multiple times but they shoo you away every time. Staff keeps telling you they're too busy to deal with you. What do you do? You can't just leave, legally, so what can you do?\"", "title": "What would happen if a restaurant just doesn't bring you the cheque after eating?", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/legaladviceofftopic/comments/175oylk/what_would_happen_if_a_restaurant_just_doesnt/"}, {"author": "ianp", "created_utc": 1570197335.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 34, "post_id": "dd7ow9", "score": 886, "subreddit": "LegalAdviceOffTopic", "text": "\"\"", "title": "*unzips*", "upvote_ratio": 0.97, "url": "https://i.imgur.com/Q3fyA3B.jpg"}, {"author": "krytton", "created_utc": 1655227590.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 47, "post_id": "vc8p4n", "score": 874, "subreddit": "LegalAdviceOffTopic", "text": "\"\"", "title": "Is this meme about screwing with HOAs true or is it just batty sovereign citizenry?", "upvote_ratio": 0.96, "url": "https://i.imgur.com/ECTbxm2.jpg"}, {"author": "yairina", "created_utc": 1598099891.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 115, "post_id": "iehp74", "score": 872, "subreddit": "LegalAdviceOffTopic", "text": "\"\"", "title": "Who is responsible for damages? Farmer who owned the cows and looked to his best ability? Or aunt who was meant to check on the property but never did?", "upvote_ratio": 0.99, "url": "https://i.redd.it/s0ohc55ytji51.jpg"}, {"author": "Ethas", "created_utc": 1605893811.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 76, "post_id": "jxtj8u", "score": 872, "subreddit": "LegalAdviceOffTopic", "text": "\"\"", "title": "what would be the legal ramifications of this? what would be the charges?", "upvote_ratio": 0.97, "url": "https://i.redd.it/ro480cw9lf061.jpg"}, {"author": "None", "created_utc": 1594948721.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 116, "post_id": "hsmjvs", "score": 861, "subreddit": "LegalAdviceOffTopic", "text": "\"\"", "title": "Is this legal? Seems like it shouldn’t be", "upvote_ratio": 0.94, "url": "https://i.redd.it/j734b5mwjbb51.jpg"}, {"author": "Khayeth", "created_utc": 1614117665.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 123, "post_id": "lquax0", "score": 859, "subreddit": "LegalAdviceOffTopic", "text": "\"\"", "title": "Landlord 'evcits' sleeping tenants by tying them up and dumping them in rural cemetery. Shamelessly stolen from my local subreddit.", "upvote_ratio": 0.99, "url": "https://www.timesunion.com/news/article/Albany-landlord-tied-up-evicted-sleeping-15972981.php?utm_campaign=CMS%20Sharing%20Tools%20(Premium)&utm_source=t.co&utm_medium=referral"}, {"author": "thatcrazycarl", "created_utc": 1568522079.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 154, "post_id": "d4fynz", "score": 855, "subreddit": "LegalAdviceOffTopic", "text": "\"             EDIT: Thank you guys so much! I never  Expected this much input or help, We will be doing it this weekend, and then I'll be back to share the video  with you guys!\\n\\nA friend and I just made a single cab pickup totally waterproof, and filled it with water (we put stuff in there to displace as much water as possible).\\n\\nWe are going to drive wearing scuba gear, we have the roof cut out, we have seatbelts and a camera and monitor just in case we couldn't see through the window.\\n\\nIts registered and insured. Plan is to drive 5 MPH slowly through town (with friends driving in front and back)\\n\\nWhat is the worst trouble we could get into if we get pulled over by police?\\n\\n Throttle and break work pedals work (we just had to use heavier return springs). We removed wiring and put starter/ignition/blinker switches on top of cab. + we welded tabs and put support straps spanning windows.\\n\\nAnd after much much caulking/welding and a plastic liner it holds water.\\n\\nWe are strictly trying to figure out if we can do this without getting in alot of trouble now.\"", "title": "What's the worst that they'll do?", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/legaladviceofftopic/comments/d4fynz/whats_the_worst_that_theyll_do/"}, {"author": "SassySavcy", "created_utc": 1653747513.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 46, "post_id": "uzoa88", "score": 841, "subreddit": "LegalAdviceOffTopic", "text": "\"So, 2 friends and I just left on a short road trip and we\\u2019re talking about Elton John. One friend mentioned the story about how EJohn had requested permission to build a home in Monaco but was denied due to being gay. \\n\\nSo instead, he bought property that was right on the border, and built his home looking down onto Monaco. \\n\\nFrom there we got into the following discussion:\\n\\nIf EJohn (or anyone, I suppose) built his house literally up to the border of Monaco, and the side that faced it was a huge window.. if he stood naked, masturbating so that anyone in Monaco could see it but was entirely inaccessible to see in France.. what would happen?\\n\\nI\\u2019m assuming masturbating in public is not legal in Monaco, but he wouldn\\u2019t technically *be* in Monaco, just seen from there. \\n\\nIt\\u2019s not legal in France, but he\\u2019s in his private residence and the only way to see it would be to step into Monaco. \\n\\nAgain, my apologies. I can\\u2019t believe we were actually debating this. \\n\\nSo, does anyone know?\\n\\nEdit: thank you all for the serious answers on this very ridiculous question. I enjoyed reading every single one!\\n\\nEdit 2: And if Mr. John should ever become aware of this thread, I would like to emphatically stress that I don\\u2019t think he would ever masturbate in a window overlooking Monaco. \\n\\nOr I might just deny having asked this question at all.\"", "title": "I’m so sorry, stupidest question I’ve ever asked.. Elton John and public obscenity across borders?", "upvote_ratio": 0.99, "url": "https://www.reddit.com/r/legaladviceofftopic/comments/uzoa88/im_so_sorry_stupidest_question_ive_ever_asked/"}, {"author": "tsudonimh", "created_utc": 1643060842.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 92, "post_id": "sbxhl1", "score": 836, "subreddit": "LegalAdviceOffTopic", "text": "\"Short background - Seven employees of ThedaCare (technicians and nurses) gave their notice in December, with their last day being January 21st. ThedaCare filed in court to prevent the employees from gainful employment, demanding that they continue to work until replacements were found and trained.\\n\\nThe judge signed a TRO on Friday afternoon preventing the employees from starting work, and scheduled a full hearing for Monday morning.\\n\\nAscention, the new employer, filed an epic response, which started out with the adage \\\"Your failure to prepare is not my personal emergency\\\".\\n\\nThe judge agreed, and lifted the TRO. The employees are at work at their new employer.\"", "title": "ThedaCare's attempt to override the thirteenth amendment has been denied.", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/legaladviceofftopic/comments/sbxhl1/thedacares_attempt_to_override_the_thirteenth/"}, {"author": "Prestigious-Host-506", "created_utc": 1699683448.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 61, "post_id": "17sohyq", "score": 833, "subreddit": "LegalAdviceOffTopic", "text": "\"Saw this floating around on FB. Is this legal? What are the repercussions?\"", "title": "Removing watermarks from school photos", "upvote_ratio": 0.97, "url": "https://i.redd.it/sy651t9jvnzb1.jpg"}, {"author": "imnewhere1023", "created_utc": 1592184590.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 62, "post_id": "h969q0", "score": 826, "subreddit": "LegalAdviceOffTopic", "text": "\"\"", "title": "[Hypothetical] Would I legally be able to write this novel? Since ideas aren't copyrighted, and Stephen King claims he's never going to write this. Does this tweet, and do tweets in general, count as intellectual property?", "upvote_ratio": 0.98, "url": "https://i.redd.it/wgdtwe3c8z451.png"}, {"author": "Ramen_noodles_rock", "created_utc": 1622389218.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 167, "post_id": "nodrpd", "score": 817, "subreddit": "LegalAdviceOffTopic", "text": "\"\"", "title": "Jest wondering if this is legal?", "upvote_ratio": 0.96, "url": "https://i.redd.it/2o59ou9l2a271.jpg"}, {"author": "bug-hunter", "created_utc": 1619123308.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 43, "post_id": "mwdza0", "score": 807, "subreddit": "LegalAdviceOffTopic", "text": "\"\"", "title": "The Tampa Tribune, Florida, April 1, 1939...", "upvote_ratio": 0.99, "url": "https://i.redd.it/to2011q8bsu61.png"}, {"author": "Sleep_adict", "created_utc": 1598645363.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 177, "post_id": "iiehjf", "score": 801, "subreddit": "LegalAdviceOffTopic", "text": "\"\"", "title": "N.J. teen who held Black Lives Matter protest gets hit with $2,500 bill for police overtime. How can this be legal?", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/politics/comments/iiclno/nj_teen_who_held_black_lives_matter_protest_gets/?utm_source=share&utm_medium=ios_app&utm_name=iossmf"}, {"author": "Science_at_dusk", "created_utc": 1703365950.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 97, "post_id": "18pf6y4", "score": 796, "subreddit": "LegalAdviceOffTopic", "text": "\"I was wondering if you could legally just keep all of the pennies in a vault if you repeatedly requested them all from banks all over the country continuously?  Not to destroy or deface them, but after a while of getting them all, is there anything stopping me from draining the US economy for as many pennies as possible?\"", "title": "If I had the 1.4 billion dollars to do it, could I legally take all of the pennies out of circulation?", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/legaladviceofftopic/comments/18pf6y4/if_i_had_the_14_billion_dollars_to_do_it_could_i/"}, {"author": "ironardin", "created_utc": 1588059802.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 57, "post_id": "g9ivno", "score": 792, "subreddit": "LegalAdviceOffTopic", "text": "\"\"", "title": "Is this legal? Would be really weird if it was.", "upvote_ratio": 0.97, "url": "https://i.redd.it/sde2ne2mjiv41.jpg"}, {"author": "chinchillazilla54", "created_utc": 1576126259.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 146, "post_id": "e9ixpd", "score": 780, "subreddit": "LegalAdviceOffTopic", "text": "\"A neighbor brought a starving kitten to my doorstep in the summer of 2008, asking if she was mine. She wasn't, but I took her in. I put up some signs and a Craigslist post, but no one ever contacted me. In the meantime she made fast friends with my other two kittens of the same age.\\n\\nEventually I took her to the vet to get her spayed. They put her under and then realized she already had been spayed, but the scar was so well-healed they couldn't find it until they shaved her belly. They also scanned her for a microchip and told me there was nothing. Then I had her chipped and that was that.\\n\\nFast forward to today, when she had some dental work done. Somehow microchips came up. I couldn't remember if I had had her chipped, or if it had just been the other two kittens, and asked them to check. They found *two* chips. One is mine and one... is not. They gave me the brand information and chip number so I can maybe contact her original owner(s) and let them know she's alive and happy and has friends. I'm definitely gonna try to let them know she's alive and happy, because I would absolutely want to know that if the roles were reversed.\\n\\nBut that's not that fun of a story, so give me your nightmare scenarios and lay out all the ways this could go horribly, horribly wrong.\\n\\n[Cat tax.](https://imgur.com/BPG3eu7)\"", "title": "Found out my cat was already microchipped after owning her for over a decade, so let's play the Worst Case Scenario game!", "upvote_ratio": 0.99, "url": "https://www.reddit.com/r/legaladviceofftopic/comments/e9ixpd/found_out_my_cat_was_already_microchipped_after/"}, {"author": "bug-hunter", "created_utc": 1598451636.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 25, "post_id": "igzprl", "score": 777, "subreddit": "LegalAdviceOffTopic", "text": "\"\"", "title": "Every time someone says something wrong about HIPAA, Harry the HIPPA Hippo gets bigger. And now it has taken flight. (MS Flight Simulator 2020)", "upvote_ratio": 0.94, "url": "https://i.redd.it/205xb04rvcj51.png"}, {"author": "hojokono", "created_utc": 1575601199.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 73, "post_id": "e6sil8", "score": 774, "subreddit": "LegalAdviceOffTopic", "text": "\"\"", "title": "I watch a few coppyright lawyers on youtube beacuse i find the cases facinating ..... My friend:", "upvote_ratio": 0.96, "url": "https://i.redd.it/evowacxtex241.jpg"}, {"author": "disclosurecalvin", "created_utc": 1556654624.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 0, "post_id": "bj7vjf", "score": 774, "subreddit": "LegalAdviceOffTopic", "text": "\" link: [https://www.reddit.com/r/legaladvice/comments/9gd5dw/21m\\\\_i\\\\_was\\\\_arrested\\\\_last\\\\_night\\\\_and\\\\_charged\\\\_with\\\\_an/](https://www.reddit.com/r/legaladvice/comments/9gd5dw/21m_i_was_arrested_last_night_and_charged_with_an/)\\n\\nSomeone asked to be kept up to date with the result. The OWI charge was \\\"lessened?(not sure of the exact term)\\\" to a Public intox. When my lawyer reviewed the bodycam, he found that after the officer had put me in the vehicle the guy then went to briefly turn on the car then back off before retrieving the key. Lawyer said it that it was just barely visible in the corner of the vid, but it was the key to proving that the engine wasn't running and thus \\\"I couldn't actually operate the vehicle\\\". Glad that that one was cleared, especially since it is a criminal offence in my state. Still have some lingering issues from the arrest however, even with the OWI not sticking, my driving privileges have been revoked (didn't learn that till this weekend when I was turned down for a job, awesome aha) as well as me having to have a unique insurance fee that needs to be paid. I'll be taking a $200 drink-driving class as it is needed for me to reinstate my license, wondering if that is something I should ask my lawyer to contest as per the result of the case. Also it'd be nice to have some information on contacting a judge to have the info of the OWI arrest itself expunged. Also would greatly appreciate any info on how to remove my mugshot from the internet, had a date bring it up on her phone, kinda laughed it off but would love to get rid of it . In the last couple of months, I've had some random girl that I dont even know msg my friend about me being in the daily blotter, a dude randomly came up to me in our school bar and told me that he remembers seeing me get arrested (The school I go to is a lil over 3hours from his school which is the town in where the arrest happened), and have had my cousins bantering and teasing me for the whole ordeal. All in all, bullet dodged I guess, aha my lawyer told me that he thought I was bs-ing until he saw the bodycam, apparently he's heard the \\\"car wasn't running story\\\" alot. No long lasting damage done(hopefully) , just my ego is still a bit hurt from the whole situation aha.\\n\\ntldr: OWI was lessened to a public intox, still trying to tie up the ordeal and move forwards.\"", "title": "UPDATE: 21(M) I was arrested last night and charged with an OWI. I was literally just lying in my car charging my phone. What are the chances I'm convicted as guilty? What happens next from here?", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/legaladviceofftopic/comments/bj7vjf/update_21m_i_was_arrested_last_night_and_charged/"}, {"author": "Napalmenator", "created_utc": 1537541263.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 27, "post_id": "9hqn1w", "score": 761, "subreddit": "LegalAdviceOffTopic", "text": "\"\"", "title": "TREE LAW!!!!", "upvote_ratio": 0.98, "url": "https://imgur.com/TJbs0x2"}, {"author": "limbodog", "created_utc": 1585342297.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 86, "post_id": "fq5ggf", "score": 746, "subreddit": "LegalAdviceOffTopic", "text": "\"It seems to me that the latter, say, Hobby Lobby, is far more likely to result in infections and death than the former.\"", "title": "Why is licking bottles of hand sanitizer at a store a \"terrorist threat\" but making non-essential employees go to work without protection is not?", "upvote_ratio": 0.88, "url": "https://www.reddit.com/r/legaladviceofftopic/comments/fq5ggf/why_is_licking_bottles_of_hand_sanitizer_at_a/"}, {"author": "wasimoto", "created_utc": 1596715204.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 93, "post_id": "i4qil3", "score": 742, "subreddit": "LegalAdviceOffTopic", "text": "\"The SFRA states that religious liberties can only be limited by \\u201cthe least restrictive means to further compelling government interest.\\u201d Would this decision from the Satanic Temple exclude its members from most abortion restrictions such as typical viability limits (I.e. third trimester) or parental consent.\\n\\nHere\\u2019s a local article on it\\n\\nhttps://kutv.com/news/nation-world/satanic-temps-says-religious-freedoms-exempt-abortion-rights-from-state-laws\"", "title": "The Satanic Temple recently had abortion made as a protected religious act according to the States Freedom Restoration Acts.", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/legaladviceofftopic/comments/i4qil3/the_satanic_temple_recently_had_abortion_made_as/"}, {"author": "hearmequack", "created_utc": 1559663069.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 212, "post_id": "bwq7gb", "score": 741, "subreddit": "LegalAdviceOffTopic", "text": "\"I have a professor who is requiring all students to buy the syllabus for the class from the bookstore for $15. He's also requiring us to buy the book he wrote as required text for the class, but that's something else completely. He made it clear in the email he sent out that everyone *must* purchase the syllabus - we're not allowed to have one person buy it and make copies - and that having the syllabus will be worth a weekly grade. It's enough points that not buying it will bring you down one letter grade by the end of the year. It just seems odd to me that we now have to *pay* for a syllabus when it's something professors have always just given to us.\"", "title": "Forcing students to purchase the syllabus?", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/legaladviceofftopic/comments/bwq7gb/forcing_students_to_purchase_the_syllabus/"}, {"author": "roraima_is_very_tall", "created_utc": 1609974405.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 251, "post_id": "krzmm9", "score": 729, "subreddit": "LegalAdviceOffTopic", "text": "\"\"", "title": "The woman who was shot in the Capitol died. She and the protestors with her were breaking multiple federal laws. Are most if not all of the protestors who were inside liable for a murder charge under the felony murder rule?", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/legaladviceofftopic/comments/krzmm9/the_woman_who_was_shot_in_the_capitol_died_she/"}, {"author": "sensitivity001", "created_utc": 1551333405.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 57, "post_id": "avnl7s", "score": 736, "subreddit": "LegalAdviceOffTopic", "text": "\"\"", "title": "Inspired by a BOLA comment & weird trends lately: LegalAdvice Bingo!", "upvote_ratio": 0.99, "url": "https://i.redd.it/skrihqzfz8j21.png"}, {"author": "None", "created_utc": 1604788466.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 140, "post_id": "jpzwsf", "score": 735, "subreddit": "LegalAdviceOffTopic", "text": "\"My assumption is that it won't - because the DFWA can still test for Schedule II drugs, but I wanted to confirm.\"", "title": "President-elect Biden has stated that he plans to downgrade Cannabis as a Schedule II drug. Will this have any affect on federal employees subject to drug tests under the Drug Free Workplace Act?", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/legaladviceofftopic/comments/jpzwsf/presidentelect_biden_has_stated_that_he_plans_to/"}, {"author": "ConfidentBro", "created_utc": 1568145964.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 75, "post_id": "d2diym", "score": 729, "subreddit": "LegalAdviceOffTopic", "text": "\"I'm a graduate student. I go to a top 10 institution, well-known named school and the professor strayed away from the syllabus and is now requiring a PDF to be bought as a class requirement. \\n\\nThe catch is we cannot even use electronics during lecture. But he requires the contents of the PDF to be readily available in class so I was forced to print all 250 pages today. Now I wasn't so ticked off until I looked at the syllabus again and noticed the original textbook listed only costs $35 but he required this expensive as hell pdf.\\nI also felt like a moron at the library printing nearly 300 pages and saw the printer told me my environmental impact was killing off 3% of a tree and the equivalent of leaving a light bulb on for 200 hours.\\n\\nAnyway, is there anything I can do? This is absurd and I've paid 150 for a brick textbook before but never a damn PDF that I had to print myself. Usually these professor course packs are only required chapters that cost under 50. I know it's \\\"only\\\" a hundred compared to the entire cost of my education but I seriously feel extorted.\"", "title": "Professor requires PDF textbook ($150) but also disallows electronics in class", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/legaladviceofftopic/comments/d2diym/professor_requires_pdf_textbook_150_but_also/"}, {"author": "sapnupuas_0", "created_utc": 1648306971.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 208, "post_id": "toscok", "score": 722, "subreddit": "LegalAdviceOffTopic", "text": "\"\"", "title": "how illegal is this?", "upvote_ratio": 0.96, "url": "https://v.redd.it/xmmkgbwctqp81"}, {"author": "TimTheGecko", "created_utc": 1612973754.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 132, "post_id": "lgx2ex", "score": 722, "subreddit": "LegalAdviceOffTopic", "text": "\"\"", "title": "Would it be illegal if I started a pseudonymous Twitter account that replied to every single tweet by the Saudi Government with damning information about their royal family and my account displayed this image plus a Venmo address?", "upvote_ratio": 0.96, "url": "https://i.redd.it/bbk7spskdog61.jpg"}, {"author": "mlpr34clopper", "created_utc": 1578544773.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 99, "post_id": "em4pt6", "score": 721, "subreddit": "LegalAdviceOffTopic", "text": "\"\"", "title": "Child molester’s wife sues Mormon church for $9.5 million, says husband is in prison because clergy reported his confession. How could this possibly be successfully argued? Full question in comments.", "upvote_ratio": 0.98, "url": "https://www.oregonlive.com/news/2020/01/child-molesters-wife-sues-mormon-church-for-95-million-says-husband-is-in-prison-because-clergy-reported-his-confession.html"}, {"author": "skunkboy72", "created_utc": 1616526151.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 178, "post_id": "mbm1wl", "score": 712, "subreddit": "LegalAdviceOffTopic", "text": "\"\"", "title": "How is this not age discrimination?", "upvote_ratio": 0.93, "url": "https://i.redd.it/wlle63ig3so61.jpg"}, {"author": "bolivar-shagnasty", "created_utc": 1621005068.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 169, "post_id": "ncaw5h", "score": 705, "subreddit": "LegalAdviceOffTopic", "text": "\"There have been a series of thefts in my region due to the reduced availability of gasoline. \\n\\nA neighbor posted a meme about leaving a gas can filled with sugar water in visible place on his property and letting the thieves roll the dice on damaging their vehicle. \\n\\nI understand that boobytraps and man traps are illegal, but is something like this illegal? Would there be a case against my neighbor in civil court?\"", "title": "If I leave a gas can filled with water and sugar in my driveway and it gets stolen, am I liable for the damage to the thief’s vehicle? (Alabama)", "upvote_ratio": 0.99, "url": "https://www.reddit.com/r/legaladviceofftopic/comments/ncaw5h/if_i_leave_a_gas_can_filled_with_water_and_sugar/"}, {"author": "rachelmaryl", "created_utc": 1612456587.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 54, "post_id": "lcjnnn", "score": 694, "subreddit": "LegalAdviceOffTopic", "text": "\"Background: I have a 3-year-old who is currently obsessed with \\\"The Aristocats.\\\" We have watched it dozens of times, and I keep wondering about the butler, Edgar, who basically throws away his shot at a fortune.\\n\\nThe film's plot is driven around Madame Adelaide, a rich socialite with no living relatives. Early in the film, she indicates to her lawyer she would like to write her will. While dictating her wishes to her lawyer, she states that she wants to ensure her cats are always well cared for, and no one can do that better than Edgar. However, she clarifies that her mansion, country chateau, stocks, bonds, jewelry and possessions are to go to her four cats first, and after the cats have passed, then the estate will revert to Edgar.\\n\\nEdgar does some haphazard math, and comes to the quick conclusion that the cats will outlive him, rendering the inheritance useless to him. He decides then to kidnap the cats and abandon them in the French countryside, with the hopes/intentions that Madame will change her will, so the estate goes to him first.\\n\\nMy question is this: even if the cats inherit first, would Edgar be able to live a life of luxury anyway? As the audience, we aren't given the specifics of how Madame wants Edgar to care for the cats, only that \\\"they're well cared for.\\\" INAL, but it would seem to me that Edgar could more or less still live a life of luxury, while still caring for the cats. I guess it's also important to note this takes place in France, in the early 1900s.\\n\\n[Film Clip, for anyone wondering](https://www.youtube.com/watch?v=QE9UpIfNGdw)\\n\\nEDIT: Thanks for the upvotes and the awards! It seems that a post to AskHistorians is in order, to get more information about Napoleonic Law, which I will do tomorrow. \\n\\nAlso, in true form to the film, I\\u2019ll be making a donation tomorrow to help homeless cats in my area - if you were considering an award, please consider donating to an animal shelter instead!\"", "title": "In Disney's film \"The Aristocats,\" after hearing his employer will leave her estate to her cats first and then him, the antagonist butler kidnaps and then abandons the cats in the French countryside. Could Edgar have lived luxuriously if he had accepted her wishes, with the cats inheriting first?", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/legaladviceofftopic/comments/lcjnnn/in_disneys_film_the_aristocats_after_hearing_his/"}, {"author": "radiationkills", "created_utc": 1612829072.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 380, "post_id": "lfpoy8", "score": 691, "subreddit": "LegalAdviceOffTopic", "text": "\"Context: Tessica Brown ran out of Got2BGlued hair glue spray (safe for hair and skin) and decided to use Gorilla Glue industrial strength adhesive spray instead. It has now been a month and she cannot wash the product out of her hair, as it has bonded to her scalp. She is in immense pain and has posted videos of her going to the ER and trying (and failing) to remove the glue from her hair/scalp using acetone. She is now considering suing Gorilla Glue, stating that even though the products state they are not to be used on skin, eyes or clothing it does not state it should not be used on hair. She claims this is misleading info and that the product states it is \\u201cmulti-use\\u201d. Gorilla Glue has issued statements that this is not the intended use and its products are for wood, metal, fabric and other surfaces for craft projects.\\n\\nDoes she have a case at all from a liability perspective?\"", "title": "Does Gorilla Glue Girl have any shot at winning a lawsuit against Gorilla Glue for spraying their products on her head?", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/legaladviceofftopic/comments/lfpoy8/does_gorilla_glue_girl_have_any_shot_at_winning_a/"}, {"author": "dangnormies", "created_utc": 1586745991.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 41, "post_id": "g0aaot", "score": 695, "subreddit": "LegalAdviceOffTopic", "text": "\"\"", "title": "Is having your will go to whoever catches the most of your ashes contractually enforceable as a will?", "upvote_ratio": 0.98, "url": "https://i.redd.it/q6zq1n6z0is41.jpg"}, {"author": "sunnyhappysky", "created_utc": 1683790615.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 87, "post_id": "13eg82m", "score": 677, "subreddit": "LegalAdviceOffTopic", "text": "\"\"", "title": "Found this on Reddit, is it even legal to do this?", "upvote_ratio": 0.92, "url": "https://i.redd.it/em6hydgz57za1.jpg"}, {"author": "Go_To_Bethel_And_Sin", "created_utc": 1591210049.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 194, "post_id": "gvzwc1", "score": 678, "subreddit": "LegalAdviceOffTopic", "text": "\"[Source](https://twitter.com/StarTribune/status/1268238841749606400?s=20)\\n\\n\\nIANAL, but my understanding of Minnesota\\u2019s murder statutes is as follows:\\n\\n\\n>1st degree: Premeditation & intent\\n\\n\\n>2nd degree: Intent w/o premeditation\\n\\n\\n>3rd degree: Acting negligently and without regard for human life in a way that kills someone without intent or premeditation\\n\\n\\nIf this is the case (and please correct me if I\\u2019m wrong), it seems to me that it would be easier to convict Chauvin of 3rd degree murder than 2nd, because I\\u2019m not sure how the prosecution could prove that he *intended* to kill George Floyd as opposed to simply subduing him using excessive force. \\n\\n\\nHow do you think the prosecutors will try to prove intent in this case?\\n\\n\\nDo you agree with my assessment that upgrading from 3rd to 2nd degree murder makes a conviction more difficult to secure?\\n\\n\\nI\\u2019m curious to hear any other thoughts you have on this.\"", "title": "The charge against Derek Chauvin was just upgraded from 3rd degree murder to 2nd degree. Given the details of his case, how does this impact the likelihood of a conviction?", "upvote_ratio": 0.99, "url": "https://www.reddit.com/r/legaladviceofftopic/comments/gvzwc1/the_charge_against_derek_chauvin_was_just/"}, {"author": "None", "created_utc": 1660478314.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 104, "post_id": "wo4ow3", "score": 684, "subreddit": "LegalAdviceOffTopic", "text": "\"\"", "title": "I know this is stupid but what is wrong with this?", "upvote_ratio": 0.96, "url": "https://i.redd.it/bsjf77v05oh91.jpg"}]