[{"author": "FinalDraftResumes", "created_utc": 1642006861.0, "link_flair_template_id": "f54d73ce-28b9-11ec-bd91-1eac593353f0", "link_flair_text": "I'm sharing advice", "num_comments": 111, "post_id": "s2b37q", "score": 3614, "subreddit": "resumes", "text": "\"\"", "title": "If you’re applying online, use a single column resume.", "upvote_ratio": 1.0, "url": "https://i.redd.it/qyc8a5qwfab81.jpg"}, {"author": "seeeeeeeeeeeeeeed", "created_utc": 1668620021.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 88, "post_id": "yx0586", "score": 2946, "subreddit": "resumes", "text": "\"\"", "title": "My man used Amazon themed CV to get the attention at Amazon Lmao", "upvote_ratio": 0.98, "url": "https://i.redd.it/wzkuyc26mc0a1.jpg"}, {"author": "tenemu", "created_utc": 1610505046.0, "link_flair_template_id": "a3643b7a-8ae9-11e5-bea4-0e0467040b93", "link_flair_text": "Discussion", "num_comments": 239, "post_id": "kw6xie", "score": 2283, "subreddit": "resumes", "text": "\"Sorry if this post is against the rules. \\n\\nI am a hiring manager and have been going through lots of resumes.  Please put your full name as the name of the file you attach.  \\n\\nFirstLast.pdf \\n\\nI receive large groups of resumes from my recruiter and when I am looking at 100 resumes, at least 25 of them are labeled as \\u201cresume.pdf\\u201d, or some other basic title. This makes it hard to find and share your resumes.  Also, please don\\u2019t put \\u201cfinal\\u201d or any version number either. \\n\\nEven better if you put the title in the resume too. \\n\\nFirst Last Engineering Technician.pdf\\n\\nI saw that once and I liked it. \\n\\nBest of luck out there!\"", "title": "Please stop saving your resumes as “resume.pdf”", "upvote_ratio": 0.99, "url": "https://www.reddit.com/r/resumes/comments/kw6xie/please_stop_saving_your_resumes_as_resumepdf/"}, {"author": "linen-thread", "created_utc": 1670814689.0, "link_flair_template_id": "68336c78-16bb-11ed-81ea-020fc04d0e6d", "link_flair_text": "Success Story", "num_comments": 32, "post_id": "zjkz7a", "score": 2119, "subreddit": "resumes", "text": "\"Glad my spree of 300+ applications is over for a while.\"", "title": "Thank you all for your help! It worked so well.", "upvote_ratio": 0.98, "url": "https://i.redd.it/wtyft9bwdf5a1.jpg"}, {"author": "RFGunner", "created_utc": 1684234945.0, "link_flair_template_id": "f54d73ce-28b9-11ec-bd91-1eac593353f0", "link_flair_text": "I'm sharing advice", "num_comments": 360, "post_id": "13j1ztu", "score": 1618, "subreddit": "resumes", "text": "\"I've been helping people on this subreddit for months and have seen people use terrible off-the-wall templates for non-art related jobs and figured those that have been successful and getting interviews and jobs should start sharing what their [resume](https://imgur.com/a/v96Luz8) looked like to get them to that position.   \\n\\n\\nI used this format to apply to about 8 jobs. Of those 8, 6 emailed me within days of applying for an interview. A CEO of a small contracting company also reached out to me when I added my resume on Monster. I'm not saying my resume is perfect (looking at it now, there are small things I want to change on it), and I'm not trying to brag. I just want to show that I must have done something correctly to just about get an interview anytime I applied, and I think it is because my resume is ATS-friendly and not cluttered.\\n\\nSo here is ONE of the resumes I created. Note that I actually made multiple resumes. For those that just made ONE resume and are trying to shotgun it to every job listing you see on Linkedin, or any other job board and have not heard a peep from any company, You might want to reevaluate our approach. You should be tailoring your resume to the job post. The Wiki mentions this, I believe.\\n\\n&#x200B;\\n\\nIf anyone would like, I can go over how exactly I created my resume according to the job post, either here on in a separate post.\\n\\nNow I will explain my resume format:\\n\\n**TITLE**\\n\\nThe title of your resume should be your job title. Plumber, Senior Electrician, Front-end developer, McDonald's Shift Lead, whatever. Generally, it's something people can understand from reading alone. My job title is what I had in the military and I couldn't think of a better one to use to cover all the radio things I've worked on so I kept it in. Normally the job title is also what you are applying for.\\n\\n**Summary**\\n\\nSummaries are supposed to be a short 3-5 line \\\"elevator pitch\\\". I strongly recommend you use a summary as it helps highlight and explain who you are and what you provide to the company. After I finished my interviews, I asked what helped my resume stand out and everyone said it was my summary. It's a little long, but I wanted to capture just exactly what I work on and also tailor it to the job post I was applying for. \\\\*Notice how I DO NOT have personal pronouns in my summary.\\\\*\\n\\n**Hard Skills**\\n\\nSo the section with bullet points is where I put my hard skills.  Hard skills are abilities that let you tackle job-specific duties and responsibilities. Hard skills can be learned and are job specific. They are NOT personality traits such as hardworking, organized, or time management. Those type of skills belong in a summary, in my opinion. You DO NOT type out a sentence for each skill. I keep seeing new people try to write a paragraph for each skill trying to explain how they got it or how they demonstrated it. Ideally, your work bullets will reflect some of these hard skills. A job post will have some listed that you can add if you're paying attention. I have slightly different summaries on my other resumes as well.\\n\\n**Certifications**\\n\\nThis field all depends on your career field. I cannot tell you what certifications you need. You should know what certification your career field requires or wants. If you don't know, start researching.  If you do have a certification, you just put the name of the cert, followed by the company that issued it and then the year you obtained it. That's it. If it is expired, renew it or remove it from your resume.\\n\\n**Professional Experience**\\n\\nNothing out of the ordinary here. I have the company I worked for (United States Air Force) and the location. I then have my job titles under it because my duties changed over the years as I promoted and moved to other locations. Your most recent job should have the most work bullets. Your oldest job and shortest job should have the least. YOUR JOB BULLETS SHOULD REFLECT THE JOB POST. If the job post is talking about working with or interacting with customers, you should mention something like this in your resume. Same for Engineers and developers. Again, creating bullets about an art project when you are applying to be a plumber makes no sense and should not be on there. \\n\\n**EDUCATION**\\n\\nThis is self explanatory. List the degree relevant to the job. A Master's degree in underwater basket weaving isn't going to do you any favors when applying to manage projects or write code. The job post will mention what degree the company is looking for as well as how much experience you need for them to waive not having a B.S. degree or M.A. degree. Some companies are very strict about it and will throw your resume away if it doesn't meet their requirements.\\n\\n**Technical Competencies**\\n\\nThis is where I would list things that I work with and am competent using. Here is where the specific radio equipment I've worked on will be listed as well as other equipment. For Networking personnel, this is where you mention the Cisco Switch, cable testers, Linux operating systems, and other things. You could also use this section for languages (code and spoken languages), software, or just anything you are competent with. THE JOB POST TELLS YOU WHAT THE COMPANY IS LOOKING FOR.   \\n\\n\\nAs I said before, this is only one of my resumes, but the format is exactly the same for all of them, even the master resume I pull my bullets from. My resume itself isn't perfect, but I believe it is easy to read and can give some new people writing a resume an idea of how a good one can or should look like. I currently have a job so I am not too focused on fixing up my resume write now, but I will add on to it over the years and tweak it every now and then so I am ready in case I need to use it again.    \\n\\n\\nFeel free to let me know your thoughts and I will be happy if I can help at least one person on here. Job search isn't always easy, and I want to help everyone succeed as long as they are willing to put in the work. Sorry in advance for typos, I'm just getting off shift and about to go drive home.\"", "title": "This Resume Got Me Interviews and A Job In Two Weeks", "upvote_ratio": 0.89, "url": "https://www.reddit.com/r/resumes/comments/13j1ztu/this_resume_got_me_interviews_and_a_job_in_two/"}, {"author": "One_Ad_6451", "created_utc": 1659330563.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 39, "post_id": "wd8wre", "score": 1559, "subreddit": "resumes", "text": "\"I was a former recruiter and this is my favorite application I came across.\"", "title": "No Resume. Just a cover letter.", "upvote_ratio": 0.99, "url": "https://i.redd.it/md58xf16c1f91.jpg"}, {"author": "FinalDraftResumes", "created_utc": 1648438009.0, "link_flair_template_id": "f54d73ce-28b9-11ec-bd91-1eac593353f0", "link_flair_text": "I'm sharing advice", "num_comments": 85, "post_id": "tq061t", "score": 1445, "subreddit": "resumes", "text": "\"Hello Team,\\n\\nAs a regular contributor to this sub, a professional resume writer, and former corporate recruiter, I'd like to share the most common mistakes I see folks make. \\n\\nThis isn't an exhaustive list and isn't in any particular order. These are big mistakes that are potentially causing you to lose out on valuable opportunities and correcting them *should* improve the overall performance of your job search.\\n\\n# #1 Using the wrong layout\\n\\nThere's already another stickied post on this subject, but I still see people committing this mistake all the time. In short, don't use a two-column resume if you're submitting through company websites or job boards (i.e., Indeed, LinkedIn etc.).\\n\\n**Why?**\\n\\n**Short answer**: Applicant Tracking Systems (ATS)\\n\\n**Longer Answer**: ATS reads your resume from top to bottom and left to right. When you add another column (or other incompatible elements for that matter, such as graphics or logos), you introduce another layer of complexity and make it harder for the system to properly read your resume. As a result, sections may get misread or not read all.\\n\\nUse a traditional, single-column format. I recommend creating your resume using Microsoft Word or Google Docs. There\\u2019s a basic Google Docs template in the wiki section of this sub - I\\u2019ll link it [here](https://docs.google.com/document/d/1wdkgpgU7lFoV801ysrBn8qrPaIpyUsUH/mobilebasic) for your convenience. \\n\\nI do not recommend using other programs such as Canva, Adobe InDesign, or Overleaf (LaTeX).\\n\\n# #2 Writing generic content\\n\\nTo begin, let me first define the term '**context**' which is going to be key here. Context is specific information that makes your resume and the descriptions within it unique to you. It allows the reader to understand and appreciate your story. A resume with zero context will sound generic - a lot like a job advertisement. Here's an extreme example:\\n\\nGeneric Statement:  \\\"*Achieved excellent sales results*\\\".\\n\\nSpecific/Contextualized Statement:  \\\"*Earned top spot in the company's 2019 national sales rankings for achieving 220% against annual sales target*\\\".\\n\\nThe second statement is much more informative and tells the audience not only what the achievement was, but also why it was earned. This is a good example of how you can use context to ensure your descriptions are quantified, specific, and informative.\\n\\nIn general, a good description will address three informational goals:\\n\\n* A **challenge** or problem to be solved. This doesn't always need to be explicitly stated. For example, in the second statement in quotes above, the problem is implied - to meet and exceed sales goals and rank high as possible on the sales charts.\\n* The **action**(s) you took to address that challenge. What did YOU do specifically. I don't care what your team or your boss did.\\n* An **outcome** that resulted as a direct result of your actions. What did your actions produce? It doesn't always need to be a monumental, earth-shattering impact, but it does need to be there.\\n\\n# #3 Failing to curate your resume to your targeted role\\n\\nIf you were to walk into your local car dealership looking for an off-road vehicle for travelling through muddy terrain and the salesperson tries to sell you on a two-door Volkswagen beetle, you'd think they weren't very good at their job.\\n\\nSo why would you do that to a prospective employer? By submitting a resume for a role it wasn't written for, you're demonstrating one of two things:\\n\\n* You don't understand the requirements of role you're applying for, OR\\n* You're too lazy to tailor your resume to the role.\\n\\nBoth of these are equally bad and often result in being ignored by the company.\\n\\n**How do you tailor your resume to the job?**\\n\\n* Step 1: Read the job posting carefully. Identify what they're looking for in terms of experience/responsibilities, skills, licenses/certifications, and education.\\n* Step 2: Put yourself in the recruiter's shoes. How quickly can you identify any given prerequisite from the job advertisement on your resume? Is it easily identifiable or do you need to dig in for several moments to find it?\\n* Step 3: Does the language used in your resume match that in the job description? Are you using the same terms?\\n\\nExample 1: Company A is requesting at least 5 years of experience doing X.  Your summary (if you include one) would begin by saying 'X Professional with 5+ years of experience in X'.\\n\\nExample 2: Company B is requesting CPR, AED, ACLS, and PALS certifications. You would include a section labelled as 'Certifications' and list these (exactly as they're presented in the ad).\\n\\n# DON'T DO THIS\\n\\n* Copy and paste the job description into your resume - it's very easy to spot and is disingenuous.\\n* Lie and/or embellish your accomplishments. You may get away with it, but if a clever hiring manager puts you on the spot, it'll be obvious (In my experience as a recruiter, I was privy to many of these situations during interviews and it doesn't look good - trust me).\\n\\nI hope you guys find this useful!\"", "title": "Biggest mistakes that impact your resume's performance and how to fix them", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/resumes/comments/tq061t/biggest_mistakes_that_impact_your_resumes/"}, {"author": "StrikingStreet3083", "created_utc": 1700191748.0, "link_flair_template_id": "3d212a9a-f5cb-11ec-acef-1adb3b338801", "link_flair_text": "I need feedback - Asia ", "num_comments": 538, "post_id": "17x5wyw", "score": 1440, "subreddit": "resumes", "text": "\"I am looking for internship to build my resume but no response this I my resume need feedback I am doing wrong\"", "title": "Need feedback 200+ jobs applied 0 responses", "upvote_ratio": 0.96, "url": "https://i.redd.it/3ga5b5vyut0c1.jpg"}, {"author": "McRibbitt", "created_utc": 1688760607.0, "link_flair_template_id": "68336c78-16bb-11ed-81ea-020fc04d0e6d", "link_flair_text": "Success Story", "num_comments": 122, "post_id": "14thyth", "score": 1331, "subreddit": "resumes", "text": "\"\"", "title": "This resume gave me a $74,000 salary job, almost doubling my salary", "upvote_ratio": 0.97, "url": "https://i.redd.it/mwhkbad6olab1.jpg"}, {"author": "Capable-229", "created_utc": 1698694631.0, "link_flair_template_id": "0348e2a0-5e50-11e5-8349-128d650819bd", "link_flair_text": "Other", "num_comments": 307, "post_id": "17k1mwb", "score": 1310, "subreddit": "resumes", "text": "\"I graduated a few years ago from Harvard College, and recently left my position at a tech startup (amicably). Currently looking for roles in tax/accounting.\\n\\nWhile applying for jobs, I\\u2019ve had several recruiters use my education against me - \\u201cthis entry level job wouldn\\u2019t suit a Harvard graduate like yourself\\u201d, \\u201chow can you not have a job lined up if you graduated from Harvard\\u201d, assuming my desired salary to be out of their range, etc.\\n\\nI might be playing the world\\u2019s smallest violin here, or I may not be leveraging the advantage everyone\\u2019s telling me I have. Thoughts?\"", "title": "Thinking of omitting Harvard from my resume.", "upvote_ratio": 0.94, "url": "https://www.reddit.com/r/resumes/comments/17k1mwb/thinking_of_omitting_harvard_from_my_resume/"}, {"author": "shookitoff", "created_utc": 1568200585.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 94, "post_id": "d2ohel", "score": 1238, "subreddit": "resumes", "text": "\"\"", "title": "This is the Resume that Got Me Six Interviews, Thanks for the feedback Reddit", "upvote_ratio": 0.99, "url": "https://i.redd.it/mtswfoaw7yl31.png"}, {"author": "OJ1199", "created_utc": 1662877911.0, "link_flair_template_id": "c292b8e0-28b9-11ec-874c-325b17e851a3", "link_flair_text": "I need feedback - North America ", "num_comments": 178, "post_id": "xbb9ec", "score": 1187, "subreddit": "resumes", "text": "\"\"", "title": "Applying for my first job", "upvote_ratio": 0.97, "url": "https://i.redd.it/v7ax7fyob6n91.png"}, {"author": "Ok_Face7055", "created_utc": 1674448898.0, "link_flair_template_id": "f54d73ce-28b9-11ec-bd91-1eac593353f0", "link_flair_text": "I'm sharing advice", "num_comments": 71, "post_id": "10j4080", "score": 1137, "subreddit": "resumes", "text": "\"\"", "title": "Resume of the year. saw this on LinkedIn and the caption was \"Applying for netflix\"", "upvote_ratio": 0.97, "url": "https://i.redd.it/1m99q7l9krda1.jpg"}, {"author": "iclife", "created_utc": 1563049272.0, "link_flair_template_id": "070e8c30-8cab-11e5-b31c-0e5d49860891", "link_flair_text": "Meta", "num_comments": 3, "post_id": "cctyyj", "score": 1090, "subreddit": "resumes", "text": "\"\"", "title": "A good guide for action words...stolen!", "upvote_ratio": 0.99, "url": "https://i.redd.it/e9xzbgzg3y931.jpg"}, {"author": "Sufficient_Ad7709", "created_utc": 1685991253.0, "link_flair_template_id": "0348e2a0-5e50-11e5-8349-128d650819bd", "link_flair_text": "Other", "num_comments": 890, "post_id": "141oahi", "score": 1080, "subreddit": "resumes", "text": "\"TL DR i made resume giving myself 3 years of experience at a company that ive never worked at now the company that wants to hire me is performing a background check how fucked am i and is there any lie i can tell to get myself out\"", "title": "I lied extremely hard on my resume", "upvote_ratio": 0.85, "url": "https://www.reddit.com/r/resumes/comments/141oahi/i_lied_extremely_hard_on_my_resume/"}, {"author": "Ill-Resident-7144", "created_utc": 1686771536.0, "link_flair_template_id": "68336c78-16bb-11ed-81ea-020fc04d0e6d", "link_flair_text": "Success Story", "num_comments": 115, "post_id": "149gzba", "score": 976, "subreddit": "resumes", "text": "\"Almost 2.5 years of endless job search. No income whatsoever only assistance from family and friends. Today I was finally hired as a non cdl driver for a trucking company. I\\u2019ve shed some tears today\\u2026 not many understand the struggle and daily battles I\\u2019ve faced. Having to resort to section 8 and food stamps. Living in the shittiest conditions. Some nights only Peanut butter for dinner. I pray anyone who is unemployed and seeking a gig lands the job of their dreams. God bless\"", "title": "Finally got a job 🙏🏾", "upvote_ratio": 0.98, "url": "https://i.redd.it/pum991msd16b1.jpg"}, {"author": "kong24680", "created_utc": 1634868004.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 62, "post_id": "qd6tch", "score": 970, "subreddit": "resumes", "text": "\"UPDATE: Unfortunately we\\u2019ve had to shut the resume scanner down due to lack of funding. Apologies for the inconvenience and good luck on your job searches!\\n\\nAs many of you know -  job searching sucks. Resumes go through Applicant Tracking Systems (ATS\\u2019s) and most people either get instantly rejected or ghosted after applying. After witnessing tons of my friends and family get laid off during the pandemic, a few friends and I started a free hiring platform called Refer\\u2019d to help directly connect people looking for jobs in software development with members of engineering teams (FAANG companies and VC backed start-ups) for referrals (think Bumble/Hinge for jobs). In addition to the app, we just released this free no-strings-attached\\u00a0[open-source resume scanner](https://referd.ai/resumescanner)\\u00a0for anyone to use!\\n\\nAfter you copy and paste your resume and a job post, the scanner shows you a % match based on skills, education, years of experience, and etc. The scanner is built to closely mimic how your resume would be parsed out by the most used ATS systems out there.\\n\\nI know privacy and data is a big concern for most people, which is why we\\u2019ve made the scanner open-source. NONE of your personal data is stored. The purpose of us building this is to offer people a free alternative to the many existing resume scanners on the market with paywalls. This scanner is a work in progress, so as always, I am open to any feedback or suggestions on how to make it better.\\n\\nHappy job hunting!!\\n\\nScanner:\\u00a0[https://referd.ai/resume-scanner](https://referd.ai/resume-scanner)  \\nGit Repo:\\u00a0[https://github.com/Refer-d/resume\\\\_scanner\\\\_open\\\\_source](https://github.com/Refer-d/resume_scanner_open_source)\"", "title": "I built a free open-source resume scanner. No paywall, no limits, no ads, and no account needed!", "upvote_ratio": 0.99, "url": "https://www.reddit.com/r/resumes/comments/qd6tch/i_built_a_free_opensource_resume_scanner_no/"}, {"author": "None", "created_utc": 1572701948.0, "link_flair_template_id": "0348e2a0-5e50-11e5-8349-128d650819bd", "link_flair_text": "Other", "num_comments": 28, "post_id": "dqka5s", "score": 960, "subreddit": "resumes", "text": "\"Couldn\\u2019t be more amped to start working in construction as a project manger. My biggest advice is to put a number to everything you have said you have done. Did presentations in college? How big were the classes? Managed people? For how long and how many were there. The moment I added numbers to my resume, started getting interviews one right after the other. Quantifying helps so much! \\n\\nAnother pro tip for interviews. After you walk in the door for an interview and they ask \\u201cHow are you doing?\\u201d Respond with \\u201cgreat, just (literally anything you did right before.)\\u201d Told people I just finished a training session with my puppy and totally opened up the room. Gets everyone way more comfortable. \\nThat is all! Best of luck!\"", "title": "Just landed my dream job! Pro tip: Numbers are everything.", "upvote_ratio": 0.99, "url": "https://www.reddit.com/r/resumes/comments/dqka5s/just_landed_my_dream_job_pro_tip_numbers_are/"}, {"author": "Beneficial_Row6873", "created_utc": 1689965516.0, "link_flair_template_id": "68336c78-16bb-11ed-81ea-020fc04d0e6d", "link_flair_text": "Success Story", "num_comments": 165, "post_id": "155wmk3", "score": 893, "subreddit": "resumes", "text": "\"Just wanted to share the resume that got me a job after being laid off mid April. It took me 3 months and 200+ applications but I finally landed one! Going from 60K > 87K salary. I hope it helps.\"", "title": "Resume that got me a job", "upvote_ratio": 0.98, "url": "https://i.redd.it/kvs724z47ddb1.jpg"}, {"author": "Different-Dish-5144", "created_utc": 1701263551.0, "link_flair_template_id": "c292b8e0-28b9-11ec-874c-325b17e851a3", "link_flair_text": "I need feedback - North America ", "num_comments": 710, "post_id": "186p2xq", "score": 867, "subreddit": "resumes", "text": "\"\"", "title": "I need some brutal honesty here; I have applied for 400 jobs in 3 months and nothing.", "upvote_ratio": 0.96, "url": "https://i.redd.it/i3zw5lbuda3c1.jpg"}, {"author": "BetterPound2385", "created_utc": 1690981646.0, "link_flair_template_id": "2a28ff6c-1e47-11ee-bbce-e60b7c314d0a", "link_flair_text": "Discussion", "num_comments": 38, "post_id": "15g8hls", "score": 849, "subreddit": "resumes", "text": "\"\"", "title": "Job market is trash right now 😭", "upvote_ratio": 0.98, "url": "https://www.reddit.com/gallery/15g8hls"}, {"author": "Aizzer", "created_utc": 1659055677.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 122, "post_id": "waqis7", "score": 794, "subreddit": "resumes", "text": "\"\"", "title": "Would you give this guy an interview ?", "upvote_ratio": 0.98, "url": "https://i.redd.it/qs755j81nce91.jpg"}, {"author": "raynier22", "created_utc": 1693270529.0, "link_flair_template_id": "c292b8e0-28b9-11ec-874c-325b17e851a3", "link_flair_text": "I need feedback - North America ", "num_comments": 727, "post_id": "1643t2d", "score": 742, "subreddit": "resumes", "text": "\"\"", "title": "I need some brutal honesty here; I have applied for 340 jobs in 2 months and nothing.", "upvote_ratio": 0.94, "url": "https://i.redd.it/5nmhmsfd6ykb1.png"}, {"author": "None", "created_utc": 1591746280.0, "link_flair_template_id": "a3643b7a-8ae9-11e5-bea4-0e0467040b93", "link_flair_text": "Discussion", "num_comments": 205, "post_id": "gzzat8", "score": 741, "subreddit": "resumes", "text": "\"I\\u2019ve been looking for a new job for about 6 months now. Covid kind of threw things off, but recently a lot of jobs have been posted. \\n\\nI\\u2019m really well qualified for a lot of the jobs I\\u2019ve applied for, but I would say I\\u2019ve only got about a 1% interview rate. \\n\\nMy name has been a popular topic of discussion during interviews. I have a very Russian surname that is difficult for most to pronounce.\\n\\nI changed my name to my just my first and middle name on my resume which are normal North American names. \\n\\nI applied to 100 postings online with my new resume, just the name changed, that\\u2019s literally it. I have had 13 replies in 2 days. This made me realize I didn\\u2019t have a resume or qualification issue. People were just straight up not willing to hire me because of my name as I had 4 places I previously applied to have called me with the new name resume application.\\n\\nHow big of a factor do you feel your race, ethnicity, nationality, etc been on your resume/hirability?\"", "title": "Changing your name on your resume? Worked for me!", "upvote_ratio": 0.99, "url": "https://www.reddit.com/r/resumes/comments/gzzat8/changing_your_name_on_your_resume_worked_for_me/"}, {"author": "ax_io", "created_utc": 1662221300.0, "link_flair_template_id": "68336c78-16bb-11ed-81ea-020fc04d0e6d", "link_flair_text": "Success Story", "num_comments": 110, "post_id": "x4y1nu", "score": 719, "subreddit": "resumes", "text": "\"Basically the title, after submitting hundreds of applications to various tech jobs I finally decided to look at online sources to see what I was doing wrong. \\n\\nFollowing the advice from this subreddit and it\\u2019s users I changed my resume and finally landed an interview at a top company. \\n\\nI\\u2019m not even that experienced and still haven\\u2019t graduated but I\\u2019ve landed a very high paying job for my age thanks to all the advice and start this Monday. \\n\\nThank you r/resumes !\\n\\nEdit:\\n\\nThank you for all the upvotes and appreciation, I will do another edit later on with a detailed explanation of how I laid out my resume from what it was to what it is and how it landed me interviews and finally a job (in tech, Europe). I\\u2019ll also throw in a few tips and advice I learnt here that got me where I was so everyone else can benefit too.\\n\\nEdit: Hey all, sorry for the late edit but I\\u2019m still working on that post as I\\u2019ve been slumped at my new place catching up I\\u2019ll hopefully have it posted soon and ready for you all to see. I\\u2019m still replying to all your dms and questions :)\"", "title": "I got hired thanks to this subreddit", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/resumes/comments/x4y1nu/i_got_hired_thanks_to_this_subreddit/"}, {"author": "MayTheBananaBeWithYo", "created_utc": 1653605598.0, "link_flair_template_id": "f54d73ce-28b9-11ec-bd91-1eac593353f0", "link_flair_text": "I'm sharing advice", "num_comments": 43, "post_id": "uyjsra", "score": 706, "subreddit": "resumes", "text": "\"\"", "title": "I was struggling to find a job so I went googling for templates and stumbled on this old post. I applied for a job yesterday and just got off a phone interview. Not endorsing or saying it’s a magic bullet, but I was surprised and wanted to spread it to those who may need it.", "upvote_ratio": 1.0, "url": "/r/jobs/comments/7y8k6p/im_an_exrecruiter_for_some_of_the_top_companies/"}, {"author": "hanihaneefa", "created_utc": 1703039898.0, "link_flair_template_id": "2e98a3ea-f5cb-11ec-8dc1-8ac1a228e11a", "link_flair_text": "I need feedback - Middle East ", "num_comments": 368, "post_id": "18mjq1s", "score": 672, "subreddit": "resumes", "text": "\"This has become quite depressing tbh. I'm on a visit visa in Dubai seeking jobs and my visa is expiring soon. I've been applying to a lot of open positions daily but till day I've got zero interview calls. Any help with improving my cv for better visibility would be appreciated. Thanks.\"", "title": "500+ applications and ZERO interview calls. What's wrong with my CV?", "upvote_ratio": 0.91, "url": "https://i.redd.it/ldkjr7bz3d7c1.jpeg"}, {"author": "None", "created_utc": 1680704917.0, "link_flair_template_id": "0348e2a0-5e50-11e5-8349-128d650819bd", "link_flair_text": "Other", "num_comments": 254, "post_id": "12cm6fw", "score": 655, "subreddit": "resumes", "text": "\"\"", "title": "I lied on my résumé to get a better-paying job — and I think others should do the same", "upvote_ratio": 0.91, "url": "https://www.businessinsider.com/lying-on-job-resume-how-i-did-it-2023-4?utm_source=instagram&utm_medium=social&utm_campaign=business-feed-headline-graphic"}, {"author": "dense_salmon", "created_utc": 1659837779.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 37, "post_id": "wi49z8", "score": 641, "subreddit": "resumes", "text": "\"\"", "title": "A resume my wife received this week", "upvote_ratio": 0.98, "url": "https://i.redd.it/0k4afedsb6g91.jpg"}, {"author": "MystRayne", "created_utc": 1554560252.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 28, "post_id": "ba4q6h", "score": 627, "subreddit": "resumes", "text": "\"I was laid off from my job in October. For months I wasn't having any luck finding a new job, and I exhausted my unemployment benefits a week ago. I never posted my resume here to get critiqued, but I went through a lot of the resumes here to get tips. I used the feedback from other people's resumes and implemented it to my own (it made it a million times better). I also checked out another job subreddit and read about the STAR method for interviews. I struggle with interviews, as I'm a quiet and shy person, but there was something about the STAR method that really stepped up my game.\\n\\nWell, I got a call yesterday for a job offer. The pay is higher than my last job, and I'll be receiving medical/dental/vision benefits, 401K, and PTO (didn't even have PTO at my last job). THANK YOU REDDIT!\\n\\n&#x200B;\"", "title": "Thank You Reddit! You Helped Me Get a Job!", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/resumes/comments/ba4q6h/thank_you_reddit_you_helped_me_get_a_job/"}, {"author": "Ill-Department9709", "created_utc": 1702972013.0, "link_flair_template_id": "c292b8e0-28b9-11ec-874c-325b17e851a3", "link_flair_text": "I need feedback - North America ", "num_comments": 182, "post_id": "18lwhpc", "score": 632, "subreddit": "resumes", "text": "\"Hello! I\\u2019m 16 who\\u2019s currently in highschool. I\\u2019ve had a job during the summer and I wasn\\u2019t able to keep it because I was seasonal, and since then looking for a job has been crucial. NO ONE has called me back and in the past 5-4 months I\\u2019ve applied to over 100 applications. I\\u2019ve been inside the establishments and  giving out my resume even calling like crazy. I\\u2019ve talked to a local Starbucks who literally told me they\\u2019re always hiring and never heard back. I\\u2019ve called and called and I keep hearing the same thing or getting ghosted. The Starbucks I had called told me, \\u201cwe see that your determined for this role and I\\u2019ll definitely get back to the manager to let them know you\\u2019re interested, we\\u2019re always hiring\\u201d. Not one reply. They always say they\\u2019ll call back and they never do. I had 2 interviews in the past months at Olive Garden and they didn\\u2019t even bother looking at my application. I was waiting for 20 minutes just for them to say, \\u201coh sorry! You\\u2019re not old enough.\\u201d You didn\\u2019t see that before I applied!!? Then I had a interview at Jamba, the man was not interested in anything I had to say and asked if I was available on Sunday and if I don\\u2019t hear back call on Monday. (Why even ask for my availability then?!) Sunday passes no call, Monday passes no call. So I call them just to hear oh sorry we went with someone else. It\\u2019s stressful because I\\u2019m really trying to move out as soon as I turn 18, and with no money I can\\u2019t do anything I want to. I feel so helpless. It could be because I do have limited availability, and I can only work night shifts because of school, but still.. :/\\n\\n\\n(Any suggestions would be greatly appreciated! Btw my mom made my resume)\"", "title": "Why are ALL my applications getting rejected?!", "upvote_ratio": 0.9, "url": "https://i.redd.it/c60d4vm4i77c1.jpeg"}, {"author": "fematestanswer", "created_utc": 1637850311.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 37, "post_id": "r1xoge", "score": 615, "subreddit": "resumes", "text": "\" \\n\\nHey  everyone, if you have experience but think you're lacking in other  areas such as education or training, you can do FEMA Independent Study  Courses. They are very easy to do and they look good on a resume. The  certificates are automatically sent to your email so you can download  them whenever.\\n\\n&#x200B;\\n\\nIS-235.C: Emergency Planning\\n\\n[https://training.fema.gov/IS/courseOverview.aspx?code=IS-235.c](https://training.fema.gov/IS/courseOverview.aspx?code=IS-235.c)\\n\\nDemonstrates  that you have some training in working under pressure. Pretty good to  have if you are going for a management position. Could also be good if  you are working in a high stress area such as security.\\n\\n&#x200B;\\n\\nIS-240.C: Leadership and Influence\\n\\n[https://training.fema.gov/is/courseoverview.aspx?code=IS-240.c](https://training.fema.gov/is/courseoverview.aspx?code=IS-240.c)\\n\\nThe perfect certificate to demonstrate management skills. Leadership is the number one quality they look for.\\n\\n&#x200B;\\n\\nIS-241.C: Decision Making and Problem Solving\\n\\n[https://training.fema.gov/IS/courseOverview.aspx?code=IS-241.c](https://training.fema.gov/IS/courseOverview.aspx?code=IS-241.c)\\n\\nSelf explanatory, jobs love employees that can solve problems.\\n\\n&#x200B;\\n\\nIS-242.C: Effective Communication\\n\\n[https://training.fema.gov/IS/courseOverview.aspx?code=IS-242.c](https://training.fema.gov/IS/courseOverview.aspx?code=IS-242.c)\\n\\nAnother self explanatory, jobs love it when you can communicate properly.\\n\\n&#x200B;\\n\\nIS-244.B: Developing and Managing Volunteers\\n\\n[https://training.fema.gov/IS/courseOverview.aspx?code=IS-244.b](https://training.fema.gov/IS/courseOverview.aspx?code=IS-244.b)\\n\\nBest certificate for joining non profits that I can think of.\\n\\n&#x200B;\\n\\nFind more at \\n\\n[https://training.fema.gov/is/](https://training.fema.gov/is/)\"", "title": "5 Free Certificates You Can Use to Spice up Your Resume.", "upvote_ratio": 0.99, "url": "https://www.reddit.com/r/resumes/comments/r1xoge/5_free_certificates_you_can_use_to_spice_up_your/"}, {"author": "Dwrar", "created_utc": 1675994341.0, "link_flair_template_id": "68336c78-16bb-11ed-81ea-020fc04d0e6d", "link_flair_text": "Success Story", "num_comments": 85, "post_id": "10yd68n", "score": 591, "subreddit": "resumes", "text": "\"\"", "title": "I got 10+ interviews using this format. I initially got the format somewhere in this thread, but made a few tweaks. Below i did a quick summary of what my resume looked like", "upvote_ratio": 1.0, "url": "https://i.redd.it/rjzmfgsn7bha1.jpg"}, {"author": "Kimmykun340", "created_utc": 1658170132.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 85, "post_id": "w26ybh", "score": 569, "subreddit": "resumes", "text": "\"Hello, Reddit. I'm a 41-year-old man who has never an actual job in his life. I spent my 20s and 30s taking care of my mother who had advanced glaucoma, diabetes, and heart disease, and after she passed, I took care of my aunt with Alzheimer's. Basically, I spent my productive years taking care of other people and now I'm in the shit. \\n\\nI used to be able to get by doing odd jobs like washing people's cars and during surveys on Swagbucks, but things have gotten so expensive here in Puerto Rico than doing those things is no longer feasible. Which means I need an actual job. Pretty much everything here requires a resume (yes, even Church's Chicken), but what can I put on it when I have nothing? That I graduated high school in 1998? That I dropped out of college 15-ish years ago? \\n\\nHelp, please.\"", "title": "I am old man with zero work experience; how do I make a resume?", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/resumes/comments/w26ybh/i_am_old_man_with_zero_work_experience_how_do_i/"}, {"author": "baddie-boss", "created_utc": 1683284444.0, "link_flair_template_id": "3d212a9a-f5cb-11ec-acef-1adb3b338801", "link_flair_text": "I need feedback - Asia ", "num_comments": 597, "post_id": "138i78p", "score": 569, "subreddit": "resumes", "text": "\"\"", "title": "ROAST PLEASE", "upvote_ratio": 0.86, "url": "https://i.redd.it/flk70dpcvzxa1.jpg"}, {"author": "None", "created_utc": 1582123783.0, "link_flair_template_id": "a3643b7a-8ae9-11e5-bea4-0e0467040b93", "link_flair_text": "Discussion", "num_comments": 111, "post_id": "f6bofq", "score": 569, "subreddit": "resumes", "text": "\"\"", "title": "I applied for a job online and saw this note about cover letters. I wish all employers made this decision.", "upvote_ratio": 0.99, "url": "https://i.redd.it/ewpwwzzq8wh41.png"}, {"author": "None", "created_utc": 1591318986.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 42, "post_id": "gwuinr", "score": 568, "subreddit": "resumes", "text": "\"I posted last week about how this sub helped me. But I just wanted to say that I am forever grateful to this sub, especially since I got this offer. It's something that will change my family's life forever. No more two jobs! I hope everyone can get out of that grind.\\n\\n[Here is my copy. It's not perfect, but it attracted a lot of employers. A lot of thanks to the sub for this.](https://imgur.com/a/oLGZf0a)   \\n\\n\\nOne thing that helped me A LOT is to ALWAYS edit your resume for each application. Taillor it by matching keywords and skills (ones that actually apply to you and have experience with, otherwise it will bite you in the rear if you lie)\"", "title": "After one year, 500+ applications, 30 phone interviews, 10 in-person interviews, 1 catfish company that screwed me over, crawled back to two jobs that I left, I finally hit a home run! A position in my field (software development and IT) making twice my salary.", "upvote_ratio": 0.99, "url": "https://www.reddit.com/r/resumes/comments/gwuinr/after_one_year_500_applications_30_phone/"}, {"author": "IntheTrench", "created_utc": 1649603603.0, "link_flair_template_id": "f54d73ce-28b9-11ec-bd91-1eac593353f0", "link_flair_text": "I'm sharing advice", "num_comments": 126, "post_id": "u0jmtr", "score": 534, "subreddit": "resumes", "text": "\"1. Is all of the personal information clearly stated at the top? ie: name(first and last), location, email, phone number\\n2. Is work experience clearly stated with job title's, company name, and start/end dates?\\n3. Is education/certifications/projects clearly stated with dates/ issuer/ degree received? \\\\*\\\\* \\n4. Are there any obvious spelling errors & is the formatting consistent throughout the resume?\\n5. Are there any gaps in employment? - If so, expect to be asked about it.\\n\\n1-4 can apply to all resumes but then things do get a little more specific depending on which field I am recruiting for. Normally I recruit for tech, but sometimes it overlaps with digital media & art so I have experience with this as well.\\n\\nFor Technical Resumes -\\n\\n1. Don't worry about keeping to 1 or even 2 pages, as long as all the information is relevant.\\n2. Have a \\\"Technologies\\\" section and put it above your work experience.\\n3. Make sure that all technologies listed above are also mentioned again below in your work experience section.\\n4. Do not list any technologies that you have not had paid work experience or completed education in. \\\\*\\\\*There can be some exceptions here but in general this is the rule.\\n\\nFor Digital Media & Art resumes - Just two things here I don't always see.\\n\\n1. You should have a link to your portfolio on your resume\\n2. Your resume is a piece of art itself and might as well be a part of your portfolio. An art resume should look like it was made by an artist.\\n\\nLast thing I'd like to mention for people posting on this sub, please state which job you are going for along with your resume. A resume by itself doesn't mean much without the context of which job you are applying for.\\n\\n\\\\*\\\\*edit: A good point was made in the comments about putting down the dates for education because of age discrimination. Age discrimination is real and if you are afraid of this, you can go ahead and not put your dates of graduation. Unfortunately, there is not much you can do if you are being discriminated by age. They will see how old or young you are at some point in the interview process, but at least you may get a first interview before you are dismissed.\"", "title": "As a recruiter, this is my general checklist when looking at a resume.", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/resumes/comments/u0jmtr/as_a_recruiter_this_is_my_general_checklist_when/"}, {"author": "Stock_Fluffy", "created_utc": 1705828895.0, "link_flair_template_id": "2a28ff6c-1e47-11ee-bbce-e60b7c314d0a", "link_flair_text": "Discussion", "num_comments": 96, "post_id": "19bzllo", "score": 531, "subreddit": "resumes", "text": "\"Is the job market that bad?\"", "title": "Literally 70% people here are applying to software positions", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/resumes/comments/19bzllo/literally_70_people_here_are_applying_to_software/"}, {"author": "Duggbog", "created_utc": 1575920470.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 88, "post_id": "e8eu7c", "score": 529, "subreddit": "resumes", "text": "\"It says fuck all about your skills, it\\u2019s far too vague a metric for the recruiter to use and it looks like you paid a front end designer to treat your resume like an app\\u2019s statistical section. \\n\\nI guarantee most returns with progress bars end up in the bin.\"", "title": "STOP PUTTING PROGRESS BARS ON YOUR RESUME", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/resumes/comments/e8eu7c/stop_putting_progress_bars_on_your_resume/"}, {"author": "Lin_Z_B", "created_utc": 1647899595.0, "link_flair_template_id": "f54d73ce-28b9-11ec-bd91-1eac593353f0", "link_flair_text": "I'm sharing advice", "num_comments": 120, "post_id": "tjn237", "score": 524, "subreddit": "resumes", "text": "\"Believe it or not, there are still a lot of discriminatory practices happening within the hiring process. \\n\\nBy dating your education, you are essentially dating yourself and a hiring manager may decide not to interview you based on assumed age. \\n\\nThe only thing companies need to know is that you have a degree and/or diploma.\"", "title": "Remove the dates from your education", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/resumes/comments/tjn237/remove_the_dates_from_your_education/"}, {"author": "Cautious_Ad_8128", "created_utc": 1697729644.0, "link_flair_template_id": "2a28ff6c-1e47-11ee-bbce-e60b7c314d0a", "link_flair_text": "Discussion", "num_comments": 111, "post_id": "17blz54", "score": 518, "subreddit": "resumes", "text": "\"Does anyone else feel this way?\\n\\nI have applied for over 50 positions for a paralegal job, and all of them have lead to in person interviews. I\\u2019m in between jobs at the moment so financial resources are a little tight at the moment so I don\\u2019t leave my house unless it\\u2019s absolutely necessary in order to save gas.\\n\\nWell I\\u2019ve had 4 in person interviews this past week that have resulted in nothing. And I kind of find it insulting that no one has taken 5 minutes to call me or email me to let me know they went with someone else. I\\u2019m sitting here hoping one of these opportunities works out and I feel like I can\\u2019t really make any moves because I\\u2019m holding on to the hope that I\\u2019m not being ghosted, that they\\u2019re still contemplating hiring me, but deep down I kind of know. \\n\\nI think it\\u2019s just totally inconsiderate to ask someone to carve out time out of their day and has to come in person for interviews only to ghost your candidates. I wish Zoom interviews were still a thing.\"", "title": "Job interviews are basically like dating and I hate it", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/resumes/comments/17blz54/job_interviews_are_basically_like_dating_and_i/"}, {"author": "None", "created_utc": 1688930956.0, "link_flair_template_id": "f54d73ce-28b9-11ec-bd91-1eac593353f0", "link_flair_text": "I'm sharing advice", "num_comments": 131, "post_id": "14v7crz", "score": 516, "subreddit": "resumes", "text": "\"Edit: I just realized a shit ton of people messaged me about that template for a cover-letter. Lemme get one together and I'll pass it along.\\n\\nI don't know if this is the correct place to share this but figured it might be insightful to some.\\n\\nAs a former hiring manager who had a Linkedin recruiter account, don't consider any role you've applied for via Linkedin \\\"Easy Apply\\\" as a role you've actually \\\"applied\\\" for.\\n\\nReason is Linkedin's recruiter-side filters are god awful and those roles with 'Easy Apply\\\" get hundreds of applications. It's essentially impossible to filter/read/follow up on any application. Particularly so when there's hundreds.\\n\\nNot saying don't apply, just saying I wouldn't count those as part of your \\\"I applied to 10 jobs everyday\\\"-tally.\\n\\n&#x200B;\\n\\n&#x200B;\"", "title": "Linkedin \"Easy Apply\"", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/resumes/comments/14v7crz/linkedin_easy_apply/"}, {"author": "meiraine", "created_utc": 1686610999.0, "link_flair_template_id": "a3643b7a-8ae9-11e5-bea4-0e0467040b93", "link_flair_text": "I have a question", "num_comments": 265, "post_id": "1480943", "score": 515, "subreddit": "resumes", "text": "\"I'm genuinely curious how other jobseekers are approaching the job search. I see people share stats and I'm having a hard time wrapping my head around some of the numbers.\\n\\nIn my limited job hunt experience (I've only started my career 4 years ago), out of 50 job postings I might only see 10 that I truly vibe with. I might actually end up only applying to 5.\\n\\nAm I being too picky? Do you apply to job postings, even if the job description is not attractive to you? Or are 100+ application numbers I'm seeing are usually spread out over many months?\\n\\nWould love to gain more insight on this.\\n\\n**Edit:** Just wanted to follow-up with a blanket response and thank you to all the feedback so far. Even if it's not specific advice for me, I think it's helpful to open the dialogue. From my understanding, it seems that there are two main mentalities (and others in the middle). Either choose quality or quantity when applying or some of both. I find myself doing both usually -- investing time into tailoring a resume for dream positions and \\\"easy applying\\\" to others. To be picky is a luxury -- I realize this. But it's also nice to confirm that 100+ apps aren't all being tailored, despite what I see people advise others to do. There's really no harm in sending out resumes en masse, since getting through to offer seems so unpredictable anyway. I used to feel like maybe I wasn't trying hard enough if I didn't tailor my resumes. But now my personal takeaway is not to feel guilty no matter what approach I take.\"", "title": "How are people applying to 100+ jobs?", "upvote_ratio": 0.94, "url": "https://www.reddit.com/r/resumes/comments/1480943/how_are_people_applying_to_100_jobs/"}, {"author": "ExecutiveDrafts", "created_utc": 1570463463.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 32, "post_id": "delb19", "score": 506, "subreddit": "resumes", "text": "\"Hello all,\\n\\n&#x200B;\\n\\nIt's been a while since I've made a stand-alone post to address some things I see happening in the job-searching and resume writing world, so I thought I'd pop in with a post just for Reddit.  There's no website link, there's no pitch to our services, it's just a list of things you can think about and act on to improve your resume and job searching strategies. I hope some folks find it helpful as we move into a tricky part of the year.\\n\\n&#x200B;\\n\\n* As I mentioned, this is a tricky part of the year for a job transition. Most people have until just after Thanksgiving to get a job offer. After that, things slow to a crawl. Folks are out of the office, spending time with their families, and companies are waiting to approve head count after reviewing their quarterly and annual earnings.  These things put together means very little hiring happens. To compound it, many people want to \\\"hold off\\\" on the job search so they can enjoy the holidays. What ends up happening? January is a hiring fiesta and people scramble to prepare their resumes once they return to work and realize they're not so happy with their jobs.  This means you should either make a mad rush to get hired right now, or you should start updating your resume and job searching approach in preparation for the January rush.  If you're prepared now, you will be one step ahead of people when the new year hits.\\n* One of the most common resume mistakes I see is when people aren't thinking about how their resume looks to a person trying to hire them.  This sounds simple, but clearly presents challenges to people.  I am currently hiring an administrative position at Executive Drafts, and I've had well over 400 applications in only a few weeks.  Of those 400 applications, I'd say over half of them make no sense to me whatsoever (their careers are completely unrelated, they seem grossly overqualified, and/or they make no attempt at explaining to me the reason for their transition or interest, either in the summary or a cover letter).  It baffles me that someone with a Ph.D. or C-level experience would apply to an administrative assistant position at my company without even giving a slight reason for the obvious mismatch, and so those people are not going to get a callback.  If you are making a career transition, or if you're looking to take a lateral or downward step in your career, you need to be careful how you phrase things, specific about your job titles, and provide a brief but tactful explanation. In short, your story needs to make sense, because there's always another resume behind yours and we don't have time to call everyone and figure out what's going on with their career aspirations.\\n* Any decent job gets a ton of applications, which means you need to get the right tools in place (Resume, LinkedIn, etc.) and then you need to run the numbers.  It is very hard to go after one specific job and get it, and it's very hard to go after 100 jobs with a crappy resume and get anything at all. The sweet spot is in the middle: Get the right tools, then keep your activity levels high.  I know this can vary based on your urgency, your specific career, etc., but I think anyone serious about getting a new job should aim for around 10-15 applications a week. This ensures you can give each one proper care (making small revisions from job to job, for example). People who apply to 2 jobs a week, as well as those applying to 50+, are both showing different bad habits with the same disappointing outlook.\\n* Standing out isn't an effective strategy. So many of our clients ask how they can stand out better to recruiters. One thing I've learned over and over again is that recruiters aren't stupid and they don't fall for tricks. A lavender scented resume with glitter stands out, but isn't likely to get you hired.  Extensive graphical design elements aren't effective in the long run.  Eye-popping catch phrases don't work.  Mostly, we're looking to filter out obviously unqualified folks, and then we're hoping to find someone who seems like they understand how to write professionally, they've done the kind of work we're looking for, and they \\\"fit in\\\".  I wish the bad advice wouldn't circulate as often as it does, but maybe this is why our clients end up with an advantage.  You are far better off showing yourself as a strong match for the job than finding a way to \\\"stand out\\\".\\n* People are often frustrated when transitioning careers because they're so sure they can do the job, and they just need an employer to take a chance on them.  In a perfect world with plenty of opportunity, this sounds totally fair.  However, employers aren't looking to be mean and deny you an opportunity. Rather, it's a simple matter of \\\"Do I take this person, who has worked as a server for six years and wants to be a customer success agent, or do I take this person, who has worked in customer service for six years and customer success for two?\\\"  Employers can usually find people who have already done the job they're hiring for.  This is where networking helps. This is where freelancing or contract work helps. This is where temp services can be helpful.  Sometimes, it's even a good strategy to take a position that might pay less if it offers you a doorway into a new career path. You can always re-evaluate in 12 months and apply for a role at the same company or an entirely different one, now that you have experience.  I meet so many people who say \\\"I really don't want to take a lateral move.\\\" Yeah, nobody does. But sometimes that can be the best decision you've ever made.  I know so many people who want to transition out of sales roles and into something else in the corporate world, but are afraid of losing a few thousand dollars a year. Commission jobs tend to pay well, and if you want to give up that stressful sales quota and work as a project manager, it's probably a good idea to take even money to re-establish your experience.\\n* Let's talk about something a little less heady: Skills sections. I would say the average person has a skills section on his resume, but the average person probably doesn't need one. Highly technical positions benefit from a \\\"Technical Skills\\\" section. However, many resumes would be better off simply mentioning those skills within the body of the resume. That lets you talk about your skills in context.  To add to the problem, many skills sections come off as very weak, using low-level soft skills that act as filler.  I see many skills sections with things like \\\"problem solving\\\", \\\"critical thinking\\\", \\\"beginner german\\\", etc.  None of those skills, when said without any context, are likely to get you hired.  Instead, they drag the resume down.  Skills sections are great if you feel your professional overview could benefit from a single grid of say, 12 keywords that you know are highly sought-after and searched for (IT guys, software developers, obviously this is very relevant to you).  But project managers, people who work in operations and only have a few software applications they need to know, and other such professions can easily mention a couple of keywords in their summary and the rest within the body of the resume itself.  Simply put, ask yourself if your skills section really adds meat to your resume, or if it just feels like extra fluff.\\n* Lastly, let's talk about fluff in general.  I read bloated resumes every single day.  I'm wordy and often need to review my writing to cut it down to something shorter and easier to consume (this post is living proof).  When people try to write something impressive, they use far more words and phrases than they need.  They say things like 'Successfully handled in-bound calls for a law firm' when there was really no point in using the word \\\"Successfully\\\".  They try to make their college job at burger king sound like a master class in multi-tasking and customer service, when really it's just a job that helped you pay the bills in college, and employers have no problem with accepting it for what it is.  Most resumes should be shorter. Most should be very plainly written, more direct, and stick to quickly relaying what kind of tasks you did, what kind of results you achieved, how you approached specific problems or projects, and what skills and abilities you picked up along the way.  When you write a resume this way, and when you write it so that you're only offering a prospective employer the info he needs to bring you in for an interview, you drastically increase the chances your resume will get read, and the chances of your message getting through to them.  Long resumes with extra sections, nonsense soft skills and excessive detail are killing your chances of success.\\n\\nI hope everyone's off to a productive week in their job search.  I'll be quite active on Reddit this week, weighing in on as many resumes as I can, and I'm happy to take questions here, via PM, or anywhere else we see fit.  You guys are all here to either offer help (thank you so much!) or ask for help (congratulations, you came to the right place).  So let's help as many people as we can get job-ready so they can move on with their careers.\\n\\n&#x200B;\\n\\nJeremy\\n\\nExecutive Drafts\\n\\n&#x200B;\\n\\nEdit: Redditor caught a typo and alerted me. Good community!\"", "title": "Notes from a professional resume writer - Executive Drafts' take on the fall hiring season", "upvote_ratio": 0.99, "url": "https://www.reddit.com/r/resumes/comments/delb19/notes_from_a_professional_resume_writer_executive/"}, {"author": "yeahdude78", "created_utc": 1692315265.0, "link_flair_template_id": "2a28ff6c-1e47-11ee-bbce-e60b7c314d0a", "link_flair_text": "Discussion", "num_comments": 239, "post_id": "15u3le7", "score": 498, "subreddit": "resumes", "text": "\"What happened to the industry, damn\"", "title": "Why is everyone here a software engineer who is struggling?", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/resumes/comments/15u3le7/why_is_everyone_here_a_software_engineer_who_is/"}, {"author": "drcrunknasty", "created_utc": 1566324605.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 14, "post_id": "ct3c1w", "score": 500, "subreddit": "resumes", "text": "\"\"", "title": "I figured this might be of some use in the resumes subreddit", "upvote_ratio": 1.0, "url": "https://i.redd.it/l81a13whxkh31.jpg"}, {"author": "Togna-Bologna", "created_utc": 1501650843.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 128, "post_id": "6r21ha", "score": 498, "subreddit": "resumes", "text": "\"\"", "title": "Was Interviewed for 5 of 15 Out-of-State Jobs I Applied to with this Resume and got a 50% Salary Increase!", "upvote_ratio": 0.99, "url": "https://i.redd.it/rqr56jp2a9dz.png"}, {"author": "djpresstone", "created_utc": 1586620401.0, "link_flair_template_id": "1bbbb61c-5e48-11e5-a6d8-12f8a41ffdcb", "link_flair_text": "Communication", "num_comments": 16, "post_id": "fz824m", "score": 490, "subreddit": "resumes", "text": "\"\"", "title": "Good candidate for LPT as well", "upvote_ratio": 0.99, "url": "https://i.redd.it/k74o6f5pe7s41.png"}, {"author": "None", "created_utc": 1573184374.0, "link_flair_template_id": "0348e2a0-5e50-11e5-8349-128d650819bd", "link_flair_text": "Other", "num_comments": 32, "post_id": "dt9kru", "score": 485, "subreddit": "resumes", "text": "\"\"", "title": "I've made a cover letter template, all you have to do is enter the companys name you're applying to, their information, and how you fulfill the job requirements. Hope it's helpful.", "upvote_ratio": 0.99, "url": "https://docdro.id/54bXbIz"}, {"author": "Anjeyster", "created_utc": 1683440682.0, "link_flair_template_id": "19f3a5c0-f5cb-11ec-bbc5-12bdd01bc8ab", "link_flair_text": "I need feedback - Europe ", "num_comments": 156, "post_id": "13af3fx", "score": 474, "subreddit": "resumes", "text": "\"\"", "title": "Getting rejected from every single application. Nearly 500+ rejections. Appreciate any feedback. This is the master resume that I use. I'm customizing each job application by adding keywords.", "upvote_ratio": 0.95, "url": "https://www.reddit.com/gallery/13af3fx"}, {"author": "Danaaerys", "created_utc": 1658788537.0, "link_flair_template_id": "f54d73ce-28b9-11ec-bd91-1eac593353f0", "link_flair_text": "I'm sharing advice", "num_comments": 65, "post_id": "w82fy2", "score": 469, "subreddit": "resumes", "text": "\"I read an article and the reporter said something along the lines that if an employer/recruiters/hiring manager etc don\\u2019t know (since they can\\u2019t straight out ask-hey, are you vaccinated?) that prospective employees are or aren\\u2019t vaccinated, they turn their cheek\\u2026most won\\u2019t \\u201ceven look\\u201d at the resume, so reporter suggested including it in your resume \\u2014 and if you\\u2019re job hunting right now, you know those online applications are asking you and are imposing restrictions that one be fully vaccinated and that\\u2019s becoming a requirement now even for consideration of employment\\u2026\\n\\nSo I put it on there. Figured what the hell. 9 calls back and I have four interviews already lined up\\u2026\\n\\nJust thought I\\u2019d share. Pass that on because in my xp in this community is that I haven\\u2019t seen anyone ask or even speak up about \\u201cwhat if\\u201d that little piece of info should \\u201cgo on there\\u2026\\u201d\\n\\nI don\\u2019t remember what site or even what the title of that article was, I just know I read it.\"", "title": "I disclosed on my resume right at the top “Fully vaccinated against COVID-19”…had 9 callbacks this morning…", "upvote_ratio": 0.86, "url": "https://www.reddit.com/r/resumes/comments/w82fy2/i_disclosed_on_my_resume_right_at_the_top_fully/"}, {"author": "Guts1019", "created_utc": 1518714668.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 104, "post_id": "7xrswm", "score": 463, "subreddit": "resumes", "text": "\"I'm going to be looking for a second job, and I know I need a resume to do that. I was online using a resume builder tool which helped a lot. I was really happy with my end result, but I failed to look for the fine print. The site claimed it was free, but I didn't realize free to make doesn't equal free to export. So I wasted my time on it. Anyone know of a site that actually is free?\"", "title": "Any good free resume builder tools?", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/resumes/comments/7xrswm/any_good_free_resume_builder_tools/"}, {"author": "thatjaydegirl", "created_utc": 1706214986.0, "link_flair_template_id": "c292b8e0-28b9-11ec-874c-325b17e851a3", "link_flair_text": "I need feedback - North America ", "num_comments": 539, "post_id": "19fj5vq", "score": 460, "subreddit": "resumes", "text": "\"It is 2 pages in Word, these are screenshots from my phone\"", "title": "Just another software engineer not getting invited to interviews, even after paying hundreds to have my resume professionally done", "upvote_ratio": 0.86, "url": "https://www.reddit.com/gallery/19fj5vq"}, {"author": "Kareem1997", "created_utc": 1640794219.0, "link_flair_template_id": "f54d73ce-28b9-11ec-bd91-1eac593353f0", "link_flair_text": "I'm sharing advice", "num_comments": 33, "post_id": "rrbnlf", "score": 455, "subreddit": "resumes", "text": "\" Here's a non-exhaustive list of all the other things you can negotiate:  \\n\\n\\n1. Performance-based compensation (commission, etc.)  \\n2. Ownership (equity)  \\n3. Days off  \\n4. Role title  \\n5. Travel, gym, and food stipends  \\n6. Timeline to promotion (contingent on certain success criteria)  \\n7. Coaching opportunities with an exec on a topic of interest  \\n\\n\\nAnd so much more\\u2026  \\nLet me know if you have anything else to add.  \\n\\n\\nComment any questions if you want more advice - I've helped some friends with negotiation :)\"", "title": "You're missing out if all you negotiate is money", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/resumes/comments/rrbnlf/youre_missing_out_if_all_you_negotiate_is_money/"}, {"author": "Nasorean", "created_utc": 1577912519.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 14, "post_id": "einq6y", "score": 455, "subreddit": "resumes", "text": "\"It's Bachelor of Arts/Science or Master of Arts/Science OR Bachelor's Degree or Master's Degree. You can't say, for example, \\\"Bachelors of Arts\\\"\\n\\nI hope this helps any job seekers in 2020.\"", "title": "A Reminder for the New Year: There's an apostrophe in Bachelor's and Master's.", "upvote_ratio": 0.99, "url": "https://www.reddit.com/r/resumes/comments/einq6y/a_reminder_for_the_new_year_theres_an_apostrophe/"}, {"author": "LyfeIzButADream", "created_utc": 1684656913.0, "link_flair_template_id": "3d212a9a-f5cb-11ec-acef-1adb3b338801", "link_flair_text": "I need feedback - Asia ", "num_comments": 291, "post_id": "13nn11k", "score": 446, "subreddit": "resumes", "text": "\"\"", "title": "Not getting any interviews for the past 3 months. Can I get some honest feedback on this resume? Thanks!!!", "upvote_ratio": 0.96, "url": "https://i.redd.it/vub07i5u751b1.png"}, {"author": "hotfezz81", "created_utc": 1661957749.0, "link_flair_template_id": "0348e2a0-5e50-11e5-8349-128d650819bd", "link_flair_text": "Other", "num_comments": 40, "post_id": "x2fpdr", "score": 448, "subreddit": "resumes", "text": "\"\"", "title": "Honestly this depresses me more than anything.", "upvote_ratio": 0.97, "url": "https://i.redd.it/d8dxu1mpi1l91.jpg"}, {"author": "Greedy_Drink_2377", "created_utc": 1689755998.0, "link_flair_template_id": "2a28ff6c-1e47-11ee-bbce-e60b7c314d0a", "link_flair_text": "Discussion", "num_comments": 428, "post_id": "153p70w", "score": 445, "subreddit": "resumes", "text": "\"\"", "title": "My friend said that my resume is horrible", "upvote_ratio": 0.88, "url": "https://www.reddit.com/gallery/153p70w"}, {"author": "Indie50000", "created_utc": 1664295910.0, "link_flair_template_id": "f54d73ce-28b9-11ec-bd91-1eac593353f0", "link_flair_text": "I'm sharing advice", "num_comments": 74, "post_id": "xpld3x", "score": 445, "subreddit": "resumes", "text": "\"There seems to be some dissonance between career advice people on yt and edgier job search subreddits and what is actually ethical.\\n\\nIf someone is telling you to outright lie about jobs you've never had, or schools you never went to, do not listen to them.\\n\\nHowever, \\\"lying\\\" on a resume isn't illegal per se, so here is what it actually means to embellish and how to do it without blacklisting yourself.\\n\\n1) If your GPA is less than 3.5/4.0 and the job doesn't require a GPA, don't put it on your resume\\n\\n2) If you did an internship and you feel like removing the word \\\"intern\\\" would give you a better shot, go ahead, but be prepared to explain why you only worked at the company for 3 months in the interview\\n\\n3) It's ok to slightly exaggerate the impact of your position, obviously, a cashier isn't vastly improving the company, but saying your customer service improved reviews or customer experience for the store wouldn't be unbelievable, for example\\n\\n4) If you're still in university, you don't have to put \\\"present\\\" or \\\"current\\\" on your resume, you can just put your expected graduation date\\n\\n5) DO NOT under any circumstances put progress bars on your resume. If you are not confident enough in your skills, don't put them on there. If you are mediocre, don't sell yourself short by putting a progress bar, go to the interview and see if they even need an exceptional candidate\\n\\n6) don't put your photo, it leads to discrimination, especially in the US\\n\\n7) If your volunteer experience is relevant to your job, you can put it under \\\"experience\\\" as long as you don't label it \\\"work experience\\\" or \\\"employment\\\" you aren't lying\\n\\n8) If did some free or cheap work for a family member or friend, you can say you did some freelance commissions. If they ask for taxes, you can be honest and say that you didn't file taxes on the income, since you did it as a side hustle and did not make enough to pay tax on it.\\n\\nNotice how none of this is actually lying. It's removing unnecessary details to make a good impression.\\n\\nPeople who say \\\"lie\\\" are doing it for clickbait, like this post. Do not lie about stuff you've never done in your life.\\n\\nBackground checks will catch you immediately and if you somehow still get hired, someone will wonder why they don't know you. Especially if you lied that you were a senior, or that you did something really important in the company. \\n\\nLike, if I lied that I came up with the Dynamic Island for ios, someone would wonder why they don't know me because of how important that was and I'll get found out real fast.\\n\\nYou can always apply to jobs even if you don't meet the requirements. The job posting is describing the ideal candidate, not what they are actually looking for. I've been interviewed for many jobs where I was missing qualifications because my portfolio works for their needs.\\n\\nIf you keep getting rejected it's probably not about experience, it's about you. Improve your portfolio and network to get opportunities.\"", "title": "What it actually means to lie on your resume", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/resumes/comments/xpld3x/what_it_actually_means_to_lie_on_your_resume/"}, {"author": "Prasun01", "created_utc": 1691514696.0, "link_flair_template_id": "c292b8e0-28b9-11ec-874c-325b17e851a3", "link_flair_text": "I need feedback - North America ", "num_comments": 199, "post_id": "15lo4dr", "score": 434, "subreddit": "resumes", "text": "\"\"", "title": "Rejected from 100+ internships and going crazy. Maybe its my resume", "upvote_ratio": 0.9, "url": "https://i.redd.it/jt6opg6u3xgb1.png"}, {"author": "Comfortable_Tax6302", "created_utc": 1704410640.0, "link_flair_template_id": "3d212a9a-f5cb-11ec-acef-1adb3b338801", "link_flair_text": "I need feedback - Asia ", "num_comments": 438, "post_id": "18yrcqa", "score": 438, "subreddit": "resumes", "text": "\"\"", "title": "Why am I not getting any interview calls despite having 3 years+ of professional experience?", "upvote_ratio": 0.96, "url": "https://i.redd.it/3ms2jxsvbiac1.png"}, {"author": "njpu", "created_utc": 1685459434.0, "link_flair_template_id": "f54d73ce-28b9-11ec-bd91-1eac593353f0", "link_flair_text": "I'm sharing advice", "num_comments": 131, "post_id": "13vsw71", "score": 437, "subreddit": "resumes", "text": "\"\"", "title": "Am I tripping or is this a terrible template for a resume? How in the world is this a 10/10 resume?", "upvote_ratio": 0.9, "url": "https://v.redd.it/87ggpnf8013b1"}, {"author": "boredsoballing", "created_utc": 1683203420.0, "link_flair_template_id": "c292b8e0-28b9-11ec-874c-325b17e851a3", "link_flair_text": "I need feedback - North America ", "num_comments": 209, "post_id": "137j6e9", "score": 432, "subreddit": "resumes", "text": "\"\"", "title": "My resume is embarrassingly short… This is the only job I’ve ever had & I only got it through connections. I dropped out of university after less than a year, so no education to speak of. I really can’t think of anything else to put on here… What should I do?", "upvote_ratio": 0.95, "url": "https://i.redd.it/cnakc86ynuxa1.jpg"}, {"author": "New-Drummer7997", "created_utc": 1701669526.0, "link_flair_template_id": "c292b8e0-28b9-11ec-874c-325b17e851a3", "link_flair_text": "I need feedback - North America ", "num_comments": 164, "post_id": "18adsyi", "score": 434, "subreddit": "resumes", "text": "\"I don\\u2019t get it!! I keep swapping stuff in and out and\\nCustomizing for new job posting but nothings working!! Not a single response except for rejection emails :((( looking for data science, quant financial, software, and machine learning jobs. I\\u2019ll literally anything lol\"", "title": "Got laid off at the start of last month and haven’t been able to land an interview since", "upvote_ratio": 0.96, "url": "https://i.redd.it/fg5ckd06x74c1.jpeg"}, {"author": "Similar_Round6698", "created_utc": 1703747308.0, "link_flair_template_id": "4e7bf522-f5cb-11ec-b320-d207072317f4", "link_flair_text": "I need feedback - Australia ", "num_comments": 192, "post_id": "18sntt4", "score": 434, "subreddit": "resumes", "text": "\"I would also love some recommendations on improving employability. I also have a tendency to leave a project half-finished when I don't know how to solve a problem. Therefore, I'm planning on learning more about project structure and coding before starting new projects (so maybe start with smaller projects)\\n\\nThis was made from a  template on overleaf\\nQuestions:\\nShould I remove personal section, some of the stuff seems unnecessary and doesn't help my resume.\\nShould i focus more on projects, if so, is their anything specific (i am most comfortable with c++)\\nShould I also look for work experience?\\nWhat about open source contributions and building up my github?\\nI have been doing leetcode and hackerrank, is their a big focus on this in the market?\"", "title": "Just finished Year 1 of my 4 year Software engineering course, This is my resume so far.", "upvote_ratio": 0.83, "url": "https://www.reddit.com/gallery/18sntt4"}, {"author": "Pleasant-Agency7648", "created_utc": 1690180001.0, "link_flair_template_id": "c292b8e0-28b9-11ec-874c-325b17e851a3", "link_flair_text": "I need feedback - North America ", "num_comments": 189, "post_id": "1582ang", "score": 427, "subreddit": "resumes", "text": "\"\"", "title": "Been applying for almost a year but got no interviews.", "upvote_ratio": 0.96, "url": "https://i.redd.it/7mqhbv6vwudb1.png"}, {"author": "ttsoldier", "created_utc": 1688220747.0, "link_flair_template_id": "f54d73ce-28b9-11ec-bd91-1eac593353f0", "link_flair_text": "I'm sharing advice", "num_comments": 77, "post_id": "14nw4tf", "score": 422, "subreddit": "resumes", "text": "\"I've been looking for jobs (in Canada) for the past 6/7 months... I've applied to hundreds of jobs and got 3 interviews within that time.  First week of  June I met with a recruiter and she told me my resume looked like a job description and I had to do over my entire resume. There was also a lot of fluff according to her and \\\"skills\\\" that everyone else would list... eg... \\\"Worked collaboratively with cross functional teams...... \\\"\\n\\nBased on her advice I took a weekend and revamped my resume and used limited bullet points to talk about what I ACHIEVED. I started including metrics like Monthly Recurring Revenue, Gross Profit Margin, Daily Active Users etc etc and really talked about what I helped achieve.\\n\\nSince then I've gotten interest from 4 companies in 3 weeks!!! One I was not successful but I'm currently interviewing with 3 other companies. So while I'm yet to secure a job, I feel a lot better with the responses I'm getting and just thought I'd share!\\n\\nP.S for those debating 1 page vs 2 page resume my resume is 2 pages. I have over 15 years work experience but only listed the last 5 years on my resume as that's whats relevant. All my work experience fits on the first page but my education section takes it to the second page. She advised that I remove the professional summary section as well as the \\\"Competencies\\\" section which I did.\\n\\nMy resume layout is as follows:\\n\\n**Name and Contact Information**\\n\\n**Objective**\\\\-A one line objective\\n\\n**Professional Experience**\\\\-3 jobs with 4-6 bullet points max\\n\\n**Education and Professional Development**  \\nDegree  \\nCertifications  \\nTools\\n\\n&#x200B;\\n\\nGood luck!\"", "title": "300 job applications later....This worked for me.. Maybe it will work for you ?", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/resumes/comments/14nw4tf/300_job_applications_laterthis_worked_for_me/"}, {"author": "theunnamedartist", "created_utc": 1703288700.0, "link_flair_template_id": "c292b8e0-28b9-11ec-874c-325b17e851a3", "link_flair_text": "I need feedback - North America ", "num_comments": 114, "post_id": "18osav1", "score": 419, "subreddit": "resumes", "text": "\"\"", "title": "400+ Applications and 0 interview calls. Is there anything wrong with my resume? Any suggestions on how I can improve my resume?", "upvote_ratio": 0.94, "url": "https://i.redd.it/pnzrhlx2nx7c1.png"}, {"author": "ReillyGod", "created_utc": 1642923842.0, "link_flair_template_id": "c292b8e0-28b9-11ec-874c-325b17e851a3", "link_flair_text": "I need feedback", "num_comments": 130, "post_id": "saobub", "score": 417, "subreddit": "resumes", "text": "\"\"", "title": "I updated my resume content and have optimized it for ATS", "upvote_ratio": 0.97, "url": "https://www.reddit.com/gallery/saobub"}, {"author": "Think-Yesterday-9012", "created_utc": 1651141439.0, "link_flair_template_id": "f54d73ce-28b9-11ec-bd91-1eac593353f0", "link_flair_text": "I'm sharing advice", "num_comments": 48, "post_id": "udrtkf", "score": 418, "subreddit": "resumes", "text": "\"I fucking had a single resume but based on the job,  I add required skills, projects to the old resume. I have applied for various jobs since last year, near got one. I thought I'm useless as i have low self esteem. Recently I was referred to a company by my friend and it's been a week, i got a call from my friend, he said I misspelt contact number. The lost opportunities because of fucking contact number, they could have emailed me. As email was correct( Yes, I got very few offers through mail )but most of companies call contact number in my place for a preliminary screening.\\n\\nYes I got a job finally\"", "title": "Fucking reason why I never got a job is because i misspelt my contact number since last year", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/resumes/comments/udrtkf/fucking_reason_why_i_never_got_a_job_is_because_i/"}, {"author": "Investment-Then", "created_utc": 1701364956.0, "link_flair_template_id": "c292b8e0-28b9-11ec-874c-325b17e851a3", "link_flair_text": "I need feedback - North America ", "num_comments": 318, "post_id": "187nurh", "score": 409, "subreddit": "resumes", "text": "\"Hey guys so I am going to be graduating soon, and i have already been applying but with no luck. Is my resume the problem?\\n\\nI will be applying for entry level IT roles, and Data Analyst/Business Analyst roles. I do taylor my resume based on every job description. My startegy has been to easy apply on Linkdin and Indeed. Where am i going wrong? Will anyone get back to me even tho i have not graduated yet? Thanks.\"", "title": "Is the job market shit, or is it my resume? I have been applying for a month, no luck.", "upvote_ratio": 0.94, "url": "https://i.redd.it/6sqkryuiri3c1.jpg"}, {"author": "an-unknownentity", "created_utc": 1685734110.0, "link_flair_template_id": "3d212a9a-f5cb-11ec-acef-1adb3b338801", "link_flair_text": "I need feedback - Asia ", "num_comments": 402, "post_id": "13ymcfn", "score": 402, "subreddit": "resumes", "text": "\"\"", "title": "Not getting any response. 200+ application. Looking for Software Engineer role. Only 2 interviews. Please let me know of any issues with my resume.", "upvote_ratio": 0.94, "url": "https://i.redd.it/zucfo5zlon3b1.png"}, {"author": "giomarinebiologist", "created_utc": 1626792287.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 61, "post_id": "oo3fi7", "score": 401, "subreddit": "resumes", "text": "\"Hello. I decided to ask for help here. Im a 23 years old marine biologist with depression and often suicidal thoughts. Since the day I graduated from university (march/21) untill now (july/21) I have spent each day sending resumes and applying to any jobs on my area (as a biologist, technical jobs, field assistant jobs, biology teacher jobs, lab jobs) and outside my area (receptionist, helper, assistant, cleaner, waitress). Today I checked my email box to have an idea of how many resumes I have sent since then, and I found out that I have tryed already 668 times AND got nothing as an answer, no interviews, nothing.\\n\\n&#x200B;\\n\\nThis messes up even more with my head and I dont even feel like a person anymore. I dont do anything good, Im always thinking about being unmployed and sinking in the food, internet and rent bills every month. I feel like shit and like a failure. Im a shame of asking for help for friends or family because I dont want to bother them with my problems and the problems that I was not capable of solving by my own. I dont think I have a chance in life or a better future and nothing that I do feels enough...\\n\\n&#x200B;\\n\\nI need help to see what I am doing wrong... This is the text I usually put on the email body and adapt according to the position:\\n\\n\\\"Good morning/afternoon. How are you?\\n\\n&#x200B;\\n\\nMy name is x, I am a biologist graduated from University x and if there is availability, I would like to apply for the position of x. I send my resume attached for analysis and I am available for any clarification.\\n\\n&#x200B;\\n\\nThank you,\\n\\nx\\\"\\n\\n&#x200B;\\n\\nAlso, I actually attached bellow my cv. Can anyone help me please? I sincerely appreciate any help...\\n\\n&#x200B;\\n\\nhttps://preview.redd.it/p8meoo26rdc71.png?width=810&format=png&auto=webp&s=a52a4997b365f077a3f10b2ca14558ee6fc28dce\"", "title": "Dont feel like a person anymore after sending 668 job applications and still got nothing", "upvote_ratio": 0.99, "url": "https://www.reddit.com/r/resumes/comments/oo3fi7/dont_feel_like_a_person_anymore_after_sending_668/"}, {"author": "TheAraminator", "created_utc": 1691362490.0, "link_flair_template_id": "c292b8e0-28b9-11ec-874c-325b17e851a3", "link_flair_text": "I need feedback - North America ", "num_comments": 303, "post_id": "15k3955", "score": 400, "subreddit": "resumes", "text": "\"\"", "title": "Auto rejected from 100s of jobs, what am I possibly doing wrong", "upvote_ratio": 0.92, "url": "https://i.redd.it/i7ce2zyzkkgb1.png"}, {"author": "leggomyreggo", "created_utc": 1599365977.0, "link_flair_template_id": "cdcd4a0a-5e48-11e5-ab02-1268f2b08dc1", "link_flair_text": "Engineering", "num_comments": 41, "post_id": "infojz", "score": 402, "subreddit": "resumes", "text": "\"As you may know from the title that I am currently 5 days in my dream job. I just recently graduated about 3 months ago and this subreddit has helped me in many ways. I have been ghosting for awhile just looking through other people's resume and try to gain ideas and ways to improve my own resume. Only now that I am coming out of my shell to speak about it.  I am glad this subreddit exist as I would have not got my dream job if it wasn't for this. To give you a rough idea of how my first resume looked like :  [https://imgur.com/Vco8ySY](https://imgur.com/Vco8ySY)(Yes I know its horrible LOL)\\n\\nI figured I share some information about myself, so I graduated in Electrical Engineer in NY with a GPA of 2.1. To be honest I was not the brightest student, but try my very best to learn.  I have struggled to find a job upon graduation and had no luck for about 3 months. Been getting denials due to my GPA and that is where it hit me the most. I know in reality that GPA was not important once you gain experience but as a recent grad it was my mentality at that time. I was applying to lower end jobs such as a technician to just gain experience and work my way up. Plus the pandemic slowed down the hiring process.\\n\\nBut anyways it was a struggle but I try to keep my mentality positive and kept applying, change up the resume for different job postings, etc. Eventually got a call for interview and the process took about two weeks and now I am in Houston,TX working as a NASA Contractor (Jacobs). I have been looking into space industry for awhile and my wish was fulfilled.\\n\\nThe point of this is to not brag, that I work for NASA. I want to tell all you redditors (if that make sense lol) that this can happen to anyone. Cause in the end, there is always a reason why it happen. Who knows you might get a call you would not expect and you will be glad that it happen. I was offered a position in Raytheon,Blue Origin, and Northrop but was not selected in case you don't know. My advice is to just keep applying and change up your resume based on the job posting. Keep moving forward and be positive don't let negativity get to you, whether it is about not being selected, not getting calls, etc. I have been in your route before and am pretty sure everybody else has been. It will be a struggle at first but will be worth in the end because you never know where you will end up.\\n\\nResume that landed the job: [https://imgur.com/TOi7Sqk](https://imgur.com/TOi7Sqk)\\n\\nPlease excuse any grammar or spelling errors.\\n\\nI know this is not the best place to post but I figured I share it with everyone as it can apply to them. Sorry for this long post haha!\\n\\nLet me know if anything, good luck to everyone!\"", "title": "After 100+ Applications, accepted 1 job offer, I am glad this subreddit exist. THANK YOU!", "upvote_ratio": 0.99, "url": "https://www.reddit.com/r/resumes/comments/infojz/after_100_applications_accepted_1_job_offer_i_am/"}, {"author": "iHeartSEM", "created_utc": 1693058433.0, "link_flair_template_id": "68336c78-16bb-11ed-81ea-020fc04d0e6d", "link_flair_text": "Success Story", "num_comments": 145, "post_id": "161w0mu", "score": 396, "subreddit": "resumes", "text": "\"I\\u2019m a former blue collar worker coming from the trucking world. I had quit my trucking job yesterday to make room for the surplus of interview times I was getting. (With 7 interviews, I figured it was impossible to not get hired for one of them) The first company i interviewed with had 2 rounds. I still had 2 companies to interview with today. 2 interviews Monday and 2 interviews Wednesday. All different companies. I woke up to a text this morning saying there were impressed and want to make my start date Monday! Now I have to cancel all the other interviews.\"", "title": "So I had 7 interviews lined up and I ended up getting a Marketing job with the first company I interviewed with! I didn’t even get to go to the other 6 interviews.", "upvote_ratio": 0.91, "url": "https://www.reddit.com/r/resumes/comments/161w0mu/so_i_had_7_interviews_lined_up_and_i_ended_up/"}, {"author": "Gutyenkhuk", "created_utc": 1683142390.0, "link_flair_template_id": "68336c78-16bb-11ed-81ea-020fc04d0e6d", "link_flair_text": "Success Story", "num_comments": 52, "post_id": "136x1je", "score": 391, "subreddit": "resumes", "text": "\"This will be my first real job out of college! It took me 3 months of applying, changed my resume twice, added a portfolio of my writing samples, AND: someone in this sub told me I should try reaching out to recruiters on LinkedIn. \\n\\nI did just that, and it was probably the main reason why I got the job. Only one person replied out of the 5 people I messaged, and my resume was finally reviewed by a human. \\n\\n(The next day I got a message from LinkedIn saying my digital application was \\u201crejected\\u201d, heh \\ud83d\\ude05).\\n\\nI read a lot of different opinions about that advice, but it luckily worked in my case! As someone with a language degree, this role/pay is great start for me + great career potential.\\n\\nJust wanna say thanks, you guys!\"", "title": "Got my first job making $30/hr as a fresh graduate!", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/resumes/comments/136x1je/got_my_first_job_making_30hr_as_a_fresh_graduate/"}, {"author": "basedgad", "created_utc": 1658251053.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 434, "post_id": "w2y1yu", "score": 389, "subreddit": "resumes", "text": "\"\"", "title": "I’ve applied to so many jobs and am losing hope at this point. When I tell everyone that I have a masters in mis and can’t find work they are in disbelief. What am I doing wrong ?", "upvote_ratio": 0.96, "url": "https://i.redd.it/5im0bcg86kc91.jpg"}, {"author": "throwaway1672828e526", "created_utc": 1693089044.0, "link_flair_template_id": "c292b8e0-28b9-11ec-874c-325b17e851a3", "link_flair_text": "I need feedback - North America ", "num_comments": 208, "post_id": "1628tuv", "score": 384, "subreddit": "resumes", "text": "\"I graduated high school and then have done nothing but sit in my childhood bedroom for 8 years, doing nothing\\n\\nI have no experience, I never volunteered, never did any extracurriculars in school, never developed any skills, I can barely even take care of myself and would be starving and homeless without my parents\\n\\nI can't drive, I don't have a license or a car, never had an income in my life except for birthday money from relatives occasionally\\n\\nI have no idea where to start, I don't know anything about resumes, or applying, or what I would even put on one or how I would even apply when I don't live within walking distance of any type of business or job opportunity\\n\\nI have extreme anxiety and it seems like all the shitty jobs that I may actually have a chance at involve customer service or something which there's just no way I could handle\\n\\nI am completely lost, and I just don't know what to do to start even trying to live my life 10 years too late\"", "title": "I am 26 years old and have never had a job, I have no idea where to start", "upvote_ratio": 0.89, "url": "https://www.reddit.com/r/resumes/comments/1628tuv/i_am_26_years_old_and_have_never_had_a_job_i_have/"}, {"author": "sunnyandglad", "created_utc": 1690295993.0, "link_flair_template_id": "c292b8e0-28b9-11ec-874c-325b17e851a3", "link_flair_text": "I need feedback - North America ", "num_comments": 469, "post_id": "159ae7y", "score": 383, "subreddit": "resumes", "text": "\"\"", "title": "No interviews, paid for this resume, what am I doing wrong??", "upvote_ratio": 0.92, "url": "https://www.reddit.com/gallery/159ae7y"}, {"author": "katepiva", "created_utc": 1706919249.0, "link_flair_template_id": "a3643b7a-8ae9-11e5-bea4-0e0467040b93", "link_flair_text": "I have a question", "num_comments": 321, "post_id": "1ahima3", "score": 377, "subreddit": "resumes", "text": "\"\"", "title": "My resume has been ignored for 6 months, I NEED HELP", "upvote_ratio": 0.94, "url": "https://www.reddit.com/gallery/1ahima3"}, {"author": "Affectionate-Owl-178", "created_utc": 1694085008.0, "link_flair_template_id": "68336c78-16bb-11ed-81ea-020fc04d0e6d", "link_flair_text": "Success Story", "num_comments": 48, "post_id": "16cd0xh", "score": 377, "subreddit": "resumes", "text": "\"I recently got a decent salary staff accountant position after being unemployed for like more than a year. I have no relevant finance/accounting degree (my BS is in Biology) and no relevant accounting or bookkeeping experience.\\n\\nThere were 200+ applicants and nothing about my resume was even remotely special. All I had on there was my degree, Excel as a skill, and some prior data entry experience I had at a low tier data entry job (like $17 an hour) which I left in less than half a year.\\n\\nI'm 100% confident the only reason I was hired is because I vibed with the main accountant who interviewed me over the phone and in person at the company headquarters and displayed to him that I was willing to begin training for the role as soon as possible. Also I indicated that I would be soon going back to take community college courses in accounting.\\n\\nNow I sit in a comfy office all day learning the accounting software and can't even believe it.\\n\\nAnd this after more than a year of applying to entry level science positions I was actualy qualified for but never even managed to score a phone interview.\"", "title": "After getting a nice job, I now realize luck is a huge factor.", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/resumes/comments/16cd0xh/after_getting_a_nice_job_i_now_realize_luck_is_a/"}, {"author": "None", "created_utc": 1656005343.0, "link_flair_template_id": "c292b8e0-28b9-11ec-874c-325b17e851a3", "link_flair_text": "I need feedback", "num_comments": 284, "post_id": "vj29sg", "score": 380, "subreddit": "resumes", "text": "\"\"", "title": "Help! I’ve applied to over 200 jobs and have not received any responses. No interviews. Nothing.", "upvote_ratio": 0.94, "url": "https://i.redd.it/iy9u8m4loe791.jpg"}, {"author": "vweavers", "created_utc": 1684427958.0, "link_flair_template_id": "f54d73ce-28b9-11ec-bd91-1eac593353f0", "link_flair_text": "I'm sharing advice", "num_comments": 42, "post_id": "13l3xcc", "score": 375, "subreddit": "resumes", "text": "\"Please review your resumes before sending.  I appreciate a good laugh, but if I'm looking for someone with attention to detail, this isn't it.\\n\\nhttps://preview.redd.it/pcdf4s3fbm0b1.png?width=2074&format=png&auto=webp&s=f339c61fcbcabd4172a51466942958f43b3b0c94\"", "title": "For the love of god...", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/resumes/comments/13l3xcc/for_the_love_of_god/"}, {"author": "OrderOfStego", "created_utc": 1686802053.0, "link_flair_template_id": "68336c78-16bb-11ed-81ea-020fc04d0e6d", "link_flair_text": "Success Story", "num_comments": 121, "post_id": "149s9dj", "score": 375, "subreddit": "resumes", "text": "\"After 280 applications, 40+ interviews, 4+ getting declined in the second round, I'm about to accept an offer! Way too exhausting of a process. For those of you still on the search, stay strong/persistent!\"", "title": "I got an offer coming tomorrow", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/resumes/comments/149s9dj/i_got_an_offer_coming_tomorrow/"}, {"author": "Losing-My-Marblz", "created_utc": 1690838945.0, "link_flair_template_id": "f54d73ce-28b9-11ec-bd91-1eac593353f0", "link_flair_text": "I'm sharing advice", "num_comments": 144, "post_id": "15eso74", "score": 369, "subreddit": "resumes", "text": "\"I\\u2019ve been in corporate recruiting for 15+ years and I have a huge request for job seekers out there. \\n\\n*Please please please* proofread your resume for errors. Make sure your formatting looks even, your employment dates flow correctly, and there are no misspelled words. \\n\\nI can\\u2019t tell you how many candidates I\\u2019ve screened over the years who were great candidates only to be excluded by hiring managers because of poorly made resumes. \\n\\nI\\u2019ve seen so many resumes that list being detail-oriented as a skill and the resume screams otherwise. \\n\\nI know it sounds silly, but please triple check before submitting. It makes a huge difference.\\n\\nEdit: Thanks for the back and forth on this. I didn\\u2019t expect to get any responses to this really. To clarify, I\\u2019m not rejecting these resumes. My hiring managers are after I speak with them and try to get them a second round. This was more of a plea than a complaint.\"", "title": "Please, please proofread your resume", "upvote_ratio": 0.92, "url": "https://www.reddit.com/r/resumes/comments/15eso74/please_please_proofread_your_resume/"}, {"author": "Bayareathrowaway32", "created_utc": 1684466380.0, "link_flair_template_id": "c292b8e0-28b9-11ec-874c-325b17e851a3", "link_flair_text": "I need feedback - North America ", "num_comments": 576, "post_id": "13ljjfn", "score": 374, "subreddit": "resumes", "text": "\"\"", "title": "Payed 200 dollars for a professional resume writer in January applied to over 200+ jobs since then and have gotten zero responses/interviews. Please Critique.", "upvote_ratio": 0.91, "url": "https://www.reddit.com/gallery/13ljjfn"}, {"author": "closedmouthsdonteat", "created_utc": 1686315890.0, "link_flair_template_id": "0348e2a0-5e50-11e5-8349-128d650819bd", "link_flair_text": "Other", "num_comments": 84, "post_id": "1454quk", "score": 371, "subreddit": "resumes", "text": "\"RIF announced they are shutting down after June 30th. Thats the end of it for me as well. \\n\\nI just want to shoutout this community for getting me through some extremely tough times. This sub has helped me go from a 2 column resume with no callbacks to interviewing for c-level roles and writing resumes for ex-FAANG employees. Although I still don't have a job that I'm satisfied with so I'm not living paycheck to paycheck, my resume would not be as strong as it is today if it wasn't for this community giving good feedback and the occasional recruiter giving me personalized feedback. That, I am grateful for. \\n\\nAs for me, I recently accepted a full-time hourly job, so I'm going to ride out this $16/hour overnight gig for a bit to catch up on some extremely late bills and will still be applying to jobs. After June 30th, I would love to see this community spin-off into maybe a discord server or similar. I will periodically come back before June 30th to see where this moves to. \\n\\nIf nothing happens after June 30th, I wish you all the very best on your job search and remember, use a 1 column resume! The mods have lots of great info posted in the stickys!\"", "title": "/r/resumes, its been a privilege to review resumes with you all", "upvote_ratio": 0.84, "url": "https://www.reddit.com/r/resumes/comments/1454quk/rresumes_its_been_a_privilege_to_review_resumes/"}, {"author": "Emily11234", "created_utc": 1687085171.0, "link_flair_template_id": "c292b8e0-28b9-11ec-874c-325b17e851a3", "link_flair_text": "I need feedback - North America ", "num_comments": 199, "post_id": "14cherw", "score": 366, "subreddit": "resumes", "text": "\"I have been applied to over 500 different job applications for over 7 months and I only received 10 job interviews. Is anyone else going through this or knows of any places currently hiring right now?  I am a college student and looking for a remote position.\"", "title": "Is anyone else noticing how hard it is to find a job currently?", "upvote_ratio": 0.92, "url": "https://www.reddit.com/r/resumes/comments/14cherw/is_anyone_else_noticing_how_hard_it_is_to_find_a/"}, {"author": "meknoid333", "created_utc": 1556551429.0, "link_flair_template_id": "99113188-93f4-11e4-867e-22000b268cc6", "link_flair_text": "Business", "num_comments": 62, "post_id": "biqq51", "score": 357, "subreddit": "resumes", "text": "\"Hello team, hope everyone is well -\\n\\nI've provided much critique over the last month or so - with positive and negative feedback.\\n\\nI have been on my own journey of looking for work since moving countries and have finally landed my dream job paying more then double what I was on back home.\\n\\nI have attached the resume that got me there in the hopes that you can get something out of it.\\n\\nWhile i didn't keep track of exact numbers - this resume got me head hunted via LinkedIn multiple times, about 50% of those head hunts ended up in a face to face interview with the company. Others i turned down, or didn't get past the recruiter.\\n\\nI have gotten to the final rounds of 6+ at giant companies in America - I have turned down 3 roles as they weren't for me and have two I am turning down today.\\n\\nThese companies were the following:\\n\\nDeloitte, JP Morgan, CapitalOne, Point B, USAA, American Express, Charles Schwab.\\n\\nThe job titles I was going after were primarily:\\n\\nProduct Management, Project Manager, Product Owner and Organizational Change Manager.\\n\\nAll of these roles are paying >$100k and were all over the US.\\n\\nIf anyone would like help with trying their linkedin, please let me know, i'll provide what help i can while I have down time. I'll share mine with you and hopefully this can help some people.\\n\\nOne key thing to remember for everyone is that your Resume is (in most cases) the FIRST insight a company gets about you as a person. It is a communication tool, to get you in the door. For this reason it is only 'step one', in landing your dream job. You will need to ensure you are ready for face to face and phone interviews, and this is where people also have issues.\\n\\nI hope this helps someone, and i really appreciate being given the opportunity to review so many peoples resumes here.\\n\\nFeel free to reach out if you have any questions.\\n\\nhttps://preview.redd.it/rso2lzfa18v21.png?width=1258&format=png&auto=webp&s=9ce0897eb1c12eadab4f588711ac470ae98d3090\"", "title": "Resume which successfully landed me multiple interviews and my dream job", "upvote_ratio": 0.99, "url": "https://www.reddit.com/r/resumes/comments/biqq51/resume_which_successfully_landed_me_multiple/"}, {"author": "International_Okra66", "created_utc": 1689824796.0, "link_flair_template_id": "2a28ff6c-1e47-11ee-bbce-e60b7c314d0a", "link_flair_text": "Discussion", "num_comments": 72, "post_id": "154g0pz", "score": 363, "subreddit": "resumes", "text": "\"Lol\\u2026struggling to find something in the job market and I continue to edit and refine my resume to the point I don\\u2019t even know what my skillset really is anymore or what I\\u2019m doing with my life. Anyone else feel that way?!\"", "title": "Has anyone edited their resume so much they don’t even know what they do anymore?", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/resumes/comments/154g0pz/has_anyone_edited_their_resume_so_much_they_dont/"}, {"author": "Impossible_Traffic87", "created_utc": 1688491770.0, "link_flair_template_id": "c292b8e0-28b9-11ec-874c-325b17e851a3", "link_flair_text": "I need feedback - North America ", "num_comments": 243, "post_id": "14qlfy3", "score": 352, "subreddit": "resumes", "text": "\"Looking to break into the Data Analytics field. I know I have what it takes, but I just don\\u2019t know what to change on here. Please don\\u2019t hold back. Any tips and suggestions appreciated.\"", "title": "Been a Stay-at-Home Mom for 4 years now. 35 and looking to get back to work but serious help needed with resume (US based). I have been applying left and right.", "upvote_ratio": 0.9, "url": "https://i.redd.it/6fn61hgxgz9b1.jpg"}, {"author": "Redd_Surfer_", "created_utc": 1674861631.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 44, "post_id": "10mzdap", "score": 350, "subreddit": "resumes", "text": "\"\\\\[Mod Approved Post\\\\]\\n\\nHi all\\n\\nI built a resume analysis tool (that I'm keeping free) that uses ChatGPT to analyze a resume against a specific job posting (ChatGPT is a very popular AI engine right now in case you didn't hear).\\n\\nThe app is here: [https://jobs-scout.com](https://jobs-scout.com)\\n\\nIt provides recommendations for what might be missing in a resume when compared to an actual job post (you can copy paste any job description or it can handle LinkedIn job post links)\\n\\nThis is my own personal project for fun which I built and maintain myself after I saw all the layoffs that happened in my tech industry. I'm a tech manager and I've done years of resume reviews, so tried to put what I've learned to use.\\n\\nIt's helped a few friends tweak their resume successfully now, and I see a lot of people struggling here to get call-backs, so I thought this might be helpful.  Any constructive feedback to improve it and help more people is always appreciated.\\n\\n**Update**: Added the auto-generation of a cover letter for the job posting based off the resume\"", "title": "[Mod Approved Post] A ChatGPT-driven resume analysis tool", "upvote_ratio": 0.99, "url": "https://www.reddit.com/r/resumes/comments/10mzdap/mod_approved_post_a_chatgptdriven_resume_analysis/"}, {"author": "Electronic-Pirate-84", "created_utc": 1689334041.0, "link_flair_template_id": "c292b8e0-28b9-11ec-874c-325b17e851a3", "link_flair_text": "I need feedback - North America ", "num_comments": 254, "post_id": "14zdvkm", "score": 353, "subreddit": "resumes", "text": "\"I\\u2019m deaf and English isn\\u2019t my first language. I\\u2019m trying to find a part-time job as a second income.\"", "title": "My friend said this resume is horrible. How can I fix it?", "upvote_ratio": 0.89, "url": "https://i.redd.it/dmcn4emf1xbb1.jpg"}, {"author": "Illustrious_Key2607", "created_utc": 1708365618.0, "link_flair_template_id": "c292b8e0-28b9-11ec-874c-325b17e851a3", "link_flair_text": "Review my resume • I'm in North America", "num_comments": 284, "post_id": "1auttjb", "score": 340, "subreddit": "resumes", "text": "\"\"", "title": "Please roast my resume, not getting a single interview in the past 6 months, been applying around 3000+ jobs (40-60 applications daily) I feel like giving up.", "upvote_ratio": 0.91, "url": "https://i.redd.it/937jff530ljc1.png"}, {"author": "andyr354", "created_utc": 1706368911.0, "link_flair_template_id": "c292b8e0-28b9-11ec-874c-325b17e851a3", "link_flair_text": "I need feedback - North America ", "num_comments": 69, "post_id": "1acd4b6", "score": 339, "subreddit": "resumes", "text": "\"\"", "title": "Resume advice - First time doing this in 23 years.", "upvote_ratio": 0.96, "url": "https://www.reddit.com/gallery/1acd4b6"}, {"author": "rage997", "created_utc": 1660816865.0, "link_flair_template_id": "19f3a5c0-f5cb-11ec-bbc5-12bdd01bc8ab", "link_flair_text": "I need feedback - Europe ", "num_comments": 252, "post_id": "wrfi87", "score": 344, "subreddit": "resumes", "text": "\"\"", "title": "I have a master's degree and I can't find a job. Been looking for ~3 months. I'm going into depression. Please, help me and roast my cv. I'm applying for entry-level Data Scientist", "upvote_ratio": 0.97, "url": "https://i.redd.it/6q97iccg3gi91.png"}]