[{"author": "janewalch", "created_utc": 1686623976.0, "link_flair_template_id": "5d7b6946-0047-11e3-ab17-12313b0cf20e", "link_flair_text": "Sales Topic General Discussion", "num_comments": 197, "post_id": "1484fby", "score": 1584, "subreddit": "sales", "text": "\"Been a long time lurker of this subreddit and have been trying to break into a legit sales role for years. I\\u2019ve been working 15-20 hour days driving Uber to barely crack $250\\u2026 Before gas, taxes, and operating costs. It was a miserable and grueling grind that I was starting to see no end to. \\n\\nOne night I get an Uber request from a gentleman in a beautiful mansion in Bel Air Ca. He was having me deliver a package to a location 15 miles away, picking one up from the drop-off, and bringing it back to him. At the end of the ride he asked if I would be open to doing private airport and delivery rides for him. We exchanged numbers and I didn\\u2019t hear from him for 6 months or so. \\n\\nHe messages me one night asking if I could pick up his brother (business partner) from the airport late the next night. I accepted. He then messaged me the following day asking if I could pick up his mother from airport as well. No problem at all. \\n\\nI had already researched him and found out that he is the founder of a global manufacturing company. I message him that evening asking if he had any openings at his company. I told him I would just love the experience and I would bust my ass. He told me to come in the next day for an interview. \\n\\nWe sat and talked for 30 minutes; he asks me if I would be willing to come onto the company in business development and sales. He offered be a competitive base salary, a competitive commission structure and full benefits right there on the spot. That was a week ago today. Today was my first day.\"", "title": "It finally happened …", "upvote_ratio": 0.99, "url": "https://www.reddit.com/r/sales/comments/1484fby/it_finally_happened/"}, {"author": "timbotx", "created_utc": 1704924239.0, "link_flair_template_id": "5d7b6946-0047-11e3-ab17-12313b0cf20e", "link_flair_text": "Sales Topic General Discussion", "num_comments": 596, "post_id": "193klqc", "score": 1150, "subreddit": "sales", "text": "\"Video here - https://twitter.com/BowTiedPassport/status/1745149758992195647\\n\\nRemember kids - company loyalty died around the same time as the pension.\"", "title": "AE records her termination call. Cloudflare layoffs... again", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/sales/comments/193klqc/ae_records_her_termination_call_cloudflare/"}, {"author": "Yeezus_aint_jesus", "created_utc": 1665611229.0, "link_flair_template_id": "5d7b6946-0047-11e3-ab17-12313b0cf20e", "link_flair_text": "Discussion", "num_comments": 216, "post_id": "y2gk63", "score": 1149, "subreddit": "sales", "text": "\"Not here to flex or shit on anyone. I fucking love this subreddit and don\\u2019t have many people I\\u2019d be willing to share this with. Just got comped out at 55k for a commission check. \\n\\nBorderline in a manic/ crying state over this. I joined this sub in 2020 during covid. I was making 28k a year doing security, and cold called for a shitty B2B security sales job off of advice from people here. Went to 60k a year then got a SDR job and grinded like a mf at 70k OTE and got promoted to AE with 100k. This was a great quarter for me and I got a commission payout north of 55k.\\n\\nI know its cliche but drink the juice here, Ive had ups and downs but people are so supportive here.\"", "title": "Just got my largest commission check of my life.", "upvote_ratio": 0.99, "url": "https://www.reddit.com/r/sales/comments/y2gk63/just_got_my_largest_commission_check_of_my_life/"}, {"author": "KombuchaWarfare", "created_utc": 1637774864.0, "link_flair_template_id": "71af4a56-ccf8-11e5-9ace-0e55464bea03", "link_flair_text": "Off-Topic", "num_comments": 239, "post_id": "r1addl", "score": 1044, "subreddit": "sales", "text": "\"I don't really have anyone to share this with. Friends aren't in sales and my wife isn't either, so no one knows the \\\"rush\\\" of finally closing a big deal/long sales cycle.\\n\\nI have worked in sales for decades but recently moved into the more lucrative IT space, making this by far the biggest deal that I have ever closed, outside of supporting large contracts where I only to a portion of the work.\\n\\nCheers everyone! Happy selling.\\n\\n&#x200B;\\n\\nEdit: Thanks for the awards! You're all closers in my book, now go get yourself some coffee. \"", "title": "$750,000 Deal Closed", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/sales/comments/r1addl/750000_deal_closed/"}, {"author": "squattersrights25", "created_utc": 1669926811.0, "link_flair_template_id": "5453fc20-0047-11e3-8319-12313b0eb082", "link_flair_text": "Resource", "num_comments": 177, "post_id": "z9yvnc", "score": 1031, "subreddit": "sales", "text": "\"This is the third deal I\\u2019ve posted about this year. It\\u2019s been a good year. Happy to answer any questions.\\n\\nEdit: I AM NOT IN SAAS. There are other sales out there believe it or not\\u2026\"", "title": "I woke up to a Docusign signature to complete a $3.3 million deal this morning. Let’s go!!!!", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/sales/comments/z9yvnc/i_woke_up_to_a_docusign_signature_to_complete_a/"}, {"author": "BabyInMyBlender", "created_utc": 1656688263.0, "link_flair_template_id": "5d7b6946-0047-11e3-ab17-12313b0cf20e", "link_flair_text": "Discussion", "num_comments": 151, "post_id": "vp34kc", "score": 988, "subreddit": "sales", "text": "\"Another laid off post team. Got let go after less than 60 days. They are \\\"restructuring the team\\\" and \\\"changing strategies\\\" and let go of a 60% of the sales team. When I was interviewing, they mentioned each rep does about 20 demos a week, all inbound. Even showed me calendars and numbers of people signing up per month. In the past 6 weeks, after my initial 2 week onboarding, I've had 7 total demos. 7. Not 20 a week, 7 total in 6 weeks. Manager was completely removed from myself, did not participate whatsoever in helping me develop, we had 3 1on1's total in 6 weeks since he kept cancelling them asking to do them async. I could sit here and list all of the things I've contributed to their company in my short tenure, but no point. Would not want to continue working for a place like this anyway.\\n\\nI'm back on the horse, already began interviewing, and coming in hot for the rest of 2022. Just needed to vent and needed some good vibes from the crew.\\n\\nPEACE!\\n\\nUPDATE: 1 hour in, 12 down, hiring managers have been messaged, only 150+ more to go: https://imgur.com/a/cTuS3AN\\n\\nUPDATE 2: 2 hours in, another 12 down, ordered Wingstop in between cause why not, self care fam. Still 150+ to go, but gonna crush this 10 piece combo first homies: https://imgur.com/geOcwrM\"", "title": "Well boys and girls, another laid off post coming at you. I'll complete one application for every upvote. Gonna make the rest of 2022 my bitch.", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/sales/comments/vp34kc/well_boys_and_girls_another_laid_off_post_coming/"}, {"author": "None", "created_utc": 1645453710.0, "link_flair_template_id": "5d7b6946-0047-11e3-ab17-12313b0cf20e", "link_flair_text": "Discussion", "num_comments": 64, "post_id": "sxut9f", "score": 924, "subreddit": "sales", "text": "\"Not sure how many of you have seen the new Kanye documentary on Netflix (it\\u2019s worth a watch regardless of what you think of him imo) but wanted to point out and discuss one scene.\\n\\nThe documentary follows Kanye before he was famous as he\\u2019s trying to get signed to a record label and release his first album. He does this by leveraging his network of other rappers and record label personnel playing his songs for them any chance he gets. \\n\\nIn one scene, he decides to show up at a record labels office unannounced. He walks in, goes into random offices/cubicles, and is able to find a couple people willing to briefly listen to him. He plays them an early version of \\u201cAll Falls Down\\u201d, a single that eventually went double platinum and helped propel his first album to critical and commercial success.\\n\\nAs people in this community might guess, he cannot get anyone to react or take any action upon hearing this song. People are taking phone calls, typing emails, asking him to stop since they have other meetings, the only person who sort of engages with the song is the receptionist and even her opinion is ambiguous.\\n\\nSometimes when I\\u2019m feeling down I start to wonder if the product I\\u2019m selling is really in demand or if customers really need it. This scene got me thinking that even if you have an amazing product, perfect customer fit (this label did eventually sign him), charisma and self conviction, people are still going to regularly ignore and automatically file you to the bottom of their priority list when you\\u2019re out selling. All you can do is keep grinding and finding the people that eventually get you to reach your goals\"", "title": "Watching Kanye struggle to cold call", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/sales/comments/sxut9f/watching_kanye_struggle_to_cold_call/"}, {"author": "IMadeARedditForThis", "created_utc": 1640539791.0, "link_flair_template_id": "71af4a56-ccf8-11e5-9ace-0e55464bea03", "link_flair_text": "Off-Topic", "num_comments": 135, "post_id": "rp1h2t", "score": 926, "subreddit": "sales", "text": "\"I closed a deal this week that was larger than my yearly quota. I was already at quota so its all in accelerators.\\n\\n\\nCan\\u2019t tell my friends about it because it\\u2019s enough money to make people jealous but wanted to tell someone.\\n\\nDeal alone is paying me multi-six figures. Never expected to be making this much at this point in my career.\"", "title": "Just won a deal larger than my annual quota", "upvote_ratio": 0.99, "url": "https://www.reddit.com/r/sales/comments/rp1h2t/just_won_a_deal_larger_than_my_annual_quota/"}, {"author": "Disastrous_Gap_4711", "created_utc": 1708271190.0, "link_flair_template_id": "5d7b6946-0047-11e3-ab17-12313b0cf20e", "link_flair_text": "Sales Topic General Discussion", "num_comments": 133, "post_id": "1atx0i8", "score": 906, "subreddit": "sales", "text": "\"Hey all,\\n\\nI\\u2019m sharing something which has changed my sales game and also changed my life. I\\u2019m sitting here on a Sunday morning with a clear head, life is in order and job is going really well.\\n\\nI\\u2019m in b2b sales, professional services. Been in the space for coming up on 8 years. Across these roles I\\u2019ve drank wine, beer, taken shots with customers, drank cocktails and ate a shit ton of company-paid-for food. I\\u2019m now back in a head of sales role where I carry quota. It\\u2019s field sales with a minimum of 5 lunches/dinners a week and mostly in alcohol-fueled environments. I do events 8 times a month too and it was common for me to get to Friday having had around ~15 beers that week already, before any kind of weekend socializing.\\n\\nI was overweight from the unhealthy nature of the job. I really didn\\u2019t want to be hungover from work, not able to focus and being forced to drink by the etiquette of the job. I was also worried that I\\u2019d feel pressure to drink, that it wasn\\u2019t possible to do this job without having alcohol, people wouldn\\u2019t trust me etc. So much head trash.\\n\\nI decided I wouldn\\u2019t let this job and alcohol take over my life again. I decided to turn it into a positive impact on my life.\\n\\nI posted in this sub and got some good tips. I decided I would still buy drinks for clients, buy them food etc but I would just do zero alcohol beers: Heineken zero, Guinness zero or whatever they have in the bar. When it comes to food, to keep it healthy-ish I always go to a steak place and I just get a really good steak like a ribeye and have that with veg. When it\\u2019s 1-1 with a prospect I sense they can be a little uncomfortable I\\u2019m just drinking zero alcohol beers but in a group it\\u2019s fine, I let the pre-sales guys get wasted and everyone is happy.\\n\\nThe end result is that I\\u2019m closing more business, I\\u2019ve lost 11kg (23lbs) from alcohol calories and drunk food, I feel better, I look better, I\\u2019m having better quality and deeper relationships with my prospects, the pre-sales guys love it and the customer trusts me more because I\\u2019m seen as the responsible adult at the table. I was really concerned about it initially, but the zero alcohol beers have changed my life for the better. Do whatever suits you but if you\\u2019re stuck in a role where you feel you have to drink, this is a potential alternative.\"", "title": "Zero alcohol beers changed the game for me", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/sales/comments/1atx0i8/zero_alcohol_beers_changed_the_game_for_me/"}, {"author": "Flashy_Dig", "created_utc": 1701299838.0, "link_flair_template_id": "5d7b6946-0047-11e3-ab17-12313b0cf20e", "link_flair_text": "Sales Topic General Discussion", "num_comments": 261, "post_id": "18735g5", "score": 901, "subreddit": "sales", "text": "\"Everyone in my circle isn\\u2019t in sales so don\\u2019t have anyone who understands the accomplishment. I\\u2019m usually a 600k- 800k/yr seller so I\\u2019m stoked to finished out my year just over a million bucks sold. Taking a week vacation to celebrate! \\n\\nGood luck over the holidays.\\n\\nEdit: Just wanted to say thank you to everyone for the support. I didn\\u2019t expect this post to blow up as much as it did. \"", "title": "Hit my goal of selling a million within 12 months.", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/sales/comments/18735g5/hit_my_goal_of_selling_a_million_within_12_months/"}, {"author": "hegezip", "created_utc": 1596122738.0, "link_flair_template_id": "c9fc1b2a-f336-11eb-aa47-8a6995011801", "link_flair_text": "Best of r/Sales", "num_comments": 162, "post_id": "i0nzd8", "score": 902, "subreddit": "sales", "text": "\"Couple tips based on my findings:  \\n\\n\\n- You should say \\\"you\\\" 10 times more than \\\"I\\\"\\n- Your email shouldn't be more than 5 sentences\\n- Your copy shouldn't contain more than 70 words\\n- Don't add a \\\"booking link\\\" at the end and ask for them to select a time before they actually expressed an interest to talk\\n- Use interest-based CTAs instead of saying \\\"how does Friday 10am works for you?\\\". \\n- Personalize your reach out by finding something relevant about them that would be difficult for a robot to automate and tie it back to the reason why you reach out\\n- Don't talk about your company in a direct way, but talk about the problems your prospects face\\n- Don't mention your company's name in the copy, but mention the firms that are clients of yours or competitors of theirs\\n- Use \\\"pattern interruption\\\" methods\\n- Alternate short and longer sentences to keep your reader engaged\\n- Don't use any formating \\n- Consider at least 8 touchpoints before moving on to the next person\\n- Never say that you're \\\"the best\\\" at anything. \\\"Show, don't tell\\\".\\n\\nSome of you asked for the methodology + industries, here it is\\n\\n- 4 other sales director + myself pulled our CRM data together, I did the heavy lifting\\n\\n- industries: online marketing, recruiting, software (up to $10k ACV), consulting\\n\\n- I looked at email templates that had been used at least 400 times each to take things that were statistically representative\\n\\n- I had CRM data to tie the meetings booked with the sequences that were used\\n\\n- Within the sequence, I had data to show at which step/touchpoint the meeting was booked\\n\\n- that way, I was able to get the science behind the sequence itself and the \\\"winning\\\" email if you consider that the last touch should be used to measure overall success\\n\\n- took me 7 days to compile everything, I'm by no means an Excel guy so I probably did a lot of things manually that could have been automated\\n\\nFor interest-based CTAs, since it was a recurring subject  \\n\\nInstead of asking: \\\"when's a good time to talk to you?\\\" which feels very invasive, and people are so protective and defensive when it comes to their time, you can soften your approach with an interest-based CTA\\n\\nHere are a few examples:\\n\\n- Is this a relevant topic for you?\\n\\n- Would you like to explore?\\n\\n- Is this subject top of mind?\\n\\n- Would you like to run this by your team?\\n\\n- Were you giving this any thoughts?\"", "title": "I analyzed 64,562 \"cold\" emails sent over the last 2 years, here's how you should (probably) rewrite yours", "upvote_ratio": 0.99, "url": "https://www.reddit.com/r/sales/comments/i0nzd8/i_analyzed_64562_cold_emails_sent_over_the_last_2/"}, {"author": "G-LawRides", "created_utc": 1702418937.0, "link_flair_template_id": "5d7b6946-0047-11e3-ab17-12313b0cf20e", "link_flair_text": "Sales Topic General Discussion", "num_comments": 182, "post_id": "18gy0na", "score": 896, "subreddit": "sales", "text": "\"Everyone wants to be a presidents club member. \\n\\nI see a lot of folks making similar claims in this group about being top performers in their sales rolls. \\n\\nI congratulate you folks. \\n\\nI\\u2019ll say something sightly different. \\n\\nI\\u2019ve been in sales for over 20 years and I\\u2019m an average sales rep, at best. \\n\\nI don\\u2019t make a ton of money. \\n\\nI\\u2019m not particularly excited about what I sell. \\n\\nI don\\u2019t even know if I really enjoy what I do. \\n\\nWhat I do know is I\\u2019ve met some pretty cool people in my time, both customers and coworkers. \\n\\nI\\u2019ve helped train sales people who went on to become significantly better at sales than I am and make way more money than I do. \\n\\nI\\u2019ve learned a ton about many different industries.\\n \\nSales can be insanely lucrative and it can suck in a lot of major ways. \\n\\nIf you\\u2019re new to sales, do yourself a favor and learn as much as you can about sales, sales cycles, your market, communications, human behavior, money, etc.. \\n\\nNo real point to this post other than I wanted to put a little out there about sales that\\u2019s grounded and not the typical hype. \\n\\nNot everyone can be a top sales rep. \\n\\nSimilarly not everyone is a top performing athlete. \\n\\nPlenty of room for us average folks to be in here and make a little more money than the typical job. \\n\\nBe cool to everyone you speak with and you might end up doing better than you expect. \\n\\n\\u260e\\ufe0f=\\ud83d\\udcb0\"", "title": "20+ years, average sales rep", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/sales/comments/18gy0na/20_years_average_sales_rep/"}, {"author": "Compost_My_Body", "created_utc": 1663086868.0, "link_flair_template_id": "5d7b6946-0047-11e3-ab17-12313b0cf20e", "link_flair_text": "Discussion", "num_comments": 308, "post_id": "xdc8m2", "score": 895, "subreddit": "sales", "text": "\"90% of the posts that end up on my timeline are \\u201cI have depression and hate sales what do I do?\\u201d\\n\\nThis was a networking and educational space and that content is getting crowded out by upset SDRs. \\n\\nThere is absolutely value in their concerns - they are obviously held by many - but those concerns are *maybe* 1% of sales, and are taking up way too much of the community\\u2019s emotional labor.\\n\\nCan we set up a faq or weekly complaint thread? Or limit these kinds of posts to one per day? The subreddit is not appealing to established sales professionals.\\n\\nEdit: the dichotomy of responses is pretty telling of org roles in my opinion.\"", "title": "Wtf is happening to /r/sales", "upvote_ratio": 0.92, "url": "https://www.reddit.com/r/sales/comments/xdc8m2/wtf_is_happening_to_rsales/"}, {"author": "BelgiansAreWeirdAF", "created_utc": 1653689539.0, "link_flair_template_id": "71af4a56-ccf8-11e5-9ace-0e55464bea03", "link_flair_text": "Off-Topic", "num_comments": 64, "post_id": "uz96ik", "score": 885, "subreddit": "sales", "text": "\"I said \\u201cdo you want this water?\\u201c \\n\\nHe said \\u201cyes\\u201c \\n\\nI said \\u201cjust give me five dollars and the water is yours.\\u201d \\n\\nHe said, \\u201cwait hold on now, I didn\\u2019t know this is going to cost me. I can just run over to the sink and grab myself some water.\\u201c \\n\\nI said, \\u201creally? What is your net worth?\\u201c \\n\\nHe said, \\u201cI make $1 million a year.\\u201c \\n\\nI said, \\u201cand you\\u2019re really going to waste your time walking all the way over to the sink to grab a glass of water just to save five dollars on the one right in front of you? Is that really a valuable use of your time, given how much your time is worth? Just buy this water, it is only five dollars. It will save you the time of walking to the sink, and it will get our conversation wrapped up now, so you can continue with your busy day and better spend your valuable time. Shake my hand on it, and I will go to your AP group and deliver my invoice.\\u201c \\n\\nI reached out my hand and we shook on it. I went over to his AP group, but they required a PO be in place to close an invoice. So, I went over to their purchasing group and asked for the purchase order. They gave me a purchase order with terms and conditions with a cancellation clause and indemnification clause that was questionable. \\n\\nI told them, \\u201cI\\u2019m going to have to bring this to my contracts group for review. I don\\u2019t believe I can sign these terms and conditions as-is.\\u201c \\n\\nSo I went to my contract lawyer and discussed the scope of the contract. After paying $1500, he spent 3 weeks redlining the terms and conditions on the purchase order, which I delivered back to the purchasing department. \\n\\nAfter a few weeks of back-and-forth negotiations, we arrived to an agreement based off of the scope of the business decision. I took the finalized agreement to the accounts payable group along with my invoice. After 30 more days I did not hear back, so I sent them a passive-aggressive email asking when we can close out this invoice? After another week they responded, apologizing, saying some of their staff was out for an ethnic holiday, but now they would get to the invoice payment right away. \\n\\nOne week later I get a call asking if I can fill out an ACH form so that they can wire the funds next day. I filled out the form, sent it back, and received my payment three days later. Afterwards, I go back to the hiring manager and tell him that I did it. He gave me the job on the spot!\"", "title": "Interviewer asked me to “sell this glass of water.” I got the job! Here’s how I did it..", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/sales/comments/uz96ik/interviewer_asked_me_to_sell_this_glass_of_water/"}, {"author": "Jas1540", "created_utc": 1664597024.0, "link_flair_template_id": "bdab74fe-cd00-11e5-a1b1-0ee60891a65b", "link_flair_text": "Career", "num_comments": 135, "post_id": "xsljdy", "score": 842, "subreddit": "sales", "text": "\"End of Q3\\nPeople had no faith - got In touch with the procurement contact and developed a relationship and got this to come in at 3pm pst \\n\\n\\n1.5m$ contract with around 6figures in commissions\\n\\n\\nLost after college I said fuck it and tried sales\\n\\nI sold Womens shoes\\n\\nI sold cars \\n\\nI sold Bank Loans\\n\\nI was an old BDR \\n\\nI sucked as a BDR after changing to cyber \\n\\nI almost quit many days\\n\\nI was shitted on by others when I sucked\\n\\nGot tired and changed my habits and turned myself into at least someone that at least tried \\n\\nAfter 5 years of growing pains \\n\\nI fucking closed the biggest deal of my life \\nI did it once (but people called it a fluke)\\n\\nAfter getting let go during covid from my previous company despite hitting goal - my confidence was low \\n\\nBut I fucking toughed it out and took the punches\\n\\nI know it\\u2019s only a deal and there are always bigger deals- but today I feel like I finally turned a page.\\n\\nI feel lucky \\ud83c\\udf40 \\nBut I also know I put in the hours \\n\\n\\nToday I am having a nice glass of wine\\n\\nGot my cat a salmon filet treat\\n\\nAnd hanging out with the gf watching her show \\n\\nAs a son of immigrants- I\\u2019m fucking blessed\\n\\nThis is the American dream they told me about \\n\\n\\nSales is awesome\\n\\n\\nEdit: Sales Reddit. Thank you for the kind words \\n\\nThis shit can be a grind so nice to know I\\u2019m not alone out there trying to do it my way. \\n\\nI remember when people told me sales isn\\u2019t a real profession !!\"", "title": "I fucking did it … biggest deal yet", "upvote_ratio": 0.99, "url": "https://www.reddit.com/r/sales/comments/xsljdy/i_fucking_did_it_biggest_deal_yet/"}, {"author": "None", "created_utc": 1634375861.0, "link_flair_template_id": "5d7b6946-0047-11e3-ab17-12313b0cf20e", "link_flair_text": "Discussion", "num_comments": 126, "post_id": "q98jqb", "score": 812, "subreddit": "sales", "text": "\"Hi,\\n\\nI make $13/hr washing dishes in a claustrophobically small room with no windows. The walls are caked in mold and dried tomato sauce; a fluorescent light flickers relentlessly. The work is filthy, thankless, and exhausting. \\n\\nAfter a month long interview process, I was just officially offered a remote SaaS BDR role. My salary is generous and so is the commission.\\n\\nI\\u2019m 25. I have no college degree; no prior white collar experience of any kind. I got this job by sending an email, prepping thoroughly and selling myself hard in my interviews. First and only company I applied to. \\n\\nI got off the phone call in which I heard how much I would be paid and cried from sheer joy. To think I will be making this much from home is surreal. I can finally walk away from food service, an industry that has been so detrimental to my wellbeing. I felt trapped for years and one month of believing in myself has changed everything. I\\u2019m hanging my crocs up as motivation to crush my quotas and never go back to the kitchens.\\n\\nI want to offer my experience as a perspective to remind you that, for all the challenging aspects of your sales job, it still probably beats working in a god damned restaurant.\"", "title": "Perspective from a dishwasher.", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/sales/comments/q98jqb/perspective_from_a_dishwasher/"}, {"author": "squattersrights25", "created_utc": 1655922027.0, "link_flair_template_id": "257e55e4-0047-11e3-b199-12313b0eb082", "link_flair_text": "Advice", "num_comments": 125, "post_id": "vibqdo", "score": 799, "subreddit": "sales", "text": "\"This is my second big sale of the role. The customer was an inbound lead in November that took many months of negotiating to close.\\n\\nThere were about 100 times when I was sure it would fall apart. I tried my best to cut through the red tape on both sides and finally got it signed in the end.  To anyone out there struggling, the daily grind is worth it and will pay off in the end!\"", "title": "I just closed a $2.6 million sale today! Hard work pays off!", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/sales/comments/vibqdo/i_just_closed_a_26_million_sale_today_hard_work/"}, {"author": "killingicarus", "created_utc": 1690493626.0, "link_flair_template_id": "cb17fda0-53ce-11ec-971c-4ae2f62176a6", "link_flair_text": "Sales Leadership Focused", "num_comments": 80, "post_id": "15be89b", "score": 800, "subreddit": "sales", "text": "\"Be me. AE.\\n\\nHate cold calling. Want more $$ less work. \\n\\nLight bulb.\\n\\nGet to mgmt. no more cold calling. Just close deals. Make other people call for me.\\n\\nInitiate plan. \\n\\nCold call enough to get good. Build pipeline. Close deals. Start coaching sales team without them asking. \\n\\nBrag about my accomplishments incessantly on teams chat. \\u201cLook what I did , you can do it to\\u201d \\n\\nBoss recognizes my abilities. Sees me bragging in front of sales team. Sees me giving unwanted advice. Leadership101.pdf\\n\\nBoss light bulb go off. Need sales manager, whip sales team in shape. Now boss have to do less work managing team. now more free time to look at secretary ass. \\n\\n\\nBe me. Sales manager. No more cold call.\"", "title": "Be me. Sales manager.", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/sales/comments/15be89b/be_me_sales_manager/"}, {"author": "mysteryplays", "created_utc": 1702691078.0, "link_flair_template_id": "5d7b6946-0047-11e3-ab17-12313b0cf20e", "link_flair_text": "Sales Topic General Discussion", "num_comments": 516, "post_id": "18jg6ak", "score": 790, "subreddit": "sales", "text": "\"I do tech sales and have my own business and make $100k doing like nothing compared to my hard working friends and family. \\n\\nThey have \\u201creal jobs\\u201d and boy are they always so busy and tired. Meanwhile I\\u2019m waking up in a toasty bed beside my cat, crack open my laptop and start working in bed. \\n\\nThe people in my company all went to prestigious schools and here I am a drop out pothead making just as much. \\n\\nYa it\\u2019s great to have money but nothing feels fulfilling about this. I feel like I keep buying shit to fill a hole that is suppose to be my passion/career. \\n\\nSales is a means to an end but it does not fill the soul\\u2026..\\n\\nEdit: The people asking me questions about how to break into sales in my PM\\u2019s is giving me purpose. Keep asking. I can\\u2019t get you hired but I can steer you in the right direction and would love to stay posted on your sales journey. \"", "title": "Who else feels like they are using cheats in life?", "upvote_ratio": 0.92, "url": "https://www.reddit.com/r/sales/comments/18jg6ak/who_else_feels_like_they_are_using_cheats_in_life/"}, {"author": "getinthereFreddy", "created_utc": 1680784803.0, "link_flair_template_id": "5d7b6946-0047-11e3-ab17-12313b0cf20e", "link_flair_text": "Sales Topic General Discussion", "num_comments": 102, "post_id": "12dj2jy", "score": 778, "subreddit": "sales", "text": "\"Hey sorry guys I\\u2019m on mobile and not sure how to grab the link but you can see my first post in my history.\\n\\nSo my update is pretty satisfying (for me anyway).\\n\\nAround 2:00 PM my boss called me. He said he found my CV on Indeed listed as actively looking.\\n\\nI basically told him that after our last few conversations I haven\\u2019t felt very secure and now I\\u2019ve been put on a PIP, so yes I was putting my feelers out.\\n\\nHe was very clearly trying to get me to say \\u201cI quit\\u201d.  But I need the unemployment so I kept leaving the ball in his court (\\u201cI don\\u2019t know, you tell me where we go from here\\u201d).\\n\\nI ended up getting fired.  Anyway!\\n\\n2 hours later, I get a call from my top choice new employer. Lol obviously accepted. Timing was perfect \\ud83d\\ude0e  \\n\\nPeace \\u270c\\ufe0f\"", "title": "Update: Put on a PIP - Insulted", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/sales/comments/12dj2jy/update_put_on_a_pip_insulted/"}, {"author": "rumple4skyn", "created_utc": 1637981775.0, "link_flair_template_id": "bdab74fe-cd00-11e5-a1b1-0ee60891a65b", "link_flair_text": "Career", "num_comments": 138, "post_id": "r33kqs", "score": 779, "subreddit": "sales", "text": "\"I grew up very poor. We got food from the food shelter and were only not homeless because of donations. My father was a (just passed at 70) chronic alcoholic and my mother suffered(s) from debilitating anxiety. I spent a lot of my formative years with strangers living in my home with me.\\n\\nI went to tech school for HVAC, did ok got married, and was able to scrape by to provide for my family in not-so-great apartments in my area. My wife finally convinced me to go into HVAC sales but the 100% commission salary scared me too much. I bit the bullet 2.5 years ago. \\n\\nI will be taking 18k gross for November, I am weeping.\\n\\nThat is more than my entire household family yearly income when I was 13 (I was working full time then.\\n\\nI want to cheer and tell friends and family but it feels rude. I cannot tell you what it means for me to provide.\"", "title": "I have no one else to talk to about this", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/sales/comments/r33kqs/i_have_no_one_else_to_talk_to_about_this/"}, {"author": "TotesMcGoatzzz", "created_utc": 1550709570.0, "link_flair_template_id": "c9fc1b2a-f336-11eb-aa47-8a6995011801", "link_flair_text": "Best of r/Sales", "num_comments": 121, "post_id": "aswatc", "score": 759, "subreddit": "sales", "text": "\"We all struggle to sell at times.\\n\\nIf you're having trouble at the moment, whether you are a sales veteran or a complete newbie, ask yourself if you're doing the following actions. If you're not, then you're certainly not doing your best, and that's not acceptable:\\n\\n---\\n\\n* Are you getting yourself into the right mental state beforehand? (Ex: playing your favorite music, saying affirmations, looking at your vision board, or literally whatever makes you feel confident and upbeat)\\n\\n\\n* Are you getting into the right physical state? (Ex: exercise, diet, doing a few pushups, etc.)\\n\\n\\n\\n* Are you training every day to learn something new about sales? (Ex: watching a sales training video, reading a sales book, reading about psychology, etc.)\\n\\n\\n* Are you learning something new about your industry every day? (Ex; industry magazines, Facebook groups where your prospects hang out, etc.)\\n\\n\\n\\n* Are you role playing / rehearsing your script or a particular part of your script?\\n\\n\\n\\n* Are you writing down (or otherwise logging) *every single* objection you get, whether it is in the prospecting call, qualification step, presentation, trial close, close, referral request, or at any point during the sale?\\n\\n\\n\\n* Are you *practicing your rebuttals* for the objection(s) you get most often, on a daily basis?\\n\\n---\\n\\nIf you're not doing the above actions, which are all free and only require your time, then don't complain about your lack of sales.\\n\\nAnd don't wonder why you're struggling. Do everything above for a week and see if you're still in a slump.\\n\\nSales is about effort, and luckily that's the only thing you can truly control anyway.\\n\\nEdit (a quick addition): \\n\\n* Are you prospecting? You can't close deals if you have an empty funnel!\\n\\nEdit 2: Link to the **infographic** that u/SellKid created out of this post. Thanks man, I'm going to print this out and hang it up in my office!: https://drive.google.com/drive/folders/1_Fxni0jw73c9EbcNzhCbNQKtzu6Nf8m0?usp=sharing\"", "title": "If you're struggling to sell, do THIS", "upvote_ratio": 0.99, "url": "https://www.reddit.com/r/sales/comments/aswatc/if_youre_struggling_to_sell_do_this/"}, {"author": "fossilized_poop", "created_utc": 1685368904.0, "link_flair_template_id": "c9fc1b2a-f336-11eb-aa47-8a6995011801", "link_flair_text": "Best of r/Sales", "num_comments": 282, "post_id": "13uvsrs", "score": 747, "subreddit": "sales", "text": "\"I finished up a month long project of listening to 100 sales calls to understand what made the top performers so much better than the average and bottom performers.\\n\\nI kept a \\\"score sheet\\\" of each call that had a total of 30 \\\"check lists\\\" things to listen for.  I listened for things like rapport, types of questions, DM landscape, pricing strategy, closing ability, up front contracts, trial closes, open vs closed ended questions and on and on.\\n\\n**EDIT TO ADD: This is a sales floor of 26 sales people selling B2B SaaS. Average deal size is $32k in first year revenue and requires a contract.  Average contract length 19 months (meaning we sell 1 and 2 year and that is the average).**  \\n\\nBelow are my key findings and boy were they eye opening.\\n\\nThe main point take away would be this - the quality of the lead is way more important than anything else.  The top sales people don't do anything special; it's more what they don't do that is the difference.  They keep it simple and just ask \\\"would you like paper or plastic\\\"\\n\\n* Rapport - The top sales people have almost zero rapport.  Nothing about personal, nothing about business, just nothing.  They jump right into everything without the pleasantries.\\n* Discovery - The top sales people are asking less than 5 questions in discovery and it certainly isn't SPIN or Challenger or Gap.  - No \\\"knock on effect\\\" questions or anything.   It's just a couple of basic \\\"are you qualified\\\" questions.  And I don't even mean around BANT or MEDDIC - literally just \\\"what's your credit score\\\" level qualifying question.\\n* Demonstration - The top sales people are doing, what can only be described as, feature dumping.  It's is just a quick rant on all the top features.  There is no tailored benefit statement, need payoff or anything.  It's literally just \\\"here is feature x and it does this.  Here is feature y and it does this\\\"\\n* Decision makers - Either they are there or they aren't and there is nothing the top sales people are doing to ask for them.  Sometimes they are booked in with the DM from marketing, sometimes the influencer brings them on a later call.  Sometimes they don't show up at all.  The top sales people aren't ever talking about them and just going in a straight line, repeating the same process each time.  There is a small difference in win rates when they are there vs when they aren't but not enough that we need to focus on it.\\n* Closing - The closest I've heard to asking for the business in the 100 calls was \\\"what are your thoughts\\\".  There is no actual request for the business.\\n* Objection handling - the deals that close, just don't seem to have them.  the customer is already basically sold so the questions are more around \\\"how does this work\\\" and not objections.  If there was an objection it would be met with something like \\\"yeah, I hear what you are saying and this may not be the best solution for that\\\".  There is brilliance in this answer to some degree.\\n* Follow up - No evidence of it.  The quote is sent to the customer and sometimes they email back and sometimes they don't.\\n\\nSo?  What did I see that made these sales?\\n\\n* Great leads from the get go.  These customers were perfect fits and were in market.  Either having been past customers, referrals or working with an inferior competitor that we could beat on product and price. Some were from marketing but most were prospected by the sales team.  The people relying on marketing were the bottom performers.\\n* Top sales people just took them through the process and showed them everything.  Bottom sales people RAN a process.  By that, I mean they asked very salesy questions like \\\"why is that important to you\\\" or \\\"what happens if you don't do x\\\" or \\\"is there anyone on your side that would feel left out if they didn't have input on this?\\\".  If a need payoff question was asked that deal was almost always moved to closed lost.  People hate these and it puts them in a defensive position.\\n* Tone.  Everything came down to tone.  It wasn't what people were doing, it was the people doing it.  It wasn't the questions that annoyed people, it was the way the sales person asked it.  Top sales people come off as nice, polite and enthusiastic.  Average or below sales people just didn't. The late night DJ voice may be great for hostages, but will a death sentence in SaaS.\\n* Price - top sales people always opened with a very very low price.  They didn't try to max out each deal, they just gave the best price they could.\\n* Top sales people treated every person like they were the decision maker.  They empowered them during the process and, if that person reached the end of their line, they would offer to care the deal to the next person, they never had to be asked to.\\n\\nSales is a WAY less complicated than we make it.\\n\\n* Get the best leads in your pipeline.  If you aren't given them, go prospect to them.\\n* Don't make it hard for people to buy.  Just show them what you have.\\n* Discovery is wildly overrated.  Not that it isn't important it's just that, unless you've mastered it, you're better off keeping it simple rather than trying to master it on the call with a customer in real time.  Save that shit for off the phones.\\n* How you sound is the biggest differentiator for sales success.  Some people have awesome voices some don't.  If you are outside sales then it's probably how you look more than sound.\\n\\nAnyway, that's my observation and I hope it helps people simplify the process down.\\n\\nTLDR; Gong might be full of shit.\"", "title": "My top level take aways after having listened to 100 sales call", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/sales/comments/13uvsrs/my_top_level_take_aways_after_having_listened_to/"}, {"author": "AnIdeaMan", "created_utc": 1708707202.0, "link_flair_template_id": "5d7b6946-0047-11e3-ab17-12313b0cf20e", "link_flair_text": "Sales Topic General Discussion", "num_comments": 52, "post_id": "1ay5d1q", "score": 727, "subreddit": "sales", "text": "\"So a few things I just want to get out of the way.\\n\\n* I work B2C\\n* This lead and I spent a lot of time talking, this was not a random cold call\\n* Been in sales a long time, have my share of dead family members stories like we all do\\n* This felt unique because I was confident that the lead himself told me he had died.\\n* I'm not going do anything to circumvent a leads attempts at blocking or ignoring my calls.\\n* This was a lead, not a client, I used the wrong term in my previous post\\n\\nSo the call\\n\\nI called, his wife answered. I told her I had heard her husband passed away.\\n\\nIt's true, he did pass away single car accident, on his way to work. She was distraught and it was a hard call.\\n\\nI told her I really enjoyed working with her husband, and thought he was a wonderful man. Offered my condolences.  I offered to send flowers to the funeral home. She accepted the offer. I sent flowers.\\n\\nI then asked her if she'd like me to DNC her so she doesn't get calls from us anymore. She declined and asked me to call back in a few weeks and go over what I talked to her husband about. I said I'll do that.\\n\\nI think the biggest take away I'm walking away is with the reminder that tomorrow isn't promised. Tell your loved ones you love them.\\n\\nAnd yea I guess his brother and my client sound identical\"", "title": "Called the lead (correct term) who said he had died (update)", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/sales/comments/1ay5d1q/called_the_lead_correct_term_who_said_he_had_died/"}, {"author": "itsanothersalesman", "created_utc": 1709174895.0, "link_flair_template_id": "5d7b6946-0047-11e3-ab17-12313b0cf20e", "link_flair_text": "Sales Topic General Discussion", "num_comments": 159, "post_id": "1b2phk7", "score": 717, "subreddit": "sales", "text": "\"Saw the earlier post about someone losing out on a $60k commission deal. I\\u2019m also about to lose a huge deal. Biggest of my career so far. Almost a year of intense work. Travel, dinners, workshops, etc. \\n\\nIt\\u2019s not final but 99% it\\u2019s not us. \\n\\nAnd I\\u2019ve learned some seriously invaluable lessons. \\n\\nThe biggest one being\\u2026it doesn\\u2019t matter how big of a champion you have, if they don\\u2019t have power it doesn\\u2019t mean shit. \\n\\nI focused way too much time on the \\u201cmanager\\u201d and \\u201cuser\\u201d of the software. Built an incredible relationship there. \\n\\nThey want us. \\n\\nThey\\u2019ve told the VP they want us. \\n\\nMy competition on the other hand immediately went high. Straight to the VP. And spent all their time there. \\n\\nNow don\\u2019t get me wrong. I\\u2019ve tried to build a relationship with the VP. \\n\\nBut I just didn\\u2019t focus on it earlier enough or hard enough. \\n\\nAnd now I\\u2019m about to take a huge c-suite exposure level L. \\n\\nSales is not for the weak. \"", "title": "About to lose the biggest deal of my career (so far). $100k commission. ", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/sales/comments/1b2phk7/about_to_lose_the_biggest_deal_of_my_career_so/"}, {"author": "Proudlymediocre", "created_utc": 1659033104.0, "link_flair_template_id": "bdab74fe-cd00-11e5-a1b1-0ee60891a65b", "link_flair_text": "Career", "num_comments": 165, "post_id": "wahg1n", "score": 714, "subreddit": "sales", "text": "\"I've been in corporate enterprise technical sales for over 20 years.\\n\\nMy first job was selling for a large tech organization (since acquired) that worked with something like 90% of the Fortune 500, and just about every other smaller company, too.\\n\\nI'll never forget my first mentor. He said, \\\"A lot of new sales people will find ways to stay in the office. They'll study the products, rehearse their presentation, meet with peers, engage marketing, try to learn everything they can. But all you need to do is pick up the phone, set up meetings with executives, and then get them to open up to you.\\\"\\n\\nSo that's what I did. And I couldn't believe how wonderful it was. And I remember becoming a top salesperson rather quickly while a few of my new peers did what my mentor warned me against, and got off to much slower starts than I. For the better part of the next 10 years, this trend continued, and I made a lot of money in commissions and was routinely the top rep regardless of where I worked.\\n\\nIt was about 2009 when I started to see a shift happening. My employer at the time started scheduling more internal calls to plan/talk, and started not just requesting but in fact dictating that we enter everything we did into CRM, and mandated our engaging marketing to roll out automated marketing campaigns. At first I blew it off as just noise, but then I started getting increased pressure from within. I remember the irony of that day in early 2010, when the very same day I received a signature on a new logo 3.9M contract that I found by cold calling and that put me over quota for the 4th straight year for that employer, that our COO sent me a public email saying \\\"Boo!\\\" because I was ranked dead last for number of automated emails sent out. I remember taking exception to that, pointing out that what did it matter if I was last in email marketing if I was by far and away the #1 rep overall? But within a few quarters they started attaching our comp plans to our engagement of their marketing automation tool. So I left.\\n\\nBut over the last 13 years, it has gotten worse, no matter where I go.\\n\\nI put together a powerpoint presentation a few weeks ago that was well received by a potential new client. They sponsored another presentation in front of their CFO, and seemed excited about my presentation. But minutes after the meeting ended, my Chief Revenue Officer called me -- \\\"Some of your slides didn't follow our branding,\\\" he said, not. unlike the TPX Cover Page in Office Space. So next time around I lost a couple of hours reformatting our slides to match our corporate-mandated template.\\n\\nToday in our sales meeting, my CRO announced our quarterly numbers were down for the second time in a row. But he made a point to send kudos to three of my peers who have pipelines spread out across all our product groups and have the most engagement in Outreach, our marketing automation platform. Are they at quota? No. Have any of their marketing emails resulted in new clients? No. But the fact they've sent a bazillion emails to prospects who by and large haven't responded is being praised as the standard we go after. Since a year ago, I've closed two new logos by way of cold calling and over 130% of my quota, but I feel like on a daily basis that I\\\"m about to be fired since all I hear is constructive criticism from management about my marketing and limited pipeline, etc..\\n\\nI change jobs a lot. Mostly because I'm a free agent (no equity) and I don't need to make a million dollars a year anymore, so I don't have to put up with the BS like when my family was young. So I'm pretty versed in a lot of company cultures. And it's nearly the same everywhere I go:\\n\\n* 25% of my time -- minimum -- is spent on internal zoom calls.\\n* Quantity (Marketing Automation Tools) is more important than Quality (well researched cold calls).\\n\\n&#x200B;\\n\\nEDIT SATURDAY 7/30/22 MORNING: \\n\\nThank you so much to everyone for your comments and awards. I truly appreciate it and am humbled by the reaction. I almost deleted this shortly after I posted it, and to be honest expected a lot of downvotes but it was how I felt so posted it anyway. Who knew that so many people feel the same as I do?... Anyway, I was busy with work after posting this, and have been slightly overwhelmed with all the comments plus DMs (I thought I'd disabled DMs long ago), so apologize for delays to responses but will get to these slowly over the weekend. Have a great weekend. \"", "title": "10 Years of Change: Being An Old Corporate Sales Person In The New World Of Corporate Sales...", "upvote_ratio": 0.99, "url": "https://www.reddit.com/r/sales/comments/wahg1n/10_years_of_change_being_an_old_corporate_sales/"}, {"author": "K666B", "created_utc": 1640358633.0, "link_flair_template_id": "71af4a56-ccf8-11e5-9ace-0e55464bea03", "link_flair_text": "Shit Post", "num_comments": 146, "post_id": "rno6an", "score": 702, "subreddit": "sales", "text": "\"Rise and grind sales boys let\\u2019s get this bread. I usually make 5000-10000 calls a day but as a gift to myself this year I\\u2019m dialing 20000 calls starting at 7pm Christmas Eve and not stopping until the sun goes down Christmas Day. \\n\\nB2B Enterprise SaaS in the FinMarTech space because nothing else is worth my time. \\n\\nTips to overcome objections, specifically on xmas eve/xmas morning? Plan is to pose as Santa and ask to speak with the prospects children, tell them I\\u2019ll give them whatever they want if they tell mommy and daddy to sign the contract. \\n\\nThoughts?\"", "title": "Tips for cold calling on Christmas Eve/Christmas Day?", "upvote_ratio": 0.88, "url": "https://www.reddit.com/r/sales/comments/rno6an/tips_for_cold_calling_on_christmas_evechristmas/"}, {"author": "squattersrights25", "created_utc": 1646239041.0, "link_flair_template_id": "5d7b6946-0047-11e3-ab17-12313b0cf20e", "link_flair_text": "Discussion", "num_comments": 102, "post_id": "t543t8", "score": 690, "subreddit": "sales", "text": "\"My company took a big chance on me with no experience in this sales space. I have been at the position for 5 months and this is my first deal.\\n\\nSo many days of wondering if all my activities were working are finally validated. The biggest thing is the proof to myself that IT CAN BE DONE!\\n\\nI\\u2019m so overjoyed right now but have no one to share it with. Only a couple of years ago I was working as an engineer making 60k, could make close to that over just this deal.  Hoping this will be the first of many!\\n\\nEdit: Wow, was not expecting to get this much attention on this. For those asking, I am still on a $75 k total bonus over my first 3 quarters guaranteed. I am anticipating a commission of $60-80k on top of the guarantee.\"", "title": "I just signed my first contract for $1.8 million and need to share it with someone!", "upvote_ratio": 0.99, "url": "https://www.reddit.com/r/sales/comments/t543t8/i_just_signed_my_first_contract_for_18_million/"}, {"author": "None", "created_utc": 1663694257.0, "link_flair_template_id": "257e55e4-0047-11e3-b199-12313b0eb082", "link_flair_text": "Advice", "num_comments": 86, "post_id": "xjeniq", "score": 692, "subreddit": "sales", "text": "\"Being afraid decreases blood flow to the part of your brain responsible for logical thinking and planning. \\n\\nThese people have absolutely no idea who you are and will most likely forget about you in 3 days. \\n\\nThese people are not laughing at you with their coworkers at happy hour.\\n\\nThese people are not going to go home and throw darts at a picture of you for calling them at 11:43am on a Tuesday.\\n\\nThese people simply do not care about you at all and if anything, they pity you.\\n\\nThese people don\\u2019t know what they want and you know what they need. \\n\\nThese people have no idea a phone call could result in their business being more successful. \\n\\nYou want to book more meetings and sell more? Pick up the phone and dial these people. I promise you they are not gonna hunt you down hunger games style. \\n\\n1-3% of cold calls lead to a meeting booked. Just imagine if you got good enough to make it 5-7%. \\n\\nYou\\u2019re leaving money on the table and limiting your sales skills by not calling. \\n\\nQuit being afraid. Pick up the phone. No one cares.\"", "title": "Whoever needs to hear this, you need to pick up the phone and don’t be afraid", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/sales/comments/xjeniq/whoever_needs_to_hear_this_you_need_to_pick_up/"}, {"author": "0T4CON", "created_utc": 1660154536.0, "link_flair_template_id": "5d7b6946-0047-11e3-ab17-12313b0cf20e", "link_flair_text": "Discussion", "num_comments": 175, "post_id": "wl4788", "score": 691, "subreddit": "sales", "text": "\"The fuck is wrong with some of these \\\"leaders\\\"? Could you imagine getting laid off and opening LI the next day and seeing your stupid CEO's \\\"crying\\\" face in a post about how painful it was for him? I'd be so pissed lmao\\n\\nIt's obviously for engagement, and it's hilarious how many ppl are clowning him, but that shit just doesn't sit right with me man\"", "title": "Anyone see that crying CEO post on LI?", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/sales/comments/wl4788/anyone_see_that_crying_ceo_post_on_li/"}, {"author": "C-rad06", "created_utc": 1591810761.0, "link_flair_template_id": "bdab74fe-cd00-11e5-a1b1-0ee60891a65b", "link_flair_text": "Career", "num_comments": 119, "post_id": "h0ftgz", "score": 689, "subreddit": "sales", "text": "\"Not really that much value to add but I closed a $750k deal last week which put me at 135% of annual quota and I\\u2019m half way through Q2. Pardon the humble flex.. I\\u2019ve always saw these type of posts and thought, not going to be me, but here I am! \\n\\nThis was a services deal that had a very tight timeline and was also a nightmare to get contracted. I definitely gained some grey hairs through it all. \\n\\nMy comp plan isn\\u2019t great so I won\\u2019t be making a killer commission (we pay out 2-3% on services), but it is great leverage for either a promotion or another higher paying role elsewhere.\\n\\nI\\u2019ve posted here occasionally and read through a ton of material which has helped me so far in my career, so thank you r/sales for the assistance!\"", "title": "Closed $750k deal, Blew up my quota", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/sales/comments/h0ftgz/closed_750k_deal_blew_up_my_quota/"}, {"author": "None", "created_utc": 1641177169.0, "link_flair_template_id": "bdab74fe-cd00-11e5-a1b1-0ee60891a65b", "link_flair_text": "Career", "num_comments": 262, "post_id": "ruqmu3", "score": 679, "subreddit": "sales", "text": "\"I\\u2019m 31. When I got out of college I didn\\u2019t know exactly what I wanted to do, so I figured, screw it, sales pays a lot so I\\u2019ll do that and find joy by spending money on things, retiring early and never stressing about money.\\n\\nNow I\\u2019m married, no kids and no plans to, have one paid off house and another house, have a $200k+ OTE and can retire within 7-10 years. \\n\\nI cannot stand the \\u201crah rah hell yeah go sales\\u201d mentality. I don\\u2019t even like getting shout-outs. I\\u2019m just a relatively smart guy who figured out early that a top tier engineer or scientist makes like $80-140k while a top tier salesperson makes $200k+. So, I work hard to figure out my products, vibe with customers, treat them nicely while giving them the info they need to make a decision to buy or not buy. \\n\\nIs it bad that I don\\u2019t particularly have any passion for sales and I just do it because I\\u2019m good at it and so I can retire early with my wife and chill from like age 40-45 til death? Is anyone else in this boat?\"", "title": "I am in sales almost entirely for the money. Am I alone in this? Is it bad?", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/sales/comments/ruqmu3/i_am_in_sales_almost_entirely_for_the_money_am_i/"}, {"author": "R00ster_Cogburn", "created_utc": 1650675815.0, "link_flair_template_id": "bdab74fe-cd00-11e5-a1b1-0ee60891a65b", "link_flair_text": "Career", "num_comments": 194, "post_id": "u9tl2a", "score": 667, "subreddit": "sales", "text": "\"I just landed a remote role with 100k base, 30k ramp, 200k OTE, and am absolutely stunned.\\nI honestly had doubts I would ever get to this level, just because I've had my ups and downs throughout my career (who hasn't though?).\\n\\nI can't thank this sub enough. I've literally taken countless screenshots of comments, saved threads, and reached out to dozens of you guys in DMs over the past couple of years. The knowledge here is invaluable, and while I know I earned it, being a part of this sub has absolutely influenced my path.\\n\\nNone of you know me, but believe me when I say I'm just a regular guy with no degree, who had kids very young, and have been fighting my way up for the past 10+ years.\\n\\nI just wanted to celebrate a bit, thank you guys, and let anyone who may be on the fence or thinking it can't happen for them - it absolutely can.\"", "title": "Cannot Believe It", "upvote_ratio": 0.99, "url": "https://www.reddit.com/r/sales/comments/u9tl2a/cannot_believe_it/"}, {"author": "BelgiansAreWeirdAF", "created_utc": 1664545375.0, "link_flair_template_id": "5d7b6946-0047-11e3-ab17-12313b0cf20e", "link_flair_text": "Discussion", "num_comments": 130, "post_id": "xs1pm6", "score": 663, "subreddit": "sales", "text": "\"Pretty please.\\n\\nEdit: well, it\\u2019s closing time here, and Sarah continues to be a little tease. No PO. Q3 is in the bag folks. I was going to take a celebratory victory lap to the bar for some drinks, but looks like I\\u2019m just going to have to take the walk of shame to the bar to have some drinks.\"", "title": "How to I politely tell someone if they don’t give me this fucking deal today I’m going to end the month with a goose egg, but if they do get it today, I will double my quota, so you need to stop fucking with me Sarah before I come to your office and start Will Smithing your whole purchasing team?", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/sales/comments/xs1pm6/how_to_i_politely_tell_someone_if_they_dont_give/"}, {"author": "thesonofnarcs", "created_utc": 1603198490.0, "link_flair_template_id": "257e55e4-0047-11e3-b199-12313b0eb082", "link_flair_text": "Advice", "num_comments": 98, "post_id": "jeowgz", "score": 650, "subreddit": "sales", "text": "\"I\\u2019ve been following this sub for years and have learned so much.\\n\\nSo today I thought I\\u2019d share some of my lessons, adventures, and experiences.\\n\\nI\\u2019m a joint venture broker. It\\u2019s a pure sales role. I don\\u2019t work for any one company. Instead, I go into companies and broker joint ventures/strategic alliances for them. \\n\\nI figure out other companies selling non-competitive products to the same target audience as the company I\\u2019m working with. \\n\\nI get paid a percentage of every dollar that comes from a deal I broker.\\n\\nFor example, this past winter I brokered deals for 1-800-Flowers. I approached them cold with the idea of a joint venture for Valentine\\u2019s Day with restaurants where they would supply sit down restaurants gift certificates to gift to guests at the end of their meal. \\n\\nIt costs the restaurants nothing and they would get a percent of every transaction where the gift certificate was redeemed.\\n\\nThey said yes to the idea but wanted to do it for Mother\\u2019s Day. Within 6 weeks I had all the major sit down restaurant companies on board. These were billion dollar companies with thousands of locations.\\n\\nUnfortunately this deal was called off due to Covid. But, Here\\u2019s what I did to get them on board for this JV:\\n\\n1) FedEx Letters: In January and February of this year people were still working in offices. I found the names of the executives on LinkedIn.\\n\\nI sent them a one page pitch and sent in a FedEx envelope. \\n\\nThis worked very consistently. Within 2 to 3 days like clockwork I\\u2019d get a response. \\n\\n2). Funny/Outrageous gifts: If I couldn\\u2019t get an executives attention with a FedEx letter I\\u2019d find a funny item on Amazon to send them. I\\u2019d send it as a gift and include a one or two sentence pitch in the gift note. \\n\\nI sent the head of Outback Steakhouse a 6 foot long, plush Crocodile (to fit in with Outback\\u2019s theme) through Amazon prime. I immediately got a callback.\\n\\n3). Food: It\\u2019s something I usually avoid, but in this case it worked because 1-800-Flower\\u2019s owns Shari\\u2019s Berries. I was trying to reach one of the marketing execs of Darden in February so I had a box of chocolate covered strawberries delivered to the office.\\n\\nIt was a risk (I wasn\\u2019t sure how it would be perceived so close to Valentine\\u2019s Day), but it paid off. She shared them with her team and I was able to land a meeting within 24 hours.\\n\\nI\\u2019m now brokering deals for a pet sitting platform with companies in the travel industry. The goal is for airlines, hotels, and booking sites to send out an offer for a free night of pet sitting after a booking. \\n\\nI first started with cold email. But it\\u2019s what I did after that worked the best. \\n\\nSince I could track who opened my initial email and how many times they opened it, I sent funny dog related items through Prime. \\n\\nThe CEO of a major airline opened my email 30 times so I sent him a 35 pound bag of dog food through Amazon Prime. It cost me $21. Within 4 days I had a call scheduled with their CMO. \\n\\nThe head of partnerships at Airbnb opened my email over 25 times so I sent her a dog house and then a 5 foot tall plush dog through Prime. A week later I had a call with their head of business development.\\n\\nIn two months I\\u2019ve had calls with 13 of the 15 biggest companies in the travel space and have deals in the works with two of them. \\n\\nThe lesson I\\u2019ve learned is that it pays to be outrageous. No one else is doing it.\"", "title": "I sent an Airline CEO a bag of dog food and a restaurant executive a 6 foot plush crocodile: Here’s what I learned pitching executives at billion dollar companies", "upvote_ratio": 0.99, "url": "https://www.reddit.com/r/sales/comments/jeowgz/i_sent_an_airline_ceo_a_bag_of_dog_food_and_a/"}, {"author": "Consistent-Jury9849", "created_utc": 1680050345.0, "link_flair_template_id": "5d7b6946-0047-11e3-ab17-12313b0cf20e", "link_flair_text": "Sales Topic General Discussion", "num_comments": 105, "post_id": "1257we2", "score": 641, "subreddit": "sales", "text": "\"I got the job. The one where the Ops manager chuckled through the phone call when he scheduled my first interview.\\n\\nOps manager told me he didn\\u2019t take me seriously until he met me in person. After that, he immediately called my (now)boss and told him he had to meet me.  \\nTwo days later, I drove two hours away to meet regional sales and ops managers and interview with them. Two weeks later, they sent me an offer. \\nI literally snatched the job out of the hands of a previous employee that everyone knew and loved.\\n\\nI am, once again, the first an only woman to work at this branch. \\n\\nYesterday was my first day and I crushed it! Every single person I met was so cool and so supportive.\\nToday I drove my first ever work truck home. \\n\\n6 years ago I was waiting tables with no degree. Today I have an amazing new career with a great company, great pay, and great benefits. \\nI clawed my way up. I made it. \\nI feel like such a bad bitch right now. \\n\\nThank you for your support during this process and thank you for reading my story\"", "title": "I did it", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/sales/comments/1257we2/i_did_it/"}, {"author": "MVPhillips", "created_utc": 1512122987.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 164, "post_id": "7gu4ar", "score": 640, "subreddit": "sales", "text": "\"Hi all! Hope you're crushing it going into December; I know it's a tough time of year. I created a post on how I cold call, and I'd love to hear your tips and tricks too. I understand some may disagree with my methodology, and that's okay. Let's keep it civilised.\\n\\n#This Cold Calling Script Booked Me Meetings With The Biggest Law Firms in Adelaide#\\n\\nCold calling is a unique weapon in the salesperson\\u2019s arsenal. I send emails, texts, Linked In messages, and heck, even hand-written letters, but nothing compares to picking up the phone and making the call. It\\u2019s like bringing a bazooka to a knife fight. Here\\u2019s my take on a perfect B2B cold calling script which you might find helpful too.\\n\\nAlternative types of communication are all one-way. Through mediums such as emails, texts, social messages and letters, it doesn\\u2019t require the other person to \\u201cbuy-in\\u201d to the communication. Consider that for a moment.\\n\\nThose contact efforts are easy for the prospect to put-off, save for later, ignore and forget. They definitely serve a purpose, and I believe a great salesperson uses all forms of communication available, but nothing will replace a phone call.\\n\\nPhone calls are a personal, two-way, real-time interaction. I\\u2019ve achieved more in a single call than weeks of touches via other channels. Honestly, while prospects seem \\u201cannoyed\\u201d at cold callers, they also can appreciate the effort of a human wanting to get in contact with them, especially after multiple attempts.\\n\\nBut there is a right way and a wrong way to execute a cold call, and it can be confronting for both the salesman and the prospect. Immediately, people raise their defences when they receive an unsolicited call, so we need to disarm them and instil trust.\\n\\nI\\u2019ll explain the theories behind each section of my call so you can tailor it to your industry and company.\\n\\nI\\u2019ve conducted a lot of research on how to perfect cold calling, because it\\u2019s arguably the most important call in your relationship with a prospect. It\\u2019s the \\u201cfirst date\\u201d of the business world, so you\\u2019d best impress!\\n\\n**The Cold Calling Open/Introduction**\\n\\n*Hi John, this is Michael from XYZ, have I caught you at a bad time?*\\n\\nLet\\u2019s break this down.\\n\\n+ Introduce yourself in a happy tone. Keep it short, succinct and polite. Speak confidently \\u2013 like you would talk to a friend.\\n\\n+ Address the prospect by their first name, to infer you\\u2019re of equal status. While saying \\u201cMr.\\u201d or \\u201cMrs.\\u201d can be a sign of respect, it also communicates that the prospect is more important than you. You\\u2019re calling with a solution to help them and your time is also of great importance; don\\u2019t put the prospect on a pedestal.\\n\\n+ I stopped saying \\u201cMy name is Michael\\u2026\\u201d and started announcing \\u201cThis is Michael\\u2026\\u201d I found this yields more positive responses, perhaps because it conveys a sense of authority. It also cuts the total number of words down.\\n\\n+ I also experienced better results using my first name and the company, but not my last name. I want to remove any unnecessary words, and simplify my message as much as possible for the prospect. Not to mention, when talking to a friend, you\\u2019re on a first name basis.\\n\\n+ I hate it when sales people ask me: \\u201cHow are you?\\u201d I know they don\\u2019t care, and it\\u2019s honestly a waste of time asking. They\\u2019re interrupting my day, they\\u2019re a stranger to me AND they\\u2019re asking me a shallow question? Save that for people you\\u2019re acquainted with. Instead, I\\u2019d prefer to be asked \\u201cHave I caught you at a bad time?\\u201d for four reasons, so I tend to do the same:\\n\\n1) It\\u2019s courteous and shows I respect the prospect\\u2019s time.\\n\\n2) A question encourages the prospect to \\u201cbuy-in\\u201d to the conversation; it takes two to tango.\\n\\n3) When someone receives an unsolicited phone call, their immediate reaction in their mind is negative and hence no, no, no. By asking if I\\u2019ve caught them at a bad time, the answer \\u201cno\\u201d is actually the positive answer. This isn\\u2019t a Jedi mind trick, but it often buys you a bit more time to get your point across.\\n\\n4) Even if I have caught them at a really bad time, the prospect often says \\u201cYes, but can you call back in an hour?\\u201d\\n\\n**The Reason**\\n\\n*The reason I\\u2019m calling is because we\\u2019re helping the big law firms in Adelaide with their property valuation needs, and I thought you might be interested too.* **Then stop talking and wait.**\\n\\n+ The aim of stating the intention of my call cuts to the chase and \\u201csets a hook\\u201d in the prospect. I want to create enough interest so they want to learn more. But you don\\u2019t have to hit the prospect with facts and figures; you just have to arouse curiosity. Remember, people buy from people. Be real and authentic.\\n\\n+ The way you deliver this is crucial. You must be articulate, but excited; clear but upbeat.\\n\\n+ I realise this pitch on paper doesn\\u2019t sound exactly exciting, but the reason it works for me is because (most) lawyers are open to learning about how we can benefit them and their clients.\\n\\n+ I tried different variations such as: \\u201cThe reason I\\u2019m calling is because we help save lawyers time and money with property valuations\\u2026\\u201d but the response I got was that it was \\u201ctoo salesy,\\u201d and they became more hostile over the phone.\\n\\n+ \\u201c\\u2026we\\u2019re helping the big law firms in Adelaide\\u2026\\u201d is social proof that we\\u2019re helping companies LIKE them, and we\\u2019re local. This cements a trust in the prospect that we can actually provide some value to them.\\n\\n+ \\u201c\\u2026and I thought you might be interested too.\\u201d Who could be angry at that? I disarm the prospect but letting them know I\\u2019m not selling anything at this stage; all I\\u2019ve done is explain we\\u2019ve helped others like them and now I\\u2019m thinking we MIGHT be able to help them too. This provides a great avenue for more questions regardless if their response is \\u201cyes\\u201d or \\u201cno.\\u201d\\n\\n+ Then stop talking and wait for a response. In many instances, the prospect has already started talking, but if not, use the silence to create an atmosphere where the prospect HAS to say something. Often the prospect is interested and wants to hear how we can help, but on the odd occasion some they say they\\u2019re not interested.\\n\\n**Qualify**\\n\\nThe aim here is to \\u201cinvestigate\\u201d by asking questions. While my hypothesis is that we can help them, I want to make sure they\\u2019re a good fit for us. There\\u2019s nothing worse than a bad customer, or wasting time with someone that the product/service isn\\u2019t going to suit.\\n\\nUsing a date as a scenario, imagine if you just talked the whole time about how good you are. Personally, that would be an awkward situation. The typical salesperson (myself included) is a type-A, extroverted personality who enjoys conversing, talking and having a laugh. Our job is to ask questions, and then shut up, listen, and absorb what they tell us.\\n\\n**If they say they\\u2019re interested**\\n\\n*Great. If I could ask you real-quick, how many family law clients do you have at the moment?*\\n\\n*On average, what percentage of those would need their property valued?*\\n\\n*Who do you typically use for property valuations?*\\n\\n*What\\u2019s your experience been like with those firms?*\\n\\n*Sounds like we might be a good fit for you. Lawyers find us useful because we service a bigger area across the state, and we also value all types of property. So we\\u2019re able to save you time because we\\u2019re more of a one-stop-shop.*\\n\\n**If they say they\\u2019re not interested**\\n\\n*Oh, that\\u2019s okay, I understand. If I could ask you real-quick, is it a timing issue or something else?*\\n\\nIf it\\u2019s a timing issue, organise a time then and there of when they\\u2019ll be able to give their full attention, and lock them into a meeting via email calendar. If it\\u2019s something else, you should have your objection/complaint responses ready. Then, depending on how that goes, you can re-direct to the questions from the \\u201cinterested\\u201d category.\\n\\n**Closing on a Meeting**\\n\\n*I\\u2019d love to meet with you and learn more about what you do, are you free sometime next week? Preferably Monday morning or Tuesday afternoon if that suits you?*\\n\\n+ Emotional words like \\u201clove\\u201d create impact and show how interested you are, just to learn more about them. The sales process is all about the prospect and getting them to the \\u201cpromise land\\u201d with your solution.\\n\\n+ Narrow down their options to make it psychologically easier for them, but also leave it open to working around them if need be. That\\u2019s polite.\\n\\n**A better way to make sales scripts**\\n\\nWhile scripts can boost your sales, conversations aren\\u2019t linear. It can be difficult to work off of scripts on paper, because when you ask the prospect questions, the responses can vary. This is why I created SalesWolf.io, so no matter what direction the conversation takes, I can maintain control and work toward the goal.\\n\\n**Conclusion**\\n\\nTo be a cold calling master, you need to be enthusiastic and deliberate in the words you speak, while engaging the prospect in a two-way communication. Being short, sharp and shiny is effective; don\\u2019t beat around the bush. Keep the goal of the call in mind and never forget: people do business with people!\\n\\n**TL;DR - simplicity, deliberate, short, sharp, shiny, script, questions, listen, close meeting and be an empathetic person**\"", "title": "How I perfected my cold calling, and it might help you too", "upvote_ratio": 0.99, "url": "https://www.reddit.com/r/sales/comments/7gu4ar/how_i_perfected_my_cold_calling_and_it_might_help/"}, {"author": "Usopp_Spell", "created_utc": 1666096651.0, "link_flair_template_id": "bdab74fe-cd00-11e5-a1b1-0ee60891a65b", "link_flair_text": "Career", "num_comments": 134, "post_id": "y75xa1", "score": 629, "subreddit": "sales", "text": "\"Was laid off from DocuSign in the 9% workforce  reduction at the end of September, and I was just offered (yesterday actually but posting today) a business development executive at Gartner! Closing role, I'm pumped!\\n\\nThe interview process was insanely difficult but I'm very proud of myself for persevering.\\n\\nJust wanted to share with everyone else!\"", "title": "I GOT THE JOB!!!", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/sales/comments/y75xa1/i_got_the_job/"}, {"author": "None", "created_utc": 1642512357.0, "link_flair_template_id": "257e55e4-0047-11e3-b199-12313b0eb082", "link_flair_text": "Advice", "num_comments": 216, "post_id": "s6xhhm", "score": 630, "subreddit": "sales", "text": "\"I see a ton of posts here that read along the lines of \\u201cI\\u2019ve applied for 100 tech sales jobs and not gotten one interview! Where\\u2019s this hot market everyone\\u2019s talking about?\\u201d \\n\\nThere\\u2019s a lot to consider here before you blame the market:\\n\\nWhat does your resume look like? \\nIs your LinkedIn optimized? \\nAre you only hitting easy apply on LinkedIn? \\nWhat else are you doing to highlight you application? \\n\\nTrying to find a sales job while only applying to job ads is like only selling when someone puts out an RFP\\n\\nYou need to be more proactive. \\n\\nThis one tactic has gotten me interviews with most the companies I\\u2019ve applied for throughout my career:\\n\\nApply for the role\\nGo on LinkedIn and find the hiring manager (Sales Manager, SDR manager, Direct of sales, VP sales) \\nConnect with that person and include a video in the request (use Vidyard, it\\u2019s free) \\nIn the video say something along the lines of \\u201cHey John, saw you *personalization* + personalized question? I\\u2019m reaching out to highlight my application for your open \\u201cSDR role\\u201d. Your team/company looks fantastic to work for because *more personalization*. I\\u2019d be a fit for the role because *insert strengths*. Let me know if I can shed any light on my past experience. Cheers!\\u201d \\n\\nDoing this will automatically put you in the top 2% of applicants, show that you can research an org, and prove you\\u2019re a go getter. \\n\\nSales is not the career for entitlement, victims, excuses, or reactiveness.\\n\\nDo the work.\"", "title": "Victims have no place in sales", "upvote_ratio": 0.86, "url": "https://www.reddit.com/r/sales/comments/s6xhhm/victims_have_no_place_in_sales/"}, {"author": "OwwNowwBrowwnCoww", "created_utc": 1663626259.0, "link_flair_template_id": "5d7b6946-0047-11e3-ab17-12313b0cf20e", "link_flair_text": "Discussion", "num_comments": 258, "post_id": "xiqrcx", "score": 623, "subreddit": "sales", "text": "\"A year ago, I came out a 6 yr career hiatus and a startup took a chance on me as their only SDR. Truth be told, I went into the interview thinking it was for a different company. \\n\\nToday, my OTEs 160k as an AE. I work 25-30 hrs most weeks. Most Engineers at my company went to a school like MIT, have 5-10 yrs experience and make about the same working 50-60 hrs. I barely floated through a mediocre business school. Now as a top performer, other AEs who have way more sales experience come to me for advice.\\n\\nSome days I feel I don\\u2019t deserve this. But honestly, that just gives me motivation to keep earning what I might or might not deserve. Makes me think how I can continue to work smarter and not just harder.\\n\\nComing off a whopping $18k income in 2020, I feel like I\\u2019ve hacked life. Now retirement seems possible by 45-50. \\n\\nAnybody else feel sales has also helped them hack life?\"", "title": "Anybody else feel like they’ve hacked life by being in sales?", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/sales/comments/xiqrcx/anybody_else_feel_like_theyve_hacked_life_by/"}, {"author": "grizlena", "created_utc": 1671543161.0, "link_flair_template_id": "71af4a56-ccf8-11e5-9ace-0e55464bea03", "link_flair_text": "Shitpost", "num_comments": 128, "post_id": "zqomw3", "score": 617, "subreddit": "sales", "text": "\"\\u2022 wake up \\n\\n\\u2022 check LinkedIn \\n\\n\\u2022 read the first two influencer posts that appear on your feed \\n\\n\\u2022 start your day immediately furious and ready to fight the world. \\n\\nThank you.\"", "title": "Wanted to share how I cut caffeine and 2x’ed my quota.", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/sales/comments/zqomw3/wanted_to_share_how_i_cut_caffeine_and_2xed_my/"}, {"author": "TrueHalfCrack", "created_utc": 1659121990.0, "link_flair_template_id": "5d7b6946-0047-11e3-ab17-12313b0cf20e", "link_flair_text": "Discussion", "num_comments": 102, "post_id": "wbd5r9", "score": 608, "subreddit": "sales", "text": "\"It's ok. You can do it, Mr. Vice President of Important Stuff at Big Company. I know, from personal experience, that all you have to do is THREE FUCKING CLICKS and it's signed. It's done. I can go golfing, you can move on to whatever it is that non-sales people do. \\n\\nI know you're annoyed that I've asked a few times over the last month to make sure the order will be signed today. It's my god damned job. My family's livelihood depends on you clicking the stupid button and signing the order. All my other clients have signed THEIR orders, what makes you think you're special? Why did you have to wait til the last day to do this?\\n\\nJUST SIGN IT. IT'S RIGHT THERE. OPEN THE ENVELOPE, CLICK THE BUTTONS, AND VIOLA! IT'S ALL DONE. JUST SIGN IT. SIGN IT. DO IT. AHHHHHH.\\n\\nI need a new goddamn career.\\n\\nEdit: he signed it. I love this job I\\u2019m never leaving.\"", "title": "Just. Sign. The. Damned. Sales. Order.", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/sales/comments/wbd5r9/just_sign_the_damned_sales_order/"}, {"author": "HoytG", "created_utc": 1580131881.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 113, "post_id": "eunxf5", "score": 608, "subreddit": "sales", "text": "\"It was a very difficult telemarketing sales job. Selling franchising. Our boss was a cutthroat sales guy. Very brutal but very very good at sales. \\n\\nHis name was Larry. He was a very soft man who wasn\\u2019t exactly cut out for sales, but had a passion for the industry in which we sold. \\n\\nHe was not successful and on the brink of losing his job. Hanging on through pure luck. \\n\\nI quit that job. The money was great but I didn\\u2019t believe in the product and it was killing me inside. \\n\\nLarry had a heart. And I know it ate at him as well. I quit in a whim with $2k in my bank account a couple months ago. And I figured it out and turned out okay. Definitely much happier, albeit definitely a lot poorer. \\n\\nPlease quit your job before you quit your life. Sales is high pressure. If you can\\u2019t handle it, don\\u2019t try to be a superhero and push through for your family. You can\\u2019t provide for them if you\\u2019re dead. \\n\\nTake care of yourselves and be honest to your coworkers if it\\u2019s not working. \\n\\nWhat fucks me up the most is remembering how joyous he spoke of taking his daughter to school every morning before coming to the office. \\n\\nRest In Peace my friend.\"", "title": "My old coworker killed himself last night. Please quit your job if it’s killing you inside.", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/sales/comments/eunxf5/my_old_coworker_killed_himself_last_night_please/"}, {"author": "supraman1120", "created_utc": 1569677098.0, "link_flair_template_id": "bdab74fe-cd00-11e5-a1b1-0ee60891a65b", "link_flair_text": "Career", "num_comments": 119, "post_id": "dafxvv", "score": 601, "subreddit": "sales", "text": "\"Wife and family are tired of hearing me talk about percentages and quarters, so wanted to brag here a bit.\\n\\nEnterprise SaaS sales in the data and analytics space.Market leader organization.\\n\\nJust wrapped Q3 at 600% of my quarterly quota, and blew my yearly quota away in Q3 alone. Closed over a million in new revenue. Made 100k alone in the last 24 hours on 2 deals that closed. Bringing in 200k in commission this quarter, just over 300k YTD... Feels good man.\"", "title": "Just wrapped a personal and company record quarter... 600% of quota - 200k in quarterly commission.", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/sales/comments/dafxvv/just_wrapped_a_personal_and_company_record/"}, {"author": "SeventhMind7", "created_utc": 1702933229.0, "link_flair_template_id": "5d7b6946-0047-11e3-ab17-12313b0cf20e", "link_flair_text": "Sales Topic General Discussion", "num_comments": 151, "post_id": "18ljfat", "score": 594, "subreddit": "sales", "text": "\"Just barely scraped into the 6 figure club. Sad thing is the company I'm working for seems kind of like a car on fire with no driver at the wheel. While I don't expect to be here this time next year 100k does feel like a milestone!\"", "title": "I made 6 figures this year!", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/sales/comments/18ljfat/i_made_6_figures_this_year/"}, {"author": "None", "created_utc": 1621004238.0, "link_flair_template_id": "5d7b6946-0047-11e3-ab17-12313b0cf20e", "link_flair_text": "Discussion", "num_comments": 211, "post_id": "ncakov", "score": 594, "subreddit": "sales", "text": "\"Not sure if there are any Cardone fans left on this sub, but if you're still faithful to your prophet I highly recommend you watch Discovery channel's show Undercover Billionaire, where he makes a bet that he can make $1 million in 90 days without his name.\\n\\nDuring this show, Grant violates all his principles, spending most of his time lazing around the house and bitching at the camera crew. There are some days he doesn't do any work at all. Despite being a self-proclaimed master of sales, Grant *doesn't get a single client from cold calling*. His real estate deal falls apart too - without his name, he isn't able to recruit a single investor into a scheme to renovate an apartment. He is completely cringeworthy to watch on screen - without a scripted, staged environment like the one in all his fake \\\"cold call\\\" videos, it's very clear his sales technique doesn't work.\\n\\nPosting this as someone who followed Cardone back in college. Even though years in software sales has revealed to me that almost everything he preaches is ineffective, I still believed that he was individually a good salesman and a hardworking person. He isn't either.\\n\\nPlease consider this before you buy any GC products.\"", "title": "Grant Cardone discredits himself on Undercover Billionaire", "upvote_ratio": 0.99, "url": "https://www.reddit.com/r/sales/comments/ncakov/grant_cardone_discredits_himself_on_undercover/"}, {"author": "Marysman780", "created_utc": 1659573623.0, "link_flair_template_id": "5d7b6946-0047-11e3-ab17-12313b0cf20e", "link_flair_text": "Discussion", "num_comments": 157, "post_id": "wfn2bd", "score": 593, "subreddit": "sales", "text": "\"HVAC sales here.  I\\u2019m on pace to sell 1.5 million this year, then I get a call this afternoon from a customer who wants to set up a micro-grid of cogeneration units.  \\n\\nCustomer represents a local Reserve and I\\u2019ve sold them back up generators, furnaces and AC units.  All without meeting him face to face!  The office jokes that he\\u2019s a ghost as all our meetings seem to fall through but he sends people in with cheques. \\n\\nThe project will heat and power 250+ on Reserve homes, while providing electricity that they will sell back to the grid.  \\n\\nMy company has done similar projects but not as large and not sold by me.\\n\\n\\nUPDATE\\n\\nNO SIGNATURE.  They are more interested than before tho. They want to piecemeal this into the next several years.  I will meet with them in a few weeks to see the first potential install site.  Then I will meet with their entire council next month and close!\"", "title": "Wish me luck, tomorrow I pitch $10,000,000.", "upvote_ratio": 0.99, "url": "https://www.reddit.com/r/sales/comments/wfn2bd/wish_me_luck_tomorrow_i_pitch_10000000/"}, {"author": "ToasterBathh007", "created_utc": 1687916614.0, "link_flair_template_id": "5d7b6946-0047-11e3-ab17-12313b0cf20e", "link_flair_text": "Sales Topic General Discussion", "num_comments": 255, "post_id": "14kw5x3", "score": 588, "subreddit": "sales", "text": "\"Everything in the world is for sale and you know how to sell it. So why do all the sales ppl need a pity party when they get axed?  \\n\\nYou can literally sell any fucking thing in the world. \\n\\nWhat is there to cry about? You should be happy at all the opportunities you get to explore now while unemployed, on e.I, sitting on the couch jerking off, playing videos game, and smoking pot! \\n\\nEnjoy your time off homie! \\n\\nWhen I got fired I took it on the chin and kept moving. I spammed LinkedIn resumes and now I have my dream job. \\n\\nYou get paid to deal with rejection , this is what youre built for. Layoff shouldn\\u2019t even make a real salesman blink. I was laughing at the HR person who fired me. \\n\\nYou flush me down the toilet and I\\u2019m coming back up with a plumping license ready to sell you pipes. \\n\\nTLDR: stop looking at glass half empty princess\\n\\n\\n\\n***I wrote this in Jordan Belfort's voice, it was meant to be funny and not serious but shout out to 76% of you who understood the positive underlining message and shared your insightful supportive comments! \\n\\nThat lighthearted attitude will take you far in life :)\"", "title": "You’re in Sales who cares if you got laid off bro….", "upvote_ratio": 0.79, "url": "https://www.reddit.com/r/sales/comments/14kw5x3/youre_in_sales_who_cares_if_you_got_laid_off_bro/"}, {"author": "j4390jamie", "created_utc": 1582545916.0, "link_flair_template_id": "c9fc1b2a-f336-11eb-aa47-8a6995011801", "link_flair_text": "Best of r/Sales", "num_comments": 89, "post_id": "f8q9r9", "score": 585, "subreddit": "sales", "text": "\"So you want to be a slick, silver-tongued, money-making salesperson?\\n\\nWell, this is the guide for you, giving you all the information you need, terminologies, book recommendations and tips to impress even the coldest manager.\\n\\n&nbsp;\\n\\n\\nMaybe you have always been destined to get into the life of sales, or maybe this is a brand new yellow brick road you have just stumbled upon. This guide is going to go through the absolute basics and then get into more and more niche topics; if you want to read fast, skip the stuff you know, otherwise grab a notepad and get your plan in order.\\n\\n&nbsp;\\n\\n**Understanding the concept of sales**\\n****\\n\\nBefore we even think about getting into tips on how to get a job, let&#39;s get a pure basic understanding in place, go read the following books:\\n\\n  - [How to win friends and influence people](https://www.amazon.co.uk/How-Win-Friends-Influence-People/dp/0091906814/ref=sr_1_1?crid=11ZYLHHOAVSTP&keywords=how+to+win+friends+and+influence+people&qid=1582153753&sprefix=how+to+win+friend%2Caps%2C266&sr=8-1)\\n  - [Rich dad, poor dad](https://www.amazon.co.uk/Rich-Dad-Poor-Teach-Middle/dp/1612680194/ref=sr_1_1?keywords=Rich+dad%2C+poor+dad.&qid=1582153771&sr=8-1)\\n  - [4-hour workweek](https://www.amazon.co.uk/4-Hour-Work-Week-Escape-Anywhere/dp/0091929113/ref=sr_1_5?keywords=4-hour+workweek&qid=1582153785&sr=8-5)\\n\\n\\nThese books probably won&#39;t teach you much that you don&#39;t already know, but they will tell you what you already know in a new way. You need to understand that sales is about connecting with people; that is the number 1 most important thing. Everything else is strategy and techniques. But even if you know every technique, if you&#39;re a dick to be around, well\\u2026 you probably won&#39;t make it far in sales.\\n\\n&nbsp;\\n\\n**Choosing the industry**\\n****\\nSo you want to be in sales? selling what exactly?\\n\\n&nbsp;\\n\\nIf you can&#39;t install an app on your phone, maybe tech sales isn&#39;t for you. But that doesn&#39;t mean your dreams of being the #1 salesman are dead\\u2026 this could be the beginning of something better for you.\\n\\n&nbsp;\\n\\nListed below are the most common industries, and what I know about them:\\n\\n&nbsp;\\n\\n| **Industry** | Description |\\n| --- | --- |\\n| **Tech** | You sell consulting or software to companies. These could be small hair salons and vape stores or giant operations that use your software as the backbone of their business. You probably need to work in a city/tech hub. |\\n| **Med** | You sell hardware/pharmaceuticals to hospitals/surgeries/local practices. You might manage a list of accounts or you might be hustling hospital to hospital like Will Smith in *The Pursuit of Happiness*. |\\n| **Finance/Insurance** | You sell financial packages to different operations and individuals. Might mean cold-calling an account list, or could be consultative. |\\n| **Hardware/Construction** | Schools, houses, roads and cities need materials to be built. You work with different groups selling equipment, services or supplies. |\\n| **Cars** | You sell rocket ships\\u2026.. It&#39;s car sales\\u2026 you sell, cars. |\\n| **Door to Door** | Knock, knock? - Who&#39;s there? - Give me your money for this solar panel. |\\n\\n&nbsp;\\n\\nSo if you&#39;re looking for advice on 5 out of the 6 of the above, then you just ran out of luck, buddy. I don&#39;t know anything about those industries, so figure it out yourself.\\n\\nTech buddies, however, let&#39;s make some money!\\n\\n&nbsp;\\n\\n**Terminology. What the hell do these words mean?**\\n****\\n\\n&nbsp;\\n\\nSDR, AE, MM, SMB, PROSPECTING, ACV, OPS - What the hell gibberish are you talking about?\\n\\n&nbsp;\\n\\nWe have all been there, a million different abbreviations and references to things nobody has probably ever spoken about before. So let&#39;s break down all the common terms you will come across in the near future. Make sure to drop these buzzwords in your future interviews to really sound like you know what you&#39;re talking about.\\n\\n&nbsp;\\n\\nPay will vary based on location - These are averages based on first hand experience. There will also be outliers.\\n\\n&nbsp;\\n\\nJobs in the USA may vary from the below figures. Typically 30% higher pay, but will vary depending on location.\\n\\n&nbsp;\\n\\n| **JOB TITLE** | **PAY RANGE (Salary)** | **PAY RANGE (OTE)** | **DESCRIPTION** |\\n| --- | --- | --- | --- |\\n| SDR:   Sales Development Representative (sometimes called Business Development Manager) | \\u00a325,000 - \\u00a340,000 | \\u00a350,000 - \\u00a380,000 | Dialling and smiling. Your job will be to get in touch with people at different companies, with the goal of piquing their interest enough that you schedule a meeting with them. Done via email, Linkedin, calls or conferences. This meeting is either ran by yourself or an AE and is used to learn more about a company before showing them a demo. You will typically get paid if they show up to a demo. |\\n| SMB AE: Small Medium Business Account Executive | \\u00a330,000 - \\u00a360,000 | \\u00a350,000 - \\u00a3140,000 | Dance, monkey, dance. Your job will be to put on a show and present (demo) to an individual/team at a company with the goal of convincing them to buy your software. This involves showing them a demo, organising follow-up meetings and going through the process to get a decision-maker (DM) to sign a contract with your company. You will typically get paid when they sign. |\\n| MM AE: Mid-Market Account Executive | \\u00a340,000 - \\u00a375,000 | \\u00a360,000 - \\u00a3150,000 | Fancy suit monkey. Your job will be the same as an SMB AE but will involve more steps, with bigger companies. Have you ever gone through the terms and conditions of an agreement before? if not, get used to it. |\\n| ENT AE: Enterprise Account Executive | \\u00a350,000 - \\u00a3100,00 | \\u00a370,000 - \\u00a3250,000 | Fancy suit monkey with top hat and monocle. I see you have been putting on some good demos and somehow lucked out on some big deals. Well now it&#39;s the big leagues. You live by the sword or die by the sword. The length of the interaction and complexity to get a DM to sign a contract has now rapidly increased. Get on a plane, fancy suit monkey, and go dance. |\\n| SALES MANAGER | \\u00a360,000 - \\u00a3120,000 | \\u00a380,000 - \\u00a3200,000 | Smart monkey or dumb monkey? Your job will be to guide your team to victory. To make sure they are motivated, understand their mistakes and are using the best tips and advice to get deals in. You&#39;re likely going to a meeting, but are supporting your team and helping manage internal politics and resources. You get paid based on your team's accumulative sales. |\\n| MD: Managing Director | \\u00a3100,000+ | \\u00a3100,000+ | Very smart monkey or super dumb monkey? Your job is to manage a team of managers and individuals, and to make sure your managers are leading and not bullying their teams. You are helping on big deals and making sure that important clients get what they need so that you can make those dollar dollar bills yo. |\\n| HEAD OF SALES | \\u00a3100,000+ | \\u00a3100,000+ | Very smart monkey or lying monkey? Your job is to manage the managers and work with other heads of the organisation. You are the captain of the ship, the life of the crew is in your hands. |\\n\\n&nbsp;\\n\\n&nbsp;\\n\\n\\n| Terminology | Description |\\n| --- | --- |\\n| Cold call | When you call someone who is not expecting your call. Typically done in an attempt to book a meeting. |\\n| Lead | This is the classification within your database for individuals/companies that you are trying to get in contact with/manage a relationship with.  Typically this will be used when &#39;marketing assign a 'lead'&#39;, meaning a individual who has engaged in marketing activities (i.e. clicked a email), in which they now believe there is a higher chance of that person being interested in buying your goods/services. |\\n| Account | This is the terminology used to refer to a company/group that you are trying to get in contact with/manage a relationship with. |\\n| Contact | This is the terminology used to refer to an individual who is  listed under an &#39;account&#39;. I.e. Susan is my contact at ABC company; she is Head of E-commerce. |\\n| Example of a lead, a contact and an account. | Susan at ABC company visits the website of the company you work for. She enters her email address in order to download a webinar. This information is passed onto your marketing team, who gives the information to an SDR and asks the SDR to email/call Susan to try book a meeting. Susan responds saying that she isn&#39;t interested, however, her colleague Tom from Marketing would be a better person to speak with. Susan is now changed from a lead, into a contact.  An account is created for ABC company and an additional contact is created with Tom&#39;s details. This allows you to enter notes for the company and write down what has happened, so that you and your organisation can manage lots of relationships with different organisations at once. |\\n| Disco: discovery call | A discovery call is a meeting with a client, typically booked by an SDR. The goal of this initial meeting is to give the client a basic understanding of what your company can do for them, but also to gain information about the client (i.e. what issues they are experiencing/what they are looking to do to further develop their business), so that you can tailor what you show the client if they decide they want to see a demo next. |\\n| Demo call | A demo is a meeting, typically done either via a screen sharing tool (Google Hangouts, Zoom, Skype) or in-person, where a client is shown a presentation deck or a live demonstration of the software/service they would be getting from your company in exchange for money. |\\n| CRM | Customer Relationship Management. Examples are Salesforce, Hubspot or even a spreadsheet with names and phone numbers. |\\n| OP: Opportunity | An 'op' is created when a demo is marked as qualified, meaning the AE would like to continue speaking with this company and will, therefore, allow the SDR/other departments to get credit for the work they have done. |\\n| Agreement/contract | An agreement between two companies that lays out the products/services offered in exchange for money, along with terms and conditions. |\\n| Legal | Legal department |\\n| SMB | Small- and medium-sized businesses. Companies generating under a set revenue. Could be 5 million, could be 30 million; this depends on what your company sets out. |\\n| Mid Market | Mid-market companies are bigger than startups, but smaller than corporations. Could be a bunch of very smart people growing rapidly, or an old, dumb company slowly dying. Just because they are big, doesn&#39;t mean they have money. Typically over 35 million GBP revenue. Varies, however. Usually much slower at making a decision, but bigger deals. |\\n| Enterprise | Larger, more formal companies, usually a lot more hoops to jump through and people involved. |\\n| Call to action | Something you or the person you are speaking to will need to do. Such as meeting for a coffee or scheduling a follow-up meeting. |\\n| OTE | On Target Earnings, this is how much you will make before taxes when your Salary and Commission is combined. If you don't hit your target, you won't make this much, if you exceed your target, it will be higher. Typically it be 2x Salary. i.e. 40,000 Salary and 40,000 Comission if you hit your target. |\\n\\n&nbsp;\\n\\nNow that you know your terminologies, you&#39;re practically already a millionaire. Throw these around during the interview process and very shortly you will be in your first role.\\n\\n\\n&nbsp;\\n\\n**Books**\\n****\\n\\nSo you want some books to read \\u2026 Are you actually going to read them? Get the audible version and listen to each of them, then also get a physical copy and read it. If you have to read just one, read the SDR book by WBD. It&#39;s a boring read, but it will help you.\\n\\n1. [Challenger Sale](https://www.amazon.co.uk/Challenger-Sale-Control-Customer-Conversation/dp/0670922854/ref=sr_1_1?keywords=challenger+sale&qid=1582150633&sr=8-1)\\n2. [Spin Selling](https://www.amazon.co.uk/SPIN%C2%AE-Selling-Neil-Rackham/dp/0566076896/ref=sr_1_1?keywords=spin+selling&qid=1582150651&sr=8-1)\\n3. [Winning By Design(WBD) - SDR Book](https://www.amazon.co.uk/SaaS-Sales-Method-Development-Representatives/dp/1986270653/ref=sr_1_4?keywords=winning+by+design&qid=1582150681&sr=8-4)\\n4. [WBD - Sales fundamentals](https://www.amazon.co.uk/SaaS-Sales-Method-Fundamentals-Conversations/dp/1986270203/ref=sr_1_3?qid=1582150733&refinements=p_27%3AJacco+Van+Der+Kooij&s=books&sr=1-3&text=Jacco+Van+Der+Kooij)\\n5. [WBD - For Account Executives](https://www.amazon.co.uk/SaaS-Sales-Method-Account-Executives/dp/1986270920/ref=sr_1_7?keywords=winning+by+design&qid=1582150681&sr=8-7)\\n6. [Fanatical Prospecting](https://www.amazon.co.uk/Fanatical-Prospecting-Conversations-Leveraging-Telephone/dp/1119144752/ref=sr_1_1?keywords=prospecting&qid=1582150708&sr=8-1)\\n7. [Predictable Prospecting](https://www.amazon.co.uk/Predictable-Prospecting-Radically-Increase-Pipeline/dp/1259835642/ref=sr_1_2?keywords=prospecting&qid=1582150708&sr=8-2)\\n\\n&nbsp;\\n\\n**Finding a job**\\n****\\n\\nNote:\\n\\nIf you have made it this far and you&#39;re interested in a job and can work in either New York or London, PM me, I might be able to help. Be persistent; this is sales after all. I might not respond immediately; keep bothering me. If you&#39;re good, I will do my best to help, if you suck, that&#39;s on you, buddy.\\n\\n&nbsp;\\n\\n\\nYour first job in sales will typically start as an SDR. You don&#39;t need a degree to get the role, but for certain companies, you won&#39;t get an interview because of it. The first step you need to do is create a CV:\\n\\n&nbsp;\\n\\n**The CV**\\n****\\n[CV Example](https://docs.google.com/document/u/1/d/e/2PACX-1vSmwZUCVIWeWZSGlsZINlcFV61_1G9d890GMB8xXaLxh53NvNTH2qCXhMYrrKGBytbiws_lPxNN_hHt/pub)\\n\\n\\n\\n\\nThis is my CV from when I first applied for a role in sales. I got interviews. This is not your CV, so don&#39;t copy it, but use it as inspiration.\\n\\n&nbsp;\\n\\nTip - Write the CV for the job. Exaggerate the hell out of it, so long as you can back up what you say. You&#39;re about to be a salesperson; if you can&#39;t exaggerate the truth a little bit for your own interests, then you are probably in the wrong profession.\\n\\n&nbsp;\\n\\nYour manager will know that you&#39;re exaggerating, but that doesn&#39;t matter. How confidently you say it does. So long as you don&#39;t suck as an SDR, whatever you say is fair game. Don&#39;t lie, but tell the story of the best version of yourself.\\n\\n&nbsp;\\n\\n\\n**Recruiters**\\n****\\n\\nOne of the very first things you should be doing is trying to find recruiters looking for SDRs. They can easily be found on Linkedin. Send them a connection and then ask if they are open to new candidates and send them your CV and the role you&#39;re looking for. You will also come across them as you apply to jobs directly, talk and meet with as many of them as possible.\\n\\n&nbsp;\\n\\nNow, before you get any further: there&#39;s something you need to know about recruiters. They are two-faced ass kissers who will screw you over without a second thought. Joking. Kinda...\\n\\n&nbsp;\\n\\nRecruiters are salespeople too. They have targets to hit of their own by filling roles with candidates. If you are not a good candidate they are not going to want to work with you.\\n\\nSo how can  you be a good candidate? Easy:\\n\\n- ALWAYS show up IN TIME (=15 minutes before, minimum)\\n- Get a new haircut, beard trim/shave\\n- Buy a fitting suit (under \\u00a3200 will do)\\n- Get a pair of nice shoes (under \\u00a3100 is fine)\\n- Bring a notepad and several pens (put 5 of them in the pen holder in your backpack) to your interview\\n- Bring several copies of your CV (inside a leather pouch holder) to your interview\\n- Bring a copy of the job description to your interview\\n- Always answer your phone\\n- Prepare for interviews (seriously, 2 hours prep)\\n- Practice what you are going to say\\n- Tell your recruiter how your interview went immediately after and keep them in every email communication (cc or bcc)\\n- Do what recruiters tell you to do (with exceptions to below)\\n\\n&nbsp;\\n\\nNow\\u2026 you don&#39;t have to be a doormat. The above are the minimum requirements to become across prepared and give you a leg up on like 90% of other candidates. Seriously, the BASICS are more important than pretty much anything else. Nobody is expecting you to be a good salesperson, but they are expecting you to understand that you need to be open to learning.\\n\\n&nbsp;\\n\\nThe key to dealing with recruiters is to set your boundaries from day 1 , but to also to be reasonable. If this is your first role, don&#39;t expect to get the perfect job in your ideal niche/industry. Be open to suggestions made by your recruiter. At the same time, if you give them a hand and they will take an arm. If they think you will accept any role, they will send you to any role, including the crap ones.\\n\\n&nbsp;\\n\\nShow up on time and communicate often and clearly with your recruiter. You don&#39;t need to share your minute by minute updates. Just show up to meetings/interviews on time and well prepared, and as soon as the meeting is over call/email the recruiter letting them know how the interview went.\\n\\n&nbsp;\\n\\nRecruiters make money from getting you a job. They are partially on your team, but you are not paying them, so don&#39;t expect too much.\\n\\n\\n&nbsp;\\n\\n**Direct outreach**\\n****\\n\\nDidn&#39;t you say you wanted to be a silver-tongued salesperson? Would a smooth-talking, slick back salesperson wait for sales to come to him? Or does he go out and find what he wants and takes it?\\n\\nYou said you wanted to be in sales, so start selling yourself. Look up companies that you find interesting and call up the sales managers/offices of these companies and tell them why they need to hire you. Book your own interview.\\n\\n&nbsp;\\n\\n**Preparing for the interview**\\n****\\n\\nLots of people say you need to prepare for the interview, but they don&#39;t tell you what to prepare.\\n\\nThis is my [cheat-sheet](https://docs.google.com/document/d/e/2PACX-1vST9IALruYa7Q0-K2FZVFO8fqo0wvp6pOcXKusu-mnRyybv4-EJxfrAJHH_tBiGcwUtBLBP6fczkMMk/pub) for every interview I did. Nobody does this stuff, it's a bit crazy and takes up a lot of time, however, you always want to set yourself apart and this is how to do it.\\n\\n&nbsp;\\n\\nYou should be filling this out every time you are going to an interview. You should make one for every person you are going to meet and take them with you to the interview room. Seriously, open up your leather document holder, one side containing the many copies of your CV (give one to everyone you meet - if they don't have their own copy already), the other side holding a cheat-sheet on every single person you're meeting. Let them spot it; they will be impressed! 70% of sales is the presentation. Nothing catches a salesperson's attention like seeing a piece of paper with their own face on it. Prep for your interviews, but most importantly, let them know you prepared.\\n\\n&nbsp;\\n\\n**The Interview**\\n****\\nGet a smart outfit/suit together, stand tall, shake hands firmly and have a positive attitude.\\n\\nThe goal is to get THEM to talk. Ask them why they are looking for an SDR, what they think would make the perfect one, then write it down and read it back to them. Next show them why you are the solution to their problem.\\n\\n&nbsp;\\n\\n**Post Interview**\\n****\\nAdd they persons who interviewed you on LinkedIn and write them a 'summary email'. Working in sales, we do this for every client we meet. Show that you are doing this yourself already.\\n\\n\\n\\n[Example of a Post interview email and Linkedin message.](https://docs.google.com/document/d/e/2PACX-1vReoHT4y2kxRmAR7cFCS8pfyCAhs6YGyFLU0gDvpNT0rRZLID7khTbNfj_y4wpwtZOMZkFR2Td4g5tn/pub)\\n\\n&nbsp;\\n\\nThere are a ton of spelling and grammar mistakes, so better not copy and paste, but rewrite this in your own words! Seriously\\u2026 Do you want the job? Rewrite the damn thing.\\n\\n&nbsp;\\n\\nMake sure you include a 'call to action'(CTA), a coffee, a phone call, anything, but don&#39;t wait to be called back, be proactive.\\n\\n\\n&nbsp;\\n\\n**Follow-Ups:**\\n****\\n* Do you think salespeople make 1 demo and then sell the product?\\n* Do you think SDR&#39;s make one phone call and then book a demo?\\n* Follow-up is 90% of the job.\\n* Make the effort to follow-up with the interviewer.\\n* If they don&#39;t answer you 2 days prior to the CTA dates you have suggested. Confirm it with them.\\n* No answer 1 day prior?  - Phone call them!\\n\\n&nbsp;\\n\\nWhat are they going to do?, say hey, stop calling me I&#39;m not ready?\\n\\n&quot;Exactly, and if you were a decision-maker at a company I was outreaching I would continue to get in touch. I&#39;m sorry for the persistence, but I think it&#39;s very important to practice what you preach and I&#39;m afraid if that means calling you once a week to keep onto of this sales cycle, then, unfortunately, I&#39;m going to continue. I hope you understand and would want your team to do the same.&quot;\\n\\n&nbsp;\\n\\nAny sales manager that doesn&#39;t understand that and is angry that you are chasing him, is a sales manager you don&#39;t want to work for.\\n\\n\\n&nbsp;\\n\\n**You got the job!**\\n****\\n\\nWasn&#39;t even difficult was it Mr Beast?\\n\\nYou killed the recruitment process, nailed the interview, ain&#39;t nobody stopping you.\\n\\nMonday you start and now it&#39;s time to make a killing\\u2026. Oh yeah.. Wait.. How do we do that exactly?\\n\\n&nbsp;\\n\\n\\n**How to be an SDR**\\n*****\\n\\nPART 2\\u2026 If you&#39;re interested in learning more, let me know. Maybe I&#39;ll write something. Maybe not?\\n\\n&nbsp;\\n\\nSo if you&#39;re looking for advice on 5 out of the 6 of the above, then you just ran out of luck buddy. I don&#39;t know anything about those industries, so figure it out yourself.\\n\\nTech buddies, however, let&#39;s make some money!\\n\\n&nbsp;\"", "title": "SDR GUIDE - How to become a slick, silver-tongued, money-making SDR.", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/sales/comments/f8q9r9/sdr_guide_how_to_become_a_slick_silvertongued/"}, {"author": "JakeyBoy4168", "created_utc": 1708971380.0, "link_flair_template_id": "bdab74fe-cd00-11e5-a1b1-0ee60891a65b", "link_flair_text": "Sales Careers", "num_comments": 217, "post_id": "1b0ofub", "score": 582, "subreddit": "sales", "text": "\"I saw it coming and, to be honest, I deserved it. My numbers had decreased the past three months in a row and were below company standards, just time to cut ties. My new full-time job for the time being is driving for DoorDash - at least I\\u2019ve got that to fall back on to get me by in the meantime. \\n\\nJust wanted to get it off my chest. Not sure how I\\u2019m going to go home and tell my wife later. Thankful to this sub for being a sounding board during my short sales career.\\n\\nEdit: Thank you all so much for the kind words and the offers to help out. Industry is digital advertising for those asking\"", "title": "I got fired today", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/sales/comments/1b0ofub/i_got_fired_today/"}, {"author": "BroStoic", "created_utc": 1665693338.0, "link_flair_template_id": "71af4a56-ccf8-11e5-9ace-0e55464bea03", "link_flair_text": "Off-Topic", "num_comments": 102, "post_id": "y39ayq", "score": 577, "subreddit": "sales", "text": "\"10 year sales veteran and recently moved into a new and undeveloped territory. Largest order was $2.2mil.  Smallest was $8k. Had several large deals fall through during the year, really out of my control. I was second guessing everything in my life. 3 months ago my boss called me in for a Friday meeting so I pretty much assumed I had a 50% chance of getting fired. I told my self that under no circumstance would I sign any type of PIP.  You even mention a PIP to me, I\\u2019m walking. Luckily my boss knows what\\u2019s up, gave me a pep talk, and we ended up smashing it.  Feels great man.\"", "title": "I had $0 in sales for 11 months. Just closed $3.4mil in 3 days with 6 deals.", "upvote_ratio": 0.99, "url": "https://www.reddit.com/r/sales/comments/y39ayq/i_had_0_in_sales_for_11_months_just_closed_34mil/"}, {"author": "Forkmealready", "created_utc": 1682086660.0, "link_flair_template_id": "5d7b6946-0047-11e3-ab17-12313b0cf20e", "link_flair_text": "Sales Topic General Discussion", "num_comments": 197, "post_id": "12u36du", "score": 578, "subreddit": "sales", "text": "\"It\\u2019s been a looong month. 12-15 hour days 6 days a week. Crawling under fucking houses and working every Saturday. Only seeing my kids a few days. \\n\\nBut I\\u2019ll make around 35k this month before I get fucked by taxes. I can\\u2019t tell this to my friends so I wanted to share with someone! \\n\\nI have only ever had sales jobs and feel like I\\u2019m finally close to an expert. Shout out to this sub for helping keep me grounded\"", "title": "Just had my best month with a week left. 30k+ commissions for April!", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/sales/comments/12u36du/just_had_my_best_month_with_a_week_left_30k/"}, {"author": "None", "created_utc": 1594220138.0, "link_flair_template_id": "257e55e4-0047-11e3-b199-12313b0eb082", "link_flair_text": "Advice", "num_comments": 50, "post_id": "hnihin", "score": 574, "subreddit": "sales", "text": "\"This is super complicated. You ready for it?\\n\\n\\u201cWhat made you decide to agree to this meeting?\\u201d\\n\\nThat\\u2019s it. Don\\u2019t make it harder than it needs to be. Get the Bobby wish wash out of your pipeline, get the pain points right out the gate, find out the reason from the start.\\n\\nEasy. Had a woman give me 2 minutes worth of feedback on her problems she\\u2019s having, crushed my presentation.\"", "title": "Game changer question to ask when you have a meeting", "upvote_ratio": 0.99, "url": "https://www.reddit.com/r/sales/comments/hnihin/game_changer_question_to_ask_when_you_have_a/"}, {"author": "MyWay_FIWay", "created_utc": 1671502464.0, "link_flair_template_id": "257e55e4-0047-11e3-b199-12313b0eb082", "link_flair_text": "Advice", "num_comments": 107, "post_id": "zqbaey", "score": 574, "subreddit": "sales", "text": "\"Hi everyone-\\n\\nI absolutely love the content on this sub and wanted to contribute some tips for young sellers just getting started. \\n\\nI\\u2019m feeling particularly grateful- I\\u2019m coming off my third year of breaking company records- with the last two being in new logo sales. I\\u2019m planning on accepting an offer from an outside company here in a couple weeks for more money than I could have ever imagined making just a few short years ago. Sales is an incredible career and I\\u2019m so glad I found it. I want everyone in the profession to know how to be really good at it. \\n\\nHere are my top 10 practical tips for enterprise solution sellers that have greatly helped me in my career. If you keep these 10 in mind, I think they will greatly help most sellers. I\\u2019m always willing to chat more or answer any questions you may have. Just dm me. \\n\\n1. Many in management are in management because they can not sell.\\n\\n2. Your buyers make a purchasing decision. You never ever make a sale.\\n\\n3. Just because you can bulldoze buyers doesn\\u2019t mean you should. Overcoming objections and \\u201cnot taking no for an answer\\u201d will occasionally work. If you choose to work this way though, you\\u2019ll never be anything more than a run rate seller.\\n\\n4. Three way validation: Validate what your management is telling you to do, with what you see your companies top performers doing, and with what you read from top sales thought leaders.\\n\\n5. Detach and function as a consultant when talking to a customer. Your goal is to discover if your product solution honestly makes sense for your buyer. Cheerleader salespeople freak buyers out. If you can successfully detach from your bias, you\\u2019ll function as a partner/trusted advisor and not someone to be suspicious of/argued with.\\n\\n6. The buyer(s) you are working with have a family and career as well. Don\\u2019t ever take advantage/mislead a buyer.\\n\\n7. Don\\u2019t try to reinvent the wheel- replicate what is working well until the market is exhausted. Who are your best customers? Who in the market looks the most like them? What product in your basket seems to work best? If you had to make a basket to win a sweepstakes, would you shoot a layup or a full court shot? \\n\\n8. Not everybody likes you. If you can- team sell. A deal is much more likely to close if you\\u2019ve mobilized a group of people on both sides so that you have multiple POC\\u2019s and potential advocates.\\n\\n9. Be honest with yourself and get those dead deals out of your pipeline. They are maybe making your pipeline reviews easier but they are seriously hampering your chances of being a top performer. \\n\\n10. You can only control what you can control. Your self worth is not tied into making quota.\"", "title": "Accepting an offer Wednesday for 400K OTE- paying it forward by posting my top 10 tips for sellers who want to achieve outsized results.", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/sales/comments/zqbaey/accepting_an_offer_wednesday_for_400k_ote_paying/"}, {"author": "cbpa07", "created_utc": 1636730662.0, "link_flair_template_id": "5d7b6946-0047-11e3-ab17-12313b0cf20e", "link_flair_text": "Discussion", "num_comments": 195, "post_id": "qsdin0", "score": 574, "subreddit": "sales", "text": "\"Has anyone else noticed that LinkedIn is garbage now in terms of its original purpose? \\n\\nNowadays people treat it like Facebook, posting photos of personal news like a new baby in the family or wedding announcements. I miss the days where the platform was just for expanding your network and connecting with people for business. Not to mention the algorithm sucks now with nonstop notifications related to peoples likes and so forth. \\n\\nJust here ranting about how shitty this platform became, thanks for coming to my Ted Talk.\\n\\nEdit: 0 clue how this blew up so much, agree with both sides that platforms change and you should be able to be personal. All things considered, personal life should have a line to what is over sharing. Thanks for the feedback!\"", "title": "Anyone think LinkedIn is trash nowadays?", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/sales/comments/qsdin0/anyone_think_linkedin_is_trash_nowadays/"}, {"author": "AnIdeaMan", "created_utc": 1708629523.0, "link_flair_template_id": "5d7b6946-0047-11e3-ab17-12313b0cf20e", "link_flair_text": "Sales Topic General Discussion", "num_comments": 354, "post_id": "1axez4y", "score": 569, "subreddit": "sales", "text": "\"So this is a new one.\\n\\nI'm sure we've all had the family death pop up when working with a client. I'm sure many of those deaths are real death, but we all know many are made up excuses to back out.\\n\\nWell I just called a client, 99% sure it was the client that answered. He claims to be the client's brother but his voice was identical to my client.\\n\\nHe said his brother died in a car crash and to not call again.\\n\\nI'm like 99.9% it was my client saying he died and he was straight up lying about his own death.\\n\\nI decided at that point if hes lying about him being dead as I'm talking to him then he's not going buy, so it doesn't matter If he's really dead or not. If I call him out it that could back fire.\\n\\nSo I said \\\"omg I'm so sorry for your loss, I wish you and your family all the best\\\"\\n\\nAnd I deaded the lead\\n\\nI also googled my clients name, no obituary I'm going try again in a few weeks(I mean check for obituary)\\n\\n**edit**\\n\\n* This was a scheduled call back, not a random call. Last spoke to this client last week.\\n* by try again in a few weeks I mean search for his obituary. Obviously this client isn't buying from me.\\n* This was a warm lead, felt pretty good about closing it too\\n\\nHowever a user here gave me a great idea. I'm going call again on Friday and express my condolences and offer to send flowers to the funeral home.\\n\\nHowever this lead isn't going buy\"", "title": "My client says he's dead...I don't believe him", "upvote_ratio": 0.92, "url": "https://www.reddit.com/r/sales/comments/1axez4y/my_client_says_hes_deadi_dont_believe_him/"}, {"author": "chewymammoth", "created_utc": 1666888069.0, "link_flair_template_id": "5d7b6946-0047-11e3-ab17-12313b0cf20e", "link_flair_text": "Discussion", "num_comments": 291, "post_id": "yewded", "score": 558, "subreddit": "sales", "text": "\"I've got two:\\n\\n1) A prospect's budget is often inversely proportional to their neediness. The lower their budget is, the more time they'll want to spend asking you questions about your product. (Also a correlation to a higher rate of emailing you a laundry list of question that have answers readily available on Google, your website, etc.)\\n\\n2) The chance of a prospect no-showing your meeting is directly correlated to how early of a meeting time they ask for. It's always the ones who insist that 8am is the best time for them that ghost you.\"", "title": "What are some \"laws of sales\" you've found to be true from personal experience?", "upvote_ratio": 0.99, "url": "https://www.reddit.com/r/sales/comments/yewded/what_are_some_laws_of_sales_youve_found_to_be/"}, {"author": "dochoiday", "created_utc": 1680892375.0, "link_flair_template_id": "5d7b6946-0047-11e3-ab17-12313b0cf20e", "link_flair_text": "Sales Topic General Discussion", "num_comments": 238, "post_id": "12euoo4", "score": 558, "subreddit": "sales", "text": "\"It\\u2019s Reddit, no one knows who we are. We can be honest. I only make 290k as the second best performer. See, honesty!\"", "title": "How is everyone on this sub a top performing SDR, making 300k, on a PIP and looking for a side hustle.", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/sales/comments/12euoo4/how_is_everyone_on_this_sub_a_top_performing_sdr/"}, {"author": "GabiCule", "created_utc": 1638031251.0, "link_flair_template_id": "bdab74fe-cd00-11e5-a1b1-0ee60891a65b", "link_flair_text": "Career", "num_comments": 144, "post_id": "r3h9nu", "score": 558, "subreddit": "sales", "text": "\"That\\u2019s what my dad told me when I told him I wanted to pursue a tech sales career after I graduate next month. \\n\\nFor years I had my sights set on law school, as that I thought that was the only way for me to earn a high income since I sucked at STEM. But after burnout from LSAT prep, and realizing I never really had a passion for the law, I told my parents I had second thoughts, which they refused to entertain. \\n\\nAt the beginning of this year a recruiter messaged me encouraging me to apply for a remote tech sales internship over the summer. I ended up getting the internship and began to do more research about the possibilities of tech sales. I joined this sub, and several slack groups in order to make connections and learn more about the industry. \\n\\nAs you can imagine, my parents were skeptical. My mother exclaimed that she didn\\u2019t spend nearly 100k for me to become a salesperson. When I told my dad about people only a few years older than me making six figures, he told me to keep dreaming. So I kept dreaming, but more importantly, I kept pushing.\\n\\nAfter I completed my internship and started my final semester of college, I got to work. I attended career fairs, revamped my resume, and did a bunch of mock interviews. I made sure to stress my internship, as wells as my e-board positions on campus, and how they allowed my to hone my commutation skills. And this week it all paid off.\\n\\nThis time a year ago I had no idea about tech sales. But two days ago, I, a goddamn sociology major, accepted an 80K OTE SDR gig. I would like to thank this sub for teaching me so much. It\\u2019s only up from here\"", "title": "“How many black girls do you see at those tech companies?”", "upvote_ratio": 0.94, "url": "https://www.reddit.com/r/sales/comments/r3h9nu/how_many_black_girls_do_you_see_at_those_tech/"}, {"author": "4kirezumi", "created_utc": 1660862221.0, "link_flair_template_id": "bdab74fe-cd00-11e5-a1b1-0ee60891a65b", "link_flair_text": "Career", "num_comments": 277, "post_id": "wrx1u6", "score": 549, "subreddit": "sales", "text": "\"Original post [here](https://www.reddit.com/r/sales/comments/wms2os/i_accidentally_ran_disco_with_a_vip_persona_im_a/).\\n\\nManager put 30 minutes on my calendar this afternoon.\\n\\nI came in, he introduced our VP of HR. \\\"After your actions last week, I've determined my disciplinary action for you. You're being fired, effective immediately.\\\"\\n\\nI've never been fired before. I booked 2 meetings yesterday. I exceeded quota last quarter. I was in shock (still am) so I just said \\\"Okay.\\\" One of the guys from IT collected my computer and phone, and watched me take me things with me on my way out.\\n\\nSo, there you have it. I was fired because I was supposed to just set meetings, and I ran a qualification-turned-discovery call that converted to a demo.\\n\\nAnyone hiring? I don't want to leave sales, I loved being a BDR.\"", "title": "UPDATE, I got fired: I accidentally ran disco with a VIP persona (I'm a BDR) and I'm worried about my relationship with my manager now", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/sales/comments/wrx1u6/update_i_got_fired_i_accidentally_ran_disco_with/"}, {"author": "BabyInMyBlender", "created_utc": 1656442087.0, "link_flair_template_id": "5d7b6946-0047-11e3-ab17-12313b0cf20e", "link_flair_text": "Discussion", "num_comments": 194, "post_id": "vmumzl", "score": 550, "subreddit": "sales", "text": "\"Just saw this posting on LinkedIn: https://imgur.com/a/xkHRZKp\\n\\nSo many things wrong with this. I cannot believe this dude thought this shit was inspiring. Granted, I'm sure this isn't true, BUT, why the fuck would you even post it? What made you think any of this was inspiring? You fired your best rep? After missing quota once? Are you a dumb fuck? So many people are worried about getting laid off and going into a recession and you post this bull shit boss worship post right now? You're a terrible manager and I feel terrible for the rep in this post if he is real. \\n\\nFuckin sales man, I love the grind but god damnit do I hate the viciousness of the game.\"", "title": "Just saw the most infuriating post on LinkedIn and I need to vent to you all. Who the fuck posts shit like this on LinkedIn?", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/sales/comments/vmumzl/just_saw_the_most_infuriating_post_on_linkedin/"}, {"author": "stimulants_and_yoga", "created_utc": 1661179213.0, "link_flair_template_id": "bfe6e398-0043-11e3-8435-12313b08b1a2", "link_flair_text": "Question", "num_comments": 411, "post_id": "wuvfb3", "score": 551, "subreddit": "sales", "text": "\"I\\u2019m just completely over it. I used to be so \\u201chungry\\u201d and now I\\u2019m catching myself doing the bare minimum, and I genuinely don\\u2019t care if I get fired. \\n\\nI think the largest factor is that I\\u2019m not getting paid until equipment ships and we\\u2019ve been on a year+ lead-time, so the carrot is essentially gone. \\n\\nI don\\u2019t have an ounce of ambition left in me, and it sucks because I have \\u201cgolden handcuffs\\u201d to this job because I have over $50k in commissions waiting for me. \\n\\nIs anyone else feeling the same?\"", "title": "Is anyone else “quiet quitting” or just completely burnt out?", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/sales/comments/wuvfb3/is_anyone_else_quiet_quitting_or_just_completely/"}, {"author": "Educational-Seat-819", "created_utc": 1675016931.0, "link_flair_template_id": "5d7b6946-0047-11e3-ab17-12313b0cf20e", "link_flair_text": "Discussion", "num_comments": 56, "post_id": "10oemrv", "score": 542, "subreddit": "sales", "text": "\"I just wanted to celebrate because it feels really, really good.\\n\\nIn the interview process, I told them that i was hungry - I told them that if I was paid to carry bricks from one side of the street to the other, I would carry bricks until I was no longer physically able to do so - not when I thought I\\u2019d made enough money.\\n\\nI\\u2019ve demonstrated that to be true. The CFO has reached out over slack to congratulate me and ask what i\\u2019m doing different than everyone else. My feedback is being taken into consideration. The outbound strategies are starting to shift to mirror the verbiage and strategies I\\u2019ve been using. \\n\\nMy win % is higher than every other AE, my avg deal size is higher, and my # sales is higher, too. I\\u2019ll make somewhere between 15-18k in comission this month depending on how I finish the month, and a few months ago I was worried I would need to move back home with my parents because NO ONE was willing to give me a chance.\\n\\nI guess for anyone reading this who is second guessing them self, the lesson i\\u2019ve taken away from this is that the only thing that matters is that you continue to push forward. I had exactly 1 month left before i would no longer be able to afford rent and food - and I\\u2019m glad I persisted because I didn\\u2019t get a yes until the 75th or so try.\\n\\nAnyways, I hope you\\u2019re all having an amazing January. Keep on pushing guys\"", "title": "A few months ago, I was rejected from over 70 different companies that I applied to. After interviewing for more than 30 of them, I was given an opportunity at a SaaS org which I LOVE. In January, my second month here, I have currently brought in more MRR than all 3 other AE’s COMBINED.", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/sales/comments/10oemrv/a_few_months_ago_i_was_rejected_from_over_70/"}, {"author": "None", "created_utc": 1685287821.0, "link_flair_template_id": "5d7b6946-0047-11e3-ab17-12313b0cf20e", "link_flair_text": "Sales Topic General Discussion", "num_comments": 208, "post_id": "13u35zs", "score": 545, "subreddit": "sales", "text": "\"I know I will get down voted but idgaf. Accepting a culture of 200+ dials a day, working more than 40 hours a week, and always being on a call for customers is sickening. We all know people have bills to pay and sales is the probably the lowest barrier to entry profession but desperation and burnout are problems that cannot be ignored. The most successful sales people aren't the ones waking up at 4am on a Monday to prospect drinking black rifle coffee. They know how to manage stress and work to live. Have standards, live more, or else you'll get exploited and or exploit yourselves. Don't get caught up in LinkedIn cringe. Remember that everyone's OTE is higher on the internet.\"", "title": "Rant about this sub", "upvote_ratio": 0.9, "url": "https://www.reddit.com/r/sales/comments/13u35zs/rant_about_this_sub/"}, {"author": "HeistPlays", "created_utc": 1707705112.0, "link_flair_template_id": "bdab74fe-cd00-11e5-a1b1-0ee60891a65b", "link_flair_text": "Sales Careers", "num_comments": 174, "post_id": "1aopdne", "score": 540, "subreddit": "sales", "text": "\"Been a BDR for 2 and a half years. A year and a half at the enterprise level.\\n\\nHad a recruiter reach out today about a fully remote gig. Said the pay was \\u201c70-105k.\\u201d\\n\\nSent me the JD, which listed a 36k base. 70-105 was the \\u201canticipated earnings\\u201d.\\n\\nI told him I couldn\\u2019t afford to pay my bills on a 36k base. I live in NYC.\\n\\nHe sent back a thumbs up emoji.\\n\\nAnyway, hope you guys are having a great Q1.\"", "title": "It’s rough out there boys.", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/sales/comments/1aopdne/its_rough_out_there_boys/"}, {"author": "VivaNapoleon", "created_utc": 1703162084.0, "link_flair_template_id": "5d7b6946-0047-11e3-ab17-12313b0cf20e", "link_flair_text": "Sales Topic General Discussion", "num_comments": 95, "post_id": "18nm13b", "score": 537, "subreddit": "sales", "text": "\"From the perspective of this sub, everyone is smashing their quotas and making a killing.\\n\\nAfter five years of being a slightly above average AE, today I closed a rogue deadline day deal that gets me to President's Club for the first time ever. I've always just been short, hitting 75-90% over the last few years.\\n\\nBuzzing is an understatement, almost broke down in bloody tears!\"", "title": "Today, for the first time, I hit President's Club.", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/sales/comments/18nm13b/today_for_the_first_time_i_hit_presidents_club/"}, {"author": "Baal-Hadad", "created_utc": 1682408130.0, "link_flair_template_id": "5d7b6946-0047-11e3-ab17-12313b0cf20e", "link_flair_text": "Sales Topic General Discussion", "num_comments": 533, "post_id": "12ybzfq", "score": 541, "subreddit": "sales", "text": "\"I just got a PO for almost $9M. The largest deal of my career. Not only that, I've already sold $3M on a $2.5M quota. I should rake in over $700K in salary and commission this year. Somewhere around half of it will be taken by provincial and federal governments. I can't help but feel cheated. There's a good chance I never make this much money again, but the government is going to tax me like someone who makes $700K regularly. How is that fair? \\n\\nComission income should be taxed on a 5-year rolling average to account for the boom and bust nature of our profession.\"", "title": "Anyone get a bit depressed thinking about how much of your money goes to taxes?", "upvote_ratio": 0.81, "url": "https://www.reddit.com/r/sales/comments/12ybzfq/anyone_get_a_bit_depressed_thinking_about_how/"}, {"author": "Fit-Block-2517", "created_utc": 1679600316.0, "link_flair_template_id": "bdab74fe-cd00-11e5-a1b1-0ee60891a65b", "link_flair_text": "Sales Career Q&A", "num_comments": 361, "post_id": "11zuuxa", "score": 535, "subreddit": "sales", "text": "\"\\ud83e\\udee1\"", "title": "Joined tech at 19 as bdr wanting to make a bijilion dollars, just got laid of at 20, I will be going to college and coming back when the market is good again, see you in 4 years soldiers 🫡", "upvote_ratio": 0.91, "url": "https://www.reddit.com/r/sales/comments/11zuuxa/joined_tech_at_19_as_bdr_wanting_to_make_a/"}, {"author": "None", "created_utc": 1600440350.0, "link_flair_template_id": "257e55e4-0047-11e3-b199-12313b0eb082", "link_flair_text": "Advice", "num_comments": 104, "post_id": "iv7ev5", "score": 533, "subreddit": "sales", "text": "\"On June 24, I got fired for working from my vacation house. Yes, I had permission to work from home (I actually worked there for a month in March) but my LinkedIn influencer CEO thought that not asking permission was untrustworthy (and yes, I never missed a meeting and was still closing deals). Genuinely, insane. \\n\\nThe next month I decided I was done with sales. I had a job offer at a good startup where I knew the VP of sales. I turned it down. I was done with tech. I was going to start a business. I got close with a few ideas, even built websites. Then I realized \\u201choly shit, a steady paycheck is nice.\\u201d \\n\\nSo I began applying again. Holy crap is the market competitive right now! I got to final stages with three companies. All rejected. I felt horrible. \\n\\nMy bank account slipped further and further. And further. My anxiety grew (I have two kids, a wife, a mortgage, and nice life). I felt genuinely useless. Helpless. Depressed. \\n\\nBut I learned a lot. I learned how complacent I was. How burnout had been affecting me for 2+ years. I learned to never take a job for granted. Even a bad job paying you is better than no job. I learned how in sales, it\\u2019s easy to let your lifestyle grow\\n\\nI accepted a job yesterday. 15K more base salary than my last. Better title. It took forever. \\n\\nMy wife and I are going to be more frugal though. I\\u2019m selling my 2019 4Runner for a Honda Civic. I\\u2019ll have no car payment and I\\u2019ll save on gas. We\\u2019re going to limit our ruthless spending. \\n\\nGreat learning experience but it sucked ass.\"", "title": "Never take your job for granted", "upvote_ratio": 0.99, "url": "https://www.reddit.com/r/sales/comments/iv7ev5/never_take_your_job_for_granted/"}, {"author": "astillero", "created_utc": 1603368600.0, "link_flair_template_id": "5d7b6946-0047-11e3-ab17-12313b0cf20e", "link_flair_text": "Discussion", "num_comments": 101, "post_id": "jfyepv", "score": 536, "subreddit": "sales", "text": "\"One trait I\\u2019ve noticed that high-performing salespeople seem to share is their tone of voice. It\\u2019s not too eager. It\\u2019s relaxed. It's self-effacing. It can be slightly inquisitive but never in an irritating way. Their tone is friendly even playful. It rarely comes across as contrived. \\n\\nTone of voice I believe is that critical perhaps subconscious element, which makes us decide whether we want to continue a conversation with somebody or not. It\\u2019s probably one of the most powerful traits of high-performing salespeople but yet is rarely talked about.\"", "title": "One of the most powerful but least talked about attributes of high-performing salespeople…", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/sales/comments/jfyepv/one_of_the_most_powerful_but_least_talked_about/"}, {"author": "jayicon97", "created_utc": 1684505330.0, "link_flair_template_id": "5d7b6946-0047-11e3-ab17-12313b0cf20e", "link_flair_text": "Sales Topic General Discussion", "num_comments": 121, "post_id": "13lwhyj", "score": 532, "subreddit": "sales", "text": "\"I sell exterior remodeling services to homeowners. In the Northeast, this time of year is insane for us. I\\u2019ve sold $300k in the last 30 days at 10% commission + base.\\n\\nI\\u2019ve been working 12 hour days, living off Redbull, Coffee, and Nicotine. I have a 1PM today and then I\\u2019m done for the week. I\\u2019m heading right home, making a rum & coke - and totally relaxing. My wife already knows, and isn\\u2019t expecting my to help care with my 15 month old. I appreciate the sacrifices she makes for my career. \\n\\nSales is fucking tough. It\\u2019s brutal. It\\u2019s cutt-throat. But boy is it rewarding. $35k gross pay over the last 30 days. And there\\u2019s still hot months ahead. \\n\\nAt my 1PM, I\\u2019m going to give one last masterful presentation. Overcome objections, and push for the sale. One last hoorah. \\n\\nSending good vibes to all my closers out there.\"", "title": "What a fucking week.", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/sales/comments/13lwhyj/what_a_fucking_week/"}, {"author": "mychamberpot", "created_utc": 1608736079.0, "link_flair_template_id": "257e55e4-0047-11e3-b199-12313b0eb082", "link_flair_text": "Advice", "num_comments": 171, "post_id": "kiupku", "score": 528, "subreddit": "sales", "text": "\"This is a throwaway account, but in real life I am a VP of sales for SaaS platform and its a multi billion-dollar company. I have made significant $ in commission over my 49 years and some super shit years of barely making it. You can read and do all the sales woo you want (and I highly suggest to make sales practice apart of your daily ritual). But I will tell you the real secret. \\n\\nLive below your means so that when shit hits the fan you can take your TIME to find the right position. Otherwise you are taking the next thing that comes at you hoping you will make quota just to keep lights on. What I have Always done.. I live on my base pay and commission paid off house, car, second home, real estate investment. You will hit burn out and hit it hard, don't be tempted to keep your expenses tied to your commission. \\n\\nNothing feels as good as being able to say oh hell no to an opportunity knowing you can keep the lights on and go on vacation. Your confidence will shine. \\n\\nKeep selling!\"", "title": "Want the key to a lifelong sales career ? Live below your means and have plan B", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/sales/comments/kiupku/want_the_key_to_a_lifelong_sales_career_live/"}, {"author": "ZealousidealWin3593", "created_utc": 1683570600.0, "link_flair_template_id": "bdab74fe-cd00-11e5-a1b1-0ee60891a65b", "link_flair_text": "Sales Career Q&A", "num_comments": 216, "post_id": "13c0er0", "score": 526, "subreddit": "sales", "text": "\"Hey there folks,\\n\\nI'm a top-performing sales person at a small Tech company's chronically under-performing Sales team. So we all suck at our job, but I'm the least sucky of the bunch.\\n\\nBoss has announced that we're all travelling to Europe next month for a week-long company retreat because of some big goals the company as a whole hit this year.\\n\\nAll expenses paid and the goal (it seems) is to do fun shit, so no HR-mandated cringy team-building stuff.\\n\\nSo far it seems it's all true as the HR folks are taking everyone's info to buy plane tickets within the next few days.\\n\\nThing is, I'm tired of this company and am already taking interviews for new roles. If all goes well, I'll likely be taking a new role by the end of June.\\n\\nAs such, I'm feeling guilty of the money the company will be spending on me just for myself to move on one or two weeks afterwards (talk about burning bridges). On the other hand, hey it's a free vacation to a place I wouldn't be able to vacation to on my own means.\\n\\nEDIT: Damn, you all some stone-cold motherfuckers. And I love you all for it. To Europe we go!\\n\\nEDIT 2: Company just emailed me my plane tickets. I'm fucking excited!\"", "title": "Should I take an all-expenses paid company retreat if I plan to quit right after?", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/sales/comments/13c0er0/should_i_take_an_allexpenses_paid_company_retreat/"}, {"author": "TheGymOwnersPodcast", "created_utc": 1674054262.0, "link_flair_template_id": "257e55e4-0047-11e3-b199-12313b0eb082", "link_flair_text": "Advice", "num_comments": 176, "post_id": "10f9ij0", "score": 527, "subreddit": "sales", "text": "\"I want everyone to \\n\\n1. Do what you have to to Wake the hell up\\n2. Tell yourself that you are the best of what you do and you believe in what you sell\\n3. We are going to make new friends today and close some deals! \\n4. Give me a big fist bump through your monitor right now\\n\\nIn sales, we are continuously being told no and have to get back up with a smile and try again. If yesterday was a bad day for you, You have all of today to kill it!\"", "title": "GOOOOOD MORNINGGGG Reddit Sales Team!!!", "upvote_ratio": 0.91, "url": "https://www.reddit.com/r/sales/comments/10f9ij0/goooood_morningggg_reddit_sales_team/"}, {"author": "coldcalls", "created_utc": 1603493361.0, "link_flair_template_id": "257e55e4-0047-11e3-b199-12313b0eb082", "link_flair_text": "Advice", "num_comments": 57, "post_id": "jgxoad", "score": 526, "subreddit": "sales", "text": "\"Hi guys. \\n\\nI posted this elsewhere, but I doubt much people saw it.\\n\\nA little bit about me. I started working in the Financial Industry at 18 years old. Purely commission based, and all sales were done primarily over the phone.\\n\\nTo say it was rough in the beginning is an understatement. I had zero sales experience coming in, and was also a pretty shy kid growing up. As a matter of fact, the reason I got into sales was because my dad thought if I jumped head-first into a sales career it would help me break out of my shyness & anxiety.\\n\\n15 years later, I\\u2019m still going strong and now at the peak of my career. I figured I could dispel a few myths and maybe offer some guidance.\\n\\nI know this has been talked about a bunch of times, but I figured I could contribute my own viewpoint on the subject.\\n\\n**COLD CALLING IS DEAD**\\n\\nNah. I\\u2019m pretty sure I\\u2019ve seen hundreds of blog posts every year for the last 15 years with this exact headline. Most of them were selling digital marketing services, go figure.\\n\\n**ONLY EXTROVERTS SUCCEED IN SALES**\\n\\nAgain, nope. As a matter of fact, some of the most successful people I\\u2019ve come across in the industry were quite introverted. They made ME feel like a social butterfly. To give you an idea, growing up I was a very quiet kid who loved programming and always thought I would have ended up in that field. Never had many friends, so I barely left home. As a matter of fact, I used to spend summer vacations at home pretty much glued to my computer either playing World of Warcraft or learning how to program.\\n\\n**PEOPLE HATE GETTING CALLED**\\n\\nSure, some people get annoyed. Just like with ads on a Youtube video, popup ads on the internet, or commercial breaks on your TV. But if you had a good product that served who you were calling, you\\u2019ll come to realize that those same people might actually be grateful for your call. It\\u2019s just like any other form of advertisement. If people like what you are offering, great. Deliver on what you are selling and everyone wins. If not, no worries, move on from the call. And don\\u2019t call people that are on the DNC. 80% of my client base started with an introductory phone call from me. The other 20% are referrals. I\\u2019ve had clients stick around with me for over 10 years and have built very close relationships with many of them. All from a quick phone call that they weren\\u2019t expecting.\\n\\n**COLD CALLING IS A NUMBERS GAME**\\n\\nI\\u2019m sure you\\u2019ve heard this many times before. \\u201cKeep dialing, it\\u2019s a numbers game\\u201d Or \\u201cCold calling is a contact sport, just keep at it.\\u201d It\\u2019s always oversimplified. Let me break it down for you. Know your numbers. Know your closing rate, contact rate, cold lead to warm lead/prospect rate. You should be writing everything down daily. Over time if you see that you\\u2019re consistently closing 10% of your warm leads, then you know that you need roughly 10 warm leads/qualified prospects to close a deal. That\\u2019s when it becomes a \\u201cnumbers game.\\u201d Obviously, you should try and improve your closing rate, and any other measurable statistic that you have control over. Look at your cold-calling as a business. You should know every statistic possible about your calls. You should be able to predict future revenue based on your data - just like any other business would.\\n\\nA couple of tips for those struggling or thinking about getting into cold calling:\\n\\n* Know your customer profile & average turnaround time to sell your product. Not everyone is going to be a lead or a prospect. And you definitely do not want to be blindly pitching everyone your service. You should have a list of \\u201cqualifying\\u201d questions that you bring up in conversation to see if it\\u2019s a good fit or not. If they are a good fit, and would be happy to work with you and your services, great. You\\u2019ve got a new warm lead. You don\\u2019t want to be wasting your time or the prospect's time presenting your service if there\\u2019s no need.\\n* Smiling works. You don\\u2019t want to come off as robotic or monotone. I could go on about tonality and how important it is in your presentation - but the key is to sound sincere and helpful, really as simple as that. Smiling is disarming and contagious and even though they can\\u2019t see you, the prospect on the other line can definitely hear the difference.\\n* DISCIPLINE is one of the most important factors in cold calling success. I\\u2019ve seen guys have amazing months and then stop cold calling. Eventually, they start wondering why they aren\\u2019t having as much success as before, go into a negative spiral and eventually quit. Then they go to another company hoping things will magically change and end up doing the same thing. No matter your success levels, if cold calling is your primary way of getting business you just simply can't stop. Prospecting for new business is something that needs to be done as often as you can. If you lack time because you have a substantial book of business that you need to service, look into hiring callers for you. If it\\u2019s a time management issue, then you need to fix that. To illustrate, imagine your local pizza shop had a great promotion and had the busiest month as far as new customers since their inception. The next month they put up a sign saying \\u201cSorry, we aren\\u2019t taking any new customers at this time.\\u201d That obviously will never happen. But that\\u2019s effectively what you are doing once you stop cold calling no matter where you are in your business.\\n* Understand that some months will be great, some won\\u2019t. Some days you\\u2019ll feel like you\\u2019re on top of the world and other days you\\u2019ll be down in the dumps. This is why discipline is important. You need to be able to train yourself to get the job done no matter what. That doesn\\u2019t mean that you have to be closing deals everyday (unless it\\u2019s a requirement of your job/business.) What it means is you need to show up and put the effort in making your dials, follow-ups, and whatever else your job entails.  \\n\\n\\nHope it helps. Good luck guys.\"", "title": "My thoughts on cold calling after 15 years...", "upvote_ratio": 0.99, "url": "https://www.reddit.com/r/sales/comments/jgxoad/my_thoughts_on_cold_calling_after_15_years/"}, {"author": "Sailing_4th", "created_utc": 1603661646.0, "link_flair_template_id": "257e55e4-0047-11e3-b199-12313b0eb082", "link_flair_text": "Advice", "num_comments": 47, "post_id": "ji1oyl", "score": 515, "subreddit": "sales", "text": "\"After almost 20 years of sales you learn quite a bit and I thought I\\u2019d share some of that with y\\u2019all during this pandemic.\\n\\nCurrently I work for a large technology company in the enterprise cloud space and am involved in some of the most unique and incredibly rewarding engagements. I was offered a role with $375k OTE with a major company but turned it down because I can do just as much, if not more where I\\u2019m at. But also from a lifestyle standpoint I\\u2019m happy today.\\n\\nBut to get there it took time and if I had to break down my experience I'd say this:\\n\\n1. There are no shortcuts. To get to a role where \\\"it's not work if you enjoy what you do\\\" requires you to work the jobs you don't like to do to get there.\\n\\n2. Corporate America has no loyalty. You might have a good relationship with some people in the organization but when dollars and cents get involved you're just another FTE or number.\\u00a0Complacency is your enemy.\\n\\n3. People do business with people they like. All the sales books you read are good when you're starting out but once you're working with millions of dollars on the negotiating table, its you they're buying from.\\n\\n4. Office politics is crucial to your success. It can help you get more leads, process your orders faster, get you promotions and make you a lot more money or give you more flexibility with your time. Be nice to everyone if even they can't do anything for you.\\n\\n5. Take notes. Lots and lots of notes. When the sales cycles get long on large contracts, people come and go on both sides of the table. It helps to have important details documented. Microsoft One Note is your friend.\\n\\n6. Disqualifying opportunities quickly. You learn not to waste time on a wild goose chase so be comfortable in saying no to a possible engagement early on and people will respect you for it.\\n\\n7. Never take your foot off the pedal. If you close a big deal, take a day to celebrate but then keep pressing.\\u00a0Momentum is everything in sales. It also helps prevent your pay from going up and down each month.\\n\\n8. Use technology to your advantage. Automate things that you can, I mentioned One Note earlier, use your calendar to track your time, put notes in your CRM like Salesforce. Find out how to use filters and think of creative ways to find opportunities that are low hanging fruit.\\n\\n9. Become a good story teller. Remember that you\\u2019re helping someone find a solution to a problem. Share stories of how you\\u2019ve helped other customers and don\\u2019t spend too much time being technical unless it\\u2019s a technical conversation.\\n\\n10. It\\u2019s ok to cross into the grey area. Sometimes you need to push your organization to make exceptions to win a deal. It\\u2019s ok to ask for those, just be particular about which ones are worth fighting for.\\n\\n11. Take time off. Nothing bothers me more when someone tells me they\\u2019re such a great employee because they only took 2 days off this year. Taking time off, traveling, spending time with loved ones gives you the fuel you need to stay motivated.\\n\\n12. Follow through on commitments. If you\\u2019re running behind on getting something back to a client (internal or external), email or call them and let them know there\\u2019s a delay but you haven\\u2019t forgotten about them. This goes a long way in building credibility.\\n\\n13. Don\\u2019t burn bridges. I actually wound up back in tech sales because a former employee of mine wound up becoming a recruiter and found that opportunity for me. We were never best friends and she was always a pain in my ass but we respected each other at work. You will run into people over and over again.\\n\\n14. Be humble. Even with my experience, I often come across people who are just brilliant sales people with so much to learn from. Take the time to thank them and ask if you can pick their brain.\\n\\nI\\u2019m sure I can spend hours thinking of more but these are the most immediate ones that came to mind.\"", "title": "New to sales or considering working in sales? Read this. 20 years of experience shared.", "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/sales/comments/ji1oyl/new_to_sales_or_considering_working_in_sales_read/"}, {"author": "MrSexyMagic", "created_utc": 1649274018.0, "link_flair_template_id": "257e55e4-0047-11e3-b199-12313b0eb082", "link_flair_text": "Advice", "num_comments": 71, "post_id": "txucju", "score": 509, "subreddit": "sales", "text": "\"I have about a $500k proposal I am presenting to a prospect tomorrow. I've been in sales 12 years and this is the single largest potential deal I've ever had on the table. Doesn't help I'll have two executives (CEO and CTO) from my company joining me on the call.\\n\\nThe prospect is easy to talk to but damn am I still so nervous. I've been practicing and reciting all day today using co-workers, and my SO for role playing. I've worked on this for weeks with my engineering and technical team to ensure everything will go as planned and I'm 99% sure I have it in the bag but please send me any useful tips and tricks you guys have for calming nerves and keeping cool.\\n\\nMuch appreciated! LETS GO BABY  \\n\\n\\nEDIT: Damn thank you all for the advice, some great stuff here. Finishing up now and just going to get a great night sleep. I'll update ya'll tomorrow with the good news. \"", "title": "I have the biggest proposal of my life tomorrow. Send me good vibes and tips please!", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/sales/comments/txucju/i_have_the_biggest_proposal_of_my_life_tomorrow/"}, {"author": "TechStaffing", "created_utc": 1650545987.0, "link_flair_template_id": "257e55e4-0047-11e3-b199-12313b0eb082", "link_flair_text": "Advice", "num_comments": 70, "post_id": "u8n38j", "score": 511, "subreddit": "sales", "text": "\"This advice works for me. It helps I don't dial to the territory I live in too!\\n\\nI remind me friends at work everyday that it just doesn't matter. You are doing your job. That's it. Nothing about this is personal!\"", "title": "To whoever needs to hear it today: No one will remember who you are a day after you Cold Call them. Pick up that phone!", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/sales/comments/u8n38j/to_whoever_needs_to_hear_it_today_no_one_will/"}, {"author": "None", "created_utc": 1663769562.0, "link_flair_template_id": "5d7b6946-0047-11e3-ab17-12313b0cf20e", "link_flair_text": "Discussion", "num_comments": 705, "post_id": "xk6262", "score": 508, "subreddit": "sales", "text": "\"I\\u2019m a gen Z SDR. No one answers the phone. I end up primarily booking meetings through email. Even just people replying through email and then I put them on the calendar. No one wants to answer the phone. I do 70+ calls a day and maybe get 3 answers. \\n\\nThis isn\\u2019t 1990 anymore. Not sure why sales teams are still mass cold calling. Anything else where I have to call 90-100 people and get 2-4 meetings is a terrible ROI. No one else would look at that statistic and say it\\u2019s good. As someone who\\u2019s literally grown up with technology more people respond to a text than a cold call. This will only become more true as my generation takes over the workforce. \\n\\nI get some of you have been doing this for decades and this is the way. But tech has grown. \\n\\nCold calling will be a thing of the past soon.\\n\\nExpect the SDR job to either be completely cut out of the sales organization or something to change.\"", "title": "Cold calling will be a thing of the past in the next 5-10 years", "upvote_ratio": 0.73, "url": "https://www.reddit.com/r/sales/comments/xk6262/cold_calling_will_be_a_thing_of_the_past_in_the/"}, {"author": "avilsa", "created_utc": 1707314420.0, "link_flair_template_id": "5d7b6946-0047-11e3-ab17-12313b0cf20e", "link_flair_text": "Sales Topic General Discussion", "num_comments": 82, "post_id": "1al3k6i", "score": 510, "subreddit": "sales", "text": "\"It\\u2019s funny because we all post here on reddit about sales and career advice, or even to just gain some more knowledge and build the community, but I guess  I never saw Reddit l as an actual potential employer.\\n\\nIt was really funny when I got a message today from a recruiter wanting to discuss a sales position at reddit \\ud83d\\ude02\\n\\nPs: awful salary package lol\"", "title": "Reddit reached out to me", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/sales/comments/1al3k6i/reddit_reached_out_to_me/"}, {"author": "rebirthandrecover", "created_utc": 1661339924.0, "link_flair_template_id": "71af4a56-ccf8-11e5-9ace-0e55464bea03", "link_flair_text": "Off-Topic", "num_comments": 135, "post_id": "wwguq1", "score": 504, "subreddit": "sales", "text": "\"You\\u2019re the worst. That is all.\"", "title": "Iinkedin influencers:", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/sales/comments/wwguq1/iinkedin_influencers/"}, {"author": "ChezDiogenes", "created_utc": 1693848446.0, "link_flair_template_id": "bdab74fe-cd00-11e5-a1b1-0ee60891a65b", "link_flair_text": "Sales Career Q&A", "num_comments": 716, "post_id": "169y4xf", "score": 503, "subreddit": "sales", "text": "\"My world is burning down around me. -20K in debt, the woman I was going to marry was a cheater. Learned today.\\n\\nI don't have time anymore. No degree, left due to depression. Menial work since then. Absolute dogshit resume.\\n\\nSales is the only option, I do not have time for school here in Alberta, Canada.\\n\\nI will be 40 if I earn my undergrad in BComm. 40 as an entry-level intern. Impossible and unrealistic.\\n\\nI have to pull out all the stops. I need to make money. Now.\\n\\nCharming and personable enough to get a girl above my league.\\n\\nNot enough to have her be faithful, despite the purest love and kindest one can offer. I would heat up a hot water bottle and leave it in bed so that she would be warm when she got under the covers.\\n\\nIrrelevant.\\n\\nI know I'm not alone in this.\\n\\nCourses? I'll do them. You're hiring? I'll eat your shit until I shit gold.\\n\\nThis is it.\\n\\nHope to hear from you guys. Thank you.\\n\\nAlso have a completely empty LinkedIn. Would love it if I can add some of you guys. \"", "title": "I am 35. I do not have time.", "upvote_ratio": 0.82, "url": "https://www.reddit.com/r/sales/comments/169y4xf/i_am_35_i_do_not_have_time/"}, {"author": "redipg", "created_utc": 1615997765.0, "link_flair_template_id": "5d7b6946-0047-11e3-ab17-12313b0cf20e", "link_flair_text": "Discussion", "num_comments": 44, "post_id": "m740jt", "score": 505, "subreddit": "sales", "text": "\"There's a simple trick you can use for B2B prospecting in Google searches. \\n\\nWhenever I need to create lists of accounts, prospects, do some market analysis, etc I always try this first. When I'm lucky I'm able to find open spreadsheets with company data on hundreds of contacts, companies, etc.\\n\\nAll you need to do is to type the following query on google:\\n\\n* `site:docs.google.com/spreadsheets [anything_you_want]`\\n\\nFor example, if you try to search `site:docs.google.com/spreadsheets s&p 500 companies`, you'll immediately find a spreadsheet with all the companies to save a few hours of list building.\"", "title": "List Building: How I sometimes avoid half the job with a simple google search", "upvote_ratio": 0.99, "url": "https://www.reddit.com/r/sales/comments/m740jt/list_building_how_i_sometimes_avoid_half_the_job/"}, {"author": "MilesTheGoodKing", "created_utc": 1705514534.0, "link_flair_template_id": "5d7b6946-0047-11e3-ab17-12313b0cf20e", "link_flair_text": "Sales Topic General Discussion", "num_comments": 356, "post_id": "19933io", "score": 502, "subreddit": "sales", "text": "\"I got fired today for the first time in my life, and it was out of nowhere. I'm not sure what to do or where to go, I'm honestly still in shock. I trust this sub, can you give me some advice?\\n\\n&#x200B;\"", "title": "Well, I got fired today", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/sales/comments/19933io/well_i_got_fired_today/"}, {"author": "GeorgeSteele66", "created_utc": 1706368858.0, "link_flair_template_id": "bdab74fe-cd00-11e5-a1b1-0ee60891a65b", "link_flair_text": "Sales Careers", "num_comments": 102, "post_id": "1acd3m3", "score": 504, "subreddit": "sales", "text": "\"After being laid off for the last 9 months, I landed 2 job offers last week and increased my base by 60k.  That should make up for going without a check the last few months.  \\n\\nLet\\u2019s go crush it in 2024!  Market is hot right now.\"", "title": "I’m back!!! 2 job offers last week.", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/sales/comments/1acd3m3/im_back_2_job_offers_last_week/"}, {"author": "LearningJelly", "created_utc": 1693962509.0, "link_flair_template_id": "5d7b6946-0047-11e3-ab17-12313b0cf20e", "link_flair_text": "Sales Topic General Discussion", "num_comments": 147, "post_id": "16b6br9", "score": 497, "subreddit": "sales", "text": "\"Curious. We have all been around them.  Why did this person stand out so well? What did they do so differently?\\n\\nMine\\n1-1995- selling shoes on commission at Neiman Marcus ( believe it or not people did 6 figures in business that long ago ). Ron was a gift. He had only 2 fingers on one hand and was your Al Bundy but... One who made bank. Taught me to anticipate objections and upsell. Ex: woman wanted two shoes to try on, he brings out another 3, then walks her to handbags, then jewelry. And exquisite customer care... We had old school black binders filled with our clients. He would call them and let them know a size X in this shoe came in and would look amazing on them... The customers are.it.up... He would rmemeber everything about them and detail it in his black book. \\n\\nThis was back when people died of aids. And he fell down to it. He had rolls royces lined around the funeral from client's giving their respects to him.  Sobbing. He was their friend, confidant, support system in many ways. \\n\\n2-  When I was still in that bubbly happy female in sales phase when in corporate enterprise sales... I shadowed a  man, dry bone personality, giant introvert. Listened exquisitely. Left long pauses... So when he had something to say the prospect listened and he had instant respect. I learned the importance of executive gravitas from him and changed my entire sales persona. \\n\\n3- A slayer female sales exec that I had the luck to take me under her wing and to this day. I won't ever have her level of sales acumen, ever. Some people are just golden. I learned the art of difficult enterprise selling and how much of it was actually keeping exquisite notes and being your own project manager. She could knit back a pain point during a high table stakes sale with absolute confidence and precision. Still a friend to this day and doing bad ass shit still. \\n\\n\\nAnyone else? Who has been pivotal in a positive way that made a profound shift in your sales thinking? ( that you were around not some LinkedIn person lol).\\n\\nI learn the most from stories like this so if you are willing to share im sure this sub would be thankful.\"", "title": "Why is the best sales person you ever have been around.. The best?", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/sales/comments/16b6br9/why_is_the_best_sales_person_you_ever_have_been/"}, {"author": "doodedah", "created_utc": 1646765522.0, "link_flair_template_id": "5d7b6946-0047-11e3-ab17-12313b0cf20e", "link_flair_text": "Discussion", "num_comments": 173, "post_id": "t9nx7h", "score": 493, "subreddit": "sales", "text": "\"I am a head of sales at a SaaS company and have been this job for 5 years now across two companies and I have a simple saying, \\u201cif you are missing quota you work for me but if you are hitting quota, then I work for you\\u201d. Replacing strong performers is not easy and management needs to do everything we can to retain talent. Here are some things I do to retain talent. What else should managers be doing?\\n\\n- sending texts or calling reps just to tell them they are doing a good job. That\\u2019s it. No deal questions, just thank you for being on the team. \\n- no internal meetings on Fridays and encouraging people to make their own schedules to take long weekends\\n- encouraging one mental health day a month that doesn\\u2019t count against PTO (US is unlimited vacation but EMEA is not)\\n- juicy cash sales contests (last year I gave away about $100k in sales contests)\\n- competitive comp plans that reward over-performance \\n- no micro-managing and only 1.5 hrs of required internal meetings a week (team meeting, 1:1 and forecast call)\\n- internal training on use cases and verticals\\n- giving reps freedom to work their own hours as long as they deliver the number\\n- work from home forever \\n\\nWhat else am I missing? What else can I be doing?\"", "title": "Managers - Put in the work to retain your sales people!", "upvote_ratio": 0.99, "url": "https://www.reddit.com/r/sales/comments/t9nx7h/managers_put_in_the_work_to_retain_your_sales/"}, {"author": "DollarBillEvans", "created_utc": 1590120812.0, "link_flair_template_id": "257e55e4-0047-11e3-b199-12313b0eb082", "link_flair_text": "Advice", "num_comments": 133, "post_id": "goccoi", "score": 492, "subreddit": "sales", "text": "\"15 years of hard abuse, as often as possible.\\n\\nToday Im 25 days sober for the first time ever. \\n\\nThe reason I'm posting it here is because the impact it had on my ability to do my job is insane. The clarity I have when dealing with prospects is amazing. \\n\\nI can't believe how good I feel. \\n\\nIf you're out there considering a similar life change - go for it. Start today. \\n\\nThe first week sucked and then I dove head first into my job to distract myself. The return has been terrific, I've literally 4x my activity, came 8th nationally in sales and have generally been enjoying everything again. \\n\\nIf you retreat into alcohol and are thinking about a break - do it. \\n\\nJust do it and feel good finally. \\n\\nGood luck out there everyone!\\n\\n- - - - - - - - - - - \\nUPDATE: WOW!! Thank you everyone for the support! Honestly I really really appreciate it. I've been active on r/sales for the last year(ish) and I keep coming here because the community is so worthwhile to interact with and the response to my post showcases that! Thanks again for the love, the comments and the stories (some of you even gave rewards! That's bananas!). I'll respond to everyone as well! Just gotta finish closing up some to-dos for the day then I'll dig in!\"", "title": "I quit drinking.", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/sales/comments/goccoi/i_quit_drinking/"}, {"author": "OSRSvsFIFA", "created_utc": 1655134130.0, "link_flair_template_id": "5d7b6946-0047-11e3-ab17-12313b0cf20e", "link_flair_text": "Discussion", "num_comments": 148, "post_id": "vbesew", "score": 495, "subreddit": "sales", "text": "\"As well as the people who jump in their comments posting fake cheesy praise messages in a desperate attempt to get noticed\\n\\nAgree\\u2026.?\"", "title": "Becoming an SDR and using LinkedIn everyday has made me realise how much I despise sales “influencers” and “gurus”", "upvote_ratio": 0.99, "url": "https://www.reddit.com/r/sales/comments/vbesew/becoming_an_sdr_and_using_linkedin_everyday_has/"}, {"author": "patrickoh37", "created_utc": 1674699957.0, "link_flair_template_id": "5d7b6946-0047-11e3-ab17-12313b0cf20e", "link_flair_text": "Discussion", "num_comments": 116, "post_id": "10lh0gc", "score": 497, "subreddit": "sales", "text": "\"After several years of middling to high performing sales, all done by nickel and diming, I finally landed a whale. $1.2 million TCV and a total comp payout close to $100k. \\n\\nI haven\\u2019t been this pumped for what\\u2019s next in years. \\n\\nKeep moving that needle, y\\u2019all.\"", "title": "Just Landed The Largest Deal of My Career", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/sales/comments/10lh0gc/just_landed_the_largest_deal_of_my_career/"}, {"author": "astillero", "created_utc": 1669299167.0, "link_flair_template_id": "71af4a56-ccf8-11e5-9ace-0e55464bea03", "link_flair_text": "Off-Topic", "num_comments": 126, "post_id": "z3kzqx", "score": 493, "subreddit": "sales", "text": "\"They can do spontaneous laughter.\\n\\nThey can initiate a conversation, drop in some humour and then do some spontaneous laughter. This is not just random laughter, however. They will be bouncing off on comments made by the prospect in a humourous and playful way. Want to see this in action - watch some Dave Letterman interviews. He was a master of the art of spontaneous laughter. \\n\\nPulled-off correctly. This can be really powerful. \\n\\nIt relaxes the prospect. It put's them in a good mood but also it encourages prospects to talk. In fact, with spontaneous laughter thrown into the equation a sales call does not feel like a sales call. It feels like a call from an old friend.\"", "title": "Here is a secret weapon of some salespeople that is rarely talked about...", "upvote_ratio": 0.94, "url": "https://www.reddit.com/r/sales/comments/z3kzqx/here_is_a_secret_weapon_of_some_salespeople_that/"}, {"author": "None", "created_utc": 1695771017.0, "link_flair_template_id": "5d7b6946-0047-11e3-ab17-12313b0cf20e", "link_flair_text": "Sales Topic General Discussion", "num_comments": 215, "post_id": "16t3vzw", "score": 489, "subreddit": "sales", "text": "\"You're burnt out specifically on tech sales. \\n\\nThere's been a lot of doom and gloom posts here recently. This sub is very tech sales heavy so I get it. The market is shitty right now. Plus, staring a screen all day blows, especially when prospects aren't breaking your door down to buy. \\n\\nThe reality is tech sales is on a steep correction and downturn. In the past, it didn't take much to get put on and get promoted as a salesperson in tech. It was all $200K annually and 4 hour workdays. Now? It's prospecting like an SDR fighting to stay employed no matter what your role is. Breathe wrong and you'll be put on a PIP. It sucks. \\n\\nWe're all a little burnt out as a result. \\n\\nBut y'all, sales isn't limited to tech. There are options. Outside sales. Med Device. Pharma. Manufacturing. Insurance. Etc. Etc. Etc. \\n\\nIf you haven't already, start connecting with people outside of tech sales so you can get a better perspective. It's rough but (most times) it's not you. It's just the industry right now. Pivot out of this tech shit if you need to. But don't leave sales because tech is struggling.  \"", "title": "Sales isn't dead. You're just burnt out.", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/sales/comments/16t3vzw/sales_isnt_dead_youre_just_burnt_out/"}, {"author": "SeamlessSucks", "created_utc": 1641828298.0, "link_flair_template_id": "5d7b6946-0047-11e3-ab17-12313b0cf20e", "link_flair_text": "Discussion", "num_comments": 128, "post_id": "s0mi4o", "score": 493, "subreddit": "sales", "text": "\"A post was made about how shit Seamless was to warn anyone looking for jobs.\\n\\n&#x200B;\\n\\nIt cited sexual assault, racism, and a horrid worklife.\\n\\n&#x200B;\\n\\nIt has been removed by reddit due to complaints from Seamless.\\n\\n&#x200B;\\n\\nPlease make a note to inform anyone asking about Seamless about how bad they are and they are actively censoring a sales subreddit.\\n\\n&#x200B;\\n\\nIt must be true, if they care that much.\"", "title": "Seamless.AI Censoring this Subreddit", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/sales/comments/s0mi4o/seamlessai_censoring_this_subreddit/"}, {"author": "AngryPringle", "created_utc": 1696998431.0, "link_flair_template_id": "5d7b6946-0047-11e3-ab17-12313b0cf20e", "link_flair_text": "Sales Topic General Discussion", "num_comments": 227, "post_id": "1755jez", "score": 483, "subreddit": "sales", "text": "\"When asked \\u201cWhat do you do for a living\\u201d answer is usually either something like:\\n\\n\\u201cI\\u2019m a Global Strategic Enterprise Acoount Director for ButtCo where we help CIOs smell and analyze their own farts using LLMs and AI.\\u201d\\n\\nvs\\n\\n\\u201cI\\u2019m in sales\\u201d\\n\\nIn my experience those who answer the second way are usually the top performers.\"", "title": "Two kinds of salespeople", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/sales/comments/1755jez/two_kinds_of_salespeople/"}, {"author": "ActionJ2614", "created_utc": 1678633245.0, "link_flair_template_id": "6556da10-ba37-11ed-b477-b2f0ea15246d", "link_flair_text": "Fundamental Sales Skills", "num_comments": 75, "post_id": "11pgjk1", "score": 480, "subreddit": "sales", "text": "\"**Never Split The Difference-Cliff Notes (Part 1 of 6)**\\n\\n**Goal**\\n\\n\\u25cf People want to be **understood** and **accepted.** 2 primal urges:\\n\\n\\u25cb Need to feel **safe** **&** **secure**\\n\\n\\u25cb Need to feel **in** **control**\\n\\n\\u25cf **Listen** **intensely** **\\u2192** demonstrate **empathy** \\\\+ show a **sincere** **desire** to better understand what the other side is experiencing\\n\\n**Prepare**\\n\\n\\u25cf Goal: reveal **surprises** in the negotiation\\n\\n\\u25cf Hypotheses vs. assumptions: Use negotiation to **test** **hypotheses**\\n\\n\\u25cf Uncover as much information as possible (not battle of arguments)\\n\\n\\u25cf Uncover what counterpart **actually** **needs** (money, emotional, otherwise) \\u2192 get them **feeling** **safe** to talk more\\n\\n\\u25cf Sole focus: the other person and what they have to say\\n\\n**Tone**\\n\\n\\u25cf **Smile**\\n\\n\\u25cf **Slow.** **It.** **Down**\\n\\n\\u25cf Three voices:\\n\\n\\u25cb Late-night DJ voice: Use selectively to make a point. Inflect voice downward. Calm and slow. Creates aura of trustworthiness without triggering defensiveness\\n\\n\\u25cb Positive & playful: Default voice. Voice of easygoing & good natured person. Relax & smile while talking\\n\\n\\u25cb Direct / Assertive: Used rarely\\n\\n**Mirror**\\n\\n\\u25cf **Repeat** **the** **last** **(or** **critical)** **3** **words** of what someone else has said\\n\\n\\u25cf Insinuates similarity which facilitates bonding\\n\\n\\u25cf Connectors because they help your counterpart connect thoughts\\n\\n**Mirror** **Process**\\n\\n1. Use Late Night FM DJ Voice\\n2. Start sentences with *I\\u2019m* *sorry\\u2026*\\n3. Mirror\\n4. **Silence**, at least 4 seconds to let mirror work it\\u2019s magic\\n5. Repeat\\n\\n**Tactical** **Empathy**\\n\\n\\u25cf Imagine myself in the counterpart\\u2019s situation\\n\\n\\u25cf **Recognize** **their** **perspective** **and** **vocalize** **that** **recognition**\\n\\n\\u25cf Understand counterpart\\u2019s feelings & hear what is behind those feelings\\n\\n\\u25cf Bring my attention to the emotional obstacles to getting an agreement done\\n\\n\\u25cf Look at **words**, **tone**, and **body** **language.** Spot changes and look for incongruencies\\n\\n**Labels**\\n\\n\\u25cf **Validate** **someone\\u2019s** **emotion** **by** **acknowledging** **it**\\n\\n\\u25cf *It* *seems* *like* *.*\\n\\n\\u25cf *It* *sounds* *like* *.*\\n\\n\\u25cf *It* *looks* *like* *.*\\n\\n\\u25cf **Pause** to let the label sink in (3-4 seconds). Other party will fill in the silence\\n\\n\\u25cf Every 4th verbalization should be a label\\n\\n**Neutralize the** **Negative**\\n\\n\\u25cf Focus first on **clearing** **the** **barriers** to an agreement\\n\\n\\u25cf Label fears to diffuse their power\\n\\n\\u25cf *Look* *I\\u2019m* *an* *asshole*\\n\\nProcess:\\n\\n1. Observe without reaction & judgement\\n2. Label each negative feeling\\n\\n**3.** **Replace** **with** **a** **positive,** **compassionate** **&** **solution-based** **thought**\\n\\n**Accusation** **Audit**\\n\\n\\u25cf List the worst things my counterpart can say about me first\\n\\n\\u25cf Use labels to reinforce & encourage positive perceptions\\n\\n\\u25cf Remove *I* *understand* from your vocabulary. Never use it\\n\\n**(Part 2)**\\n\\n**Start** **with** ***No***\\n\\n\\u25cf Need to feel **in** **control** \\u2192 get by saying *No*\\n\\n\\u25cf Saying *Yes* makes people defensive\\n\\n\\u25cf If I hear *No* *\\u2192*\\n\\n\\u25cb *What* *about* *this* *doesn\\u2019t* *work* *for* *you?*\\n\\n\\u25cb *What* *would* *you* *need* *to* *make* *this* *work?*\\n\\n\\u25cb *It* *seems* *there\\u2019s* *something* *here* *that* *bothers* *you?*\\n\\n\\u25cf 3 types of **Yes**\\n\\n\\u25cb Counterfeit: *Yes,* as an escape route (want to say *No*)\\n\\n\\u25cb Confirmation: Reflexive response question. Affirmation with no promise of action\\n\\n\\u25cb Commitment: True agreement that leads to action\\n\\n\\u25cf Trigger a **No**: *Is* *now* *a* *bad* *time* *to* *talk?*\\n\\n\\u25cf Might sometimes need to **force** **counterpart** **into** **a** **no**\\n\\n\\u25cb Intentionally mislabel an emotion\\n\\n\\u25cb Ask a ridiculous question that can only be answered by a \\\"No\\\"\\n\\n**Email** **Magic**\\n\\n*Have* *you* *given* *up* *on* *this* *project? (When they go dark)*\\n\\n***That\\u2019s*** ***Right***\\n\\n\\u25cf Good: *That\\u2019s* *Right*\\n\\n\\u25cf Bad: *Yes,* *You\\u2019re* *Right*\\n\\n**Summary** to trigger *That\\u2019s* *Right*\\n\\nTrigger *That\\u2019s* *Right* with a **Summary:**\\n\\n1. Effective Pauses encourage the counterparty to keep talking\\n2. Minimal Encouragers: *Yes,* *OK,* *Uh-Huh,* *I* *see* \\u2192 show I\\u2019m paying full attention\\n3. Mirroring: Listen & repeat back\\n4. Labeling: Give feelings a name & identify with how they feel\\n5. Paraphrase: Repeat in my own words to show I\\u2019m really understanding\\n6. Summarize: Re-articulate meaning of what is said + acknowledgment of the emotions =\\n\\n**Paraphrase** \\\\+ **Labeling**\\n\\n**Never** **Split** **the** **Difference**\\n\\nLeads to a bad outcome for both sides, eg **1** **black +** **1** **brown** **shoe**\\n\\n**Deadlines**\\n\\n\\u25cf Deadlines make people do impulsive things\\n\\n\\u25cf Resist the urge to rush as a deadline approaches\\n\\n\\u25cf Take advantage of the rush in others\\n\\n\\u25cf Share my deadlines: information asymmetry is the worse for me\\n\\nThree uses of\\n\\n**Fair**\\n\\nDefensive move: *We* *just* *want* *what\\u2019s* *fair*\\n\\n\\u25cf Emotionally rattled negotiators will raise their counteroffer\\n\\n\\u25cf **Correct** **response:** *OK,* *I* *apologize.* *Let\\u2019s* *stop* *everything* *and* *go* *back* *to* *where* *I* *started* *treating* *you* *unfairly* *and* *we\\u2019ll* *fix* *it*\\n\\nNefarious accusation: *We\\u2019ve* *given* *you* *a* *fair* *offer*\\n\\n\\u25cf Jab meant to distract my attention\\n\\n\\u25cf **Correct** **response:** *Fair?* *It* *seems* *like* *you\\u2019re* *ready* *to* *provide* *the* *evidence* *that* *supports* *that.*\\n\\nPositive: *I* *want* *you* *to* *feel* *like* *you* *are* *being* *treated* *fairly* *at* *all* *times.* *So* *please* *stop* *me* *at* *any* *time* *if* *you* *feel* *I\\u2019m* *being* *unfair* *and* *we\\u2019ll* *address* *it*\\n\\n**Extreme** **Anchor**\\n\\nBend counterpart\\u2019s reality by anchoring the starting point\\n\\n1. Before making offer, emotionally anchor by saying how bad it will be\\n2. Set an **extreme** **anchor** to make my real number seem reasonable\\n3. Use a range to seem less aggressive\\n\\n**Loss** **Aversion**\\n\\n\\u25cf People will take more risks to avoid a loss than realize a gain\\n\\n\\u25cf Make sure my opponent sees there is something to lose by inaction\\n\\n**(Part 3)**\\n\\n**Bend their** **Reality**\\n\\n1. Anchor their emotions: Start with an accusation audit acknowledging all their fears. Anchor them **in** **preparation** **for** **a** **loss**\\n2. Let the other party suggest a price first. Especially if neither party knows true market value. Consider alternatives if other party is a shark or a rookie\\n3. Establish a bolstering range: Recall a similar deal. Range high so people will naturally want to satisfy the low end of my range\\n4. Pivot to non-monetary terms: Give things that are not important. Get things that are. Suggest ideas to stimulate brainstorming\\n5. Use odd numbers: Don\\u2019t use round numbers\\n6. Surprise with a gift: Generate reciprocity by giving unrelated surprise gifts\\n\\n**Calibrated** **Questions**\\n\\n\\u25cf The **listener** has control of the conversation\\n\\n\\u25cf Goal is to **suspend** **unbelief** \\u2192 calibrated questions to ask for help\\n\\n\\u25cf Don\\u2019t use: *Can,* *Is,* *Are,* *Do* *Does*\\n\\n\\u25cf Avoid: questions that can be answered with *Yes* or tiny pieces of information\\n\\n\\u25cf Start every question with ***what***, ***how*** (& sometimes but rarely ***why***)\\n\\n\\u25cb Only use ***why*** when defensiveness it creates is in my favor: *Why* *would* *you* *ever* *change* *from* *the* *way* *you\\u2019ve* *always* *done* *things* *and* *try* *my* *approach?*\\n\\n\\u25cf *You* *can\\u2019t* *leave* *\\u2192* *What* *do* *you* *hope* *to* *achieve* *by* *doing?*\\n\\n\\u25cf Avoid angry emotional reactions\\n\\n**Phrases** **to** **use**\\n\\n\\u25cf ***What*** ***makes*** ***you*** ***ask?***\\n\\n\\u25cf ***What*** ***about*** ***is*** ***important*** ***to*** ***you?***\\n\\n\\u25cf *How* *can* *I* *help* *make* *this* *better* *for* *us?*\\n\\n\\u25cf *How* *would* *you* *like* *me* *to* *proceed?*\\n\\n\\u25cf *What* *is* *it* *that* *brought* *us* *into* *this* *situation?*\\n\\n\\u25cf *How* *can* *we* *solve* *the* *problem?*\\n\\n\\u25cf *What\\u2019s* *the* *objective* */* *What* *are* *we* *trying* *to* *accomplish* *here?*\\n\\n\\u25cf ***How*** ***am*** ***I*** ***supposed*** ***to*** ***do*** ***that?***\\n\\n**How**\\n\\n\\u25cf *Yes,* is nothing without ***How***\\n\\n\\u25cf Calibrated ***how?*** **Questions** help guarantee execution\\n\\n\\u25cf Look for *That\\u2019s* *Right*\\n\\n\\u25cf Don\\u2019t settle for *I\\u2019ll* *try,* *You\\u2019re* *Right* *\\u2192* Those mean ***I*** ***plan*** ***to*** ***fail***\\n\\n**Phrases** **to** **use**\\n\\n\\u25cf ***How*** ***am*** ***I*** ***supposed*** ***to*** ***do*** ***that?***\\n\\n\\u25cf *How* *will* *we* *know* *we\\u2019re* *on* *track?*\\n\\n\\u25cf *How will* *we* *address* *things if* *we* *find* *we\\u2019re off* *track?*\\n\\n**Influence** **those** **behind** **the** **table**\\n\\n\\u25cf *How* *does* *this* *affect* *the* *rest* *of* *your* *team?*\\n\\n\\u25cf *How* *on* *board* *are* *the* *people* *not* *on* *this* *call?*\\n\\n\\u25cf *What* *do* *your* *colleagues* *see* *as* *their* *main* *challenges* *in* *this* *area?*\\n\\n**7-38-55% Rule**\\n\\n7% content 38% tone of voice 55% body language & face\\n\\n\\u25cf Fly great distances to meet people **in** **person**\\n\\n\\u25cf Pay close attention to **tone** & **body** **language**. See if they don\\u2019t match up with literal meaning of words\\n\\n\\u25cf Use labels to discover source of the incongruence:\\n\\n\\u25cb *I* *heard* *you* *say* *\\u2018Yes\\u2019* *but* *it* *seemed* *like* *there* *was* *a* *hesitation* *in* *your* *voice*\\n\\n\\u25cb *No,* *this* *is* *important.* *Let\\u2019s* *make* *sure* *we* *get* *this* *right*\\n\\n**(Part4)**\\n\\n**Rule** **of** **Three**\\n\\nGet them to say **yes** **3** **times**\\n\\n1. Get them to give me a commitment\\n2. Label + summarize \\u2192 get a *That\\u2019s* *Right*\\n3. Calibrated *How* or *What* questions about implementation. Ask what will constitute success:\\n\\n*What* *do* *we* *do* *if* *we* *get* *off* *track?*\\n\\n**Spotting** **Liars**\\n\\nLiars...\\n\\n\\u25cf Use more words than truth tellers\\n\\n\\u25cf Talk about   *him,* *her,* *it,* *one,* *they,* and *their.* Rarely *I* \\u2192 distance   from the lie\\n\\n\\u25cf Speak in more complex sentences (to cover up the lie)\\n\\n**Spot** **Decision** **Makers**\\n\\nWatch pronouns\\n\\n\\u25cf *I,* *me,* *my* \\u2192 less important in the decision of the outcome\\n\\n\\u25cf *We,* *they,* *them* \\u2192 actual   decision maker leaving options open\\n\\n**Use** **my** **own** **name**\\n\\n\\u25cf   *My* *name* *is(* *insert) your nam*\\n\\n\\u25cf   *What\\u2019s* *the (Insert Name)* *discount?*\\n\\n**Saying** ***No*** **4** **times**\\n\\n*1.* *How* *am I* *supposed to do* *that?*\\n\\n*2.* *Your* *offer* *is* *very* *generous.* *I\\u2019m* *sorry* *that* *just* *doesn\\u2019t* *work* *for* *me* *3.*  *I\\u2019m* *sorry* *but* *I\\u2019m* *afraid* *I* *just* *can\\u2019t* *do* *that*\\n\\n*4.*  *I\\u2019m* *sorry,* *no*\\n\\nUse mirroring and open-ended questions in between. Empathize 3x:\\n\\n\\u25cf   *That\\u2019s* *very* *generous* *of* *you*\\n\\n\\u25cf   *That* *price* *is* *more* *than* *fair*\\n\\n\\u25cf   *Thank* *you* *for* *taking* *the* *time* *to* *talk* *to* *me*\\n\\n**Types of** **Negotiators**\\n\\n**Analyst** (e.g. Ryan) \\u25cf  Doesn\\u2019t like calibrated questions\\n\\n**Acquiring** **facts** **&** **info** \\\\> making a deal \\u25cf Apologies have little value Time = Preparation \\u25cf Hypersensitive to reciprocity\\n\\nSilence = Opportunity to think **\\u25cb** Get gift first = it must be a trap\\n\\n\\u25cf Methodical & diligent. Hates surprises. \\u25cb  Give first = you must reciprocate\\n\\n\\u25cf Self-imaged tied to minimizing mistakes **\\u25cf**  Tools: **labels**, specifically to compare\\n\\n\\u25cf Prefers to work on their own analysis,\\n\\n\\u25cf Reserved problem solver \\u25cf Use data\\n\\n\\u25cf Information aggregator \\u25cb Use data to drive my reason, no ad-lib\\n\\n\\u25cf Skeptical by nature \\u25cb Use data comparisons to disagree\\n\\n\\u25cf May appear to agree when just agreeing to  **\\u25cf**  Worst-type match: Assertive think about it\\n\\n**Accommodator** (e.g. Chase) \\u25cf  Watch tone & body language \\u2192 hesitancy\\n\\n**Building** **relationship** \\\\> making a deal won\\u2019t come in words\\n\\nTime = Relationship \\u25cf  Risk: may overpromise, agree to give you Silence = Anger something they can\\u2019t actually deliver\\n\\n\\u25cf Communicating \\u2192 happy **\\u25cf** Tools\\\\*\\\\*:\\\\*\\\\* What & How **calibrated** **questions**\\n\\n\\u25cf Sociable, peace-seeking, optimistic, focused on implementation distractible, poor time managers **\\u25cf**  Worst-type match: Accommodator\\n\\n**Assertive** (e.g. me, Merci) \\u25cf  Focus first on what they have to say. Once\\n\\n**Being** **heard** \\\\> making a deal they are convinced I understand them,\\n\\nTime = Money only then will they listen\\n\\nSilence = Opportunity to speak more \\u25cf  Tools: **calibrated** **questions,** **labels,** and\\n\\n\\u25cf Getting solution perfect is less important **summaries**. Get a *that\\u2019s* *right*\\n\\nthan getting it done \\u25cf Be careful with reciprocity (give an inch \\u2192\\n\\n\\u25cf Loves winning above all else take a mile)\\n\\n\\u25cf Most likely to get tunnel-vision. Focus on \\u25cf  Worst match\\\\*\\\\*:\\\\*\\\\*  Analyst goal \\u2192 miss opportunities to explore\\n\\nEmotions = bad\\n\\n\\u25cf Negotiation = intellectual sparring\\n\\n**Deflect** **the** **Punch**\\n\\nCounterparty will start with an extreme anchor. Get ready to deflect the punch\\n\\n\\u25cf By saying \\u201cno\\u201d : *How* *am* *I* *supposed* *to* *do* *that?*\\n\\n\\u25cf By deflecting the anchor: *What* *are* *we* *trying* *to* *accomplish* *here?*\\n\\n\\u25cf Pivot to terms: detour to non-monetary issues:\\n\\n\\u25cb   *Let\\u2019s* *put* *price* *off* *to* *the* *side* *for* *a* *moment* *&* *talk* *about* *what* *would* *make* *this* *a* *good* *deal?*\\n\\n\\u25cb   What else would you be able to offer to make that a good price for me?\\n\\n\\u25cf Respond with your own extreme anchor\\n\\n**Strategic** **Umbrage**\\n\\n*I* *don\\u2019t* *see* *how* *that* *would* *ever* *work*\\n\\n**\\u201cI\\u201d** **Statements**\\n\\n*I* *feel* *when* *you* *because....*\\n\\n**Part 5**\\n\\n**Ackerman** **Bargaining**\\n\\n1. Set target price\\n2. Plan your offers\\n\\n\\u25cb Buyer: **65%** \\u2192 85% \\u2192 95% \\u2192 100%\\n\\n\\u25cb Seller: **135%** \\u2192 115% \\u2192 105% \\u2192 100%.\\n\\n3. At final offer add **non-monetary** **item** to show that I\\u2019m at my limit\\n\\n\\u25cf Use an **Accusations** **Audit** to pre-empt the first offer to take the edge off\\n\\n\\u25cb  *You\\u2019re* *going* *to* *think* *I* *haven\\u2019t* *done* *my* *homework*\\n\\n\\u25cb  *You\\u2019re* *going* *to* *feel* *insulted* *by* *my* *offer*\\n\\n\\u25cb  *I\\u2019m* *embarrassed* *to* *tell* *you* *my* *offer*\\n\\n\\u25cf Use lots of empathy and ways of saying *No* in between to get other to counter before I increase my offer\\n\\n\\u25cf Use precise, non-round, odd numbers\\n\\n**Black** **Swans**\\n\\n\\u25cf 3 Black Swans in every negotiation\\n\\n\\u25cf Every negotiation is new \\u2192 don\\u2019t let old patterns blind me\\n\\n\\u25cf Always ask yourself: **Why** **are** **they** **communicating** **what** **they** **are** **communicating** **right** **now**\\n\\n**3 Types   of** **Leverage**\\n\\nPositive Leverage: I have something they want\\n\\nNegative Leverage: My ability to make my counterpart suffer\\n\\n\\u25cf More powerful because of **loss** **aversion**\\n\\n\\u25cf To use, first find what is important to them:\\n\\n\\u25cb Who is their audience?\\n\\n\\u25cb What signifies status and reputation to them?\\n\\n\\u25cb What most worries them?\\n\\n\\u25cf Identify with labels: *It* *seems* *you* *strongly* *value* *the* *fact* *that* *you\\u2019ve* *always* *been* *paid* *on* *time*\\n\\nNormative Leverage: Using the other party\\u2019s norms to advance my position\\n\\n\\u25cf Show inconsistencies between their beliefs and their actions\\n\\n\\u25cf No one likes to look like a hypocrite\\n\\n\\u25cf **To** **discover** **norms**: Ask what my counterpart believes in and listen openly\\n\\n\\u25cf See what language they speak and speak it back to them\\n\\n**Listen,** **Listen,** **Listen**\\n\\n\\u25cf Review everything, you hear. **Double** **check**\\n\\n\\u25cf Use **backup** **listeners** whose only job is to listen between the lines\\n\\n\\u25cf Compare notes with team members to discover new information\\n\\n**Similarity** **Principle**\\n\\n\\u25cf People trust those who are in their group\\n\\n\\u25cf Look at and mirror attitudes, beliefs, ideas, and even modes of dress\\n\\n**Power** **of** **hopes** **&** **dreams**\\n\\n\\u25cf Visualize what counterpart wants out of life \\u2192 use those aspirations to get them to follow\\n\\n\\u25cf Everyone wants to believe that we are capable of the extraordinary\\n\\n\\u25cf Display a passion for **what** **my** **counterpart** **has** **always** **wanted** and **convey** **a** **purposeful**\\n\\n**plan** **on** **how** **to** **get** **there** \\u2192 changes my counterpart\\u2019s perception of what is possible to change\\n\\n\\u25cf We are all **hungry** **for** **a** **map** **to** **joy** \\u2192 be courageous enough to draw it and others will follow\\n\\n**\\u2026** ***Because*** **...**\\n\\nPeople respond favorably to requests made in a reasonable tone of voice and followed by a\\n\\n*because* reason (even if the reason isn\\u2019t great)\\n\\n**Not** **crazy**\\n\\nPeople acting crazy are often not. Instead, counterpart:\\n\\n\\u25cf is **Ill** **Informed**: has incomplete or different information to me\\n\\n\\u25cf is **Constrained**: may not have power to close the deal\\n\\n\\u25cf has **Other** **Interests**: hidden interests that justify his behavior\\n\\n**(Part 6)**\\n\\n**Get** **Face** **Time**\\n\\n\\u25cf Get face time\\n\\n\\u25cf Observe **unguarded** **moments**\\n\\n\\u25cb First few minutes before you get down to business\\n\\n\\u25cb Last few moments as everyone is leaving\\n\\n\\u25cb Interruptions, odd exchanges, etc\\u2026\\n\\n\\u25cf When something doesn\\u2019t make sense, **there\\u2019s** **an** **opportunity**. Dig in!\\n\\n**Negotiation** **One-Sheet**\\n\\n\\u25cf The Goal: specific scenario that represents best case\\n\\n\\u25cb Set optimistic but reasonable goal & define it clearly\\n\\n\\u25cb Write it down\\n\\n\\u25cb Discuss my goal with a colleague (commitment & consistency)\\n\\n\\u25cb Carry the written goal into the negotiation\\n\\n\\u25cf Summary: Couple of sentences about the known facts that have led up to the negotiation. Aim for *That\\u2019s* *Right* in response\\n\\n\\u25cf Labels / Accusation Audit: 3-5 labels to perform an accusation audit\\n\\n\\u25cb   *It* *seems* *like* *is* *valuable* *to* *you*\\n\\n\\u25cb   *It* *seems* *like* *you* *don\\u2019t* *like*    *.*\\n\\n\\u25cb   *It* *seems* *like* *you* *value* *.*\\n\\n\\u25cb   *It* *seems* *like*    *makes* *it* *easier.*\\n\\n\\u25cb   *It* *seems* *like* *you\\u2019re* *reluctant* *to*    *.*\\n\\n\\u25cf Calibrated questions: 3-5 to reveal value & overcome potential deal killers\\n\\n\\u25cb For my counterpart:\\n\\n\\u25a0   *What* *are* *we* *trying* *to* *accomplish?*\\n\\n\\u25a0   *How* *is* *that* *worthwhile?*\\n\\n\\u25a0   *What\\u2019s* *the* *core* *issue* *here?*\\n\\n\\u25a0   *How* *does* *that* *affect* *things?*\\n\\n\\u25a0   *How* *does* *this* *fit* *into* *what* *the* *objective* *is?*\\n\\n\\u25cb To identify behind-the-table deal killers\\n\\n\\u25a0   *How* *does* *this* *affect* *the* *rest* *of* *your* *team?*\\n\\n\\u25a0   *How* *on* *board* *are* *the* *people* *not* *on* *this* *call?*\\n\\n\\u25a0   *What* *do* *your* *colleagues* *see* *as* *their* *main* *challenges* *in* *this* *area?*\\n\\n\\u25cb To identify and diffuse deal-killing issues\\n\\n\\u25a0   *What* *are* *we* *up* *against* *here?*\\n\\n\\u25a0   *What* *is* *the* *biggest* *challenge* *you* *face?*\\n\\n\\u25a0   *How* *does* *making* *a* *deal* *with* *us* *affect* *things?*\\n\\n\\u25a0   *What* *happens* *if* *you* *do* *nothing?*\\n\\n\\u25a0   *What* *does* *doing* *nothing* *cost* *you?*\\n\\n\\u25a0   *How* *does* *making* *this* *deal* *resonate* *with* *what* *your* *company* *prides* *itself* *on?*\\n\\n\\u25cb **Follow** **up** **with** **labels** to their answers to the calibrated questions:\\n\\n\\u25a0   *It* *seems (blank)* *is* *important.*\\n\\n\\u25a0   *It* *seems* *you* *feel* *like* *my* *company* *is* *in* *a* *unique* *position* *to (insert value)* *.*\\n\\n\\u25a0   *It seems* *you are* *worried that (insert pain/challenge)* *.*\\n\\n\\u25cf Non-cash offers: list of non-cash items possessed by my counterpart that would be valuable?\\n\\n\\u25cb What could they give me that would make me do this for free?\\n\\n**Bonus**\\n\\n**Call to You**\\n\\n\\u25cf (They call you) How are you-\\u201cIt sounds like you have a place you would like to start?\\u201d\\n\\n **Not Doing (taking action)**\\n\\n\\u25cf It sounds like you have a reason for (insert not doing or alternative)\\n\\n**Useless -   Yes      Transformative   - No**\\n\\n* \\u201cDo you agree?\\u201d **instead** \\u201cDo you disagree\\u201d\\n* \\u201cDoes this work for you?\\u201d  **instead** \\u201cIs this a bad idea?\\u201d\\n* \\u201cDoes this   make sense?\\u201d  **instead** \\u201cIs this a ridiculous idea?\\u201d\\n* \\u201cWould you like to ... ?\\u201d   **instead** \\u201cAre you against ... ?\\u201d\\n* \\u201cWould you  still like to ... \\u201d  **instead**  \\u201cHave you given up on ... ?\\u201d\\n* \\u201cIs this   correct?\\u201d instead \\u201cAm   I out of line?\\u201d\\n\\n&#x200B;\"", "title": "Never Split The Difference- Cliff Notes (6 Parts)", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/sales/comments/11pgjk1/never_split_the_difference_cliff_notes_6_parts/"}, {"author": "22gma", "created_utc": 1609696744.0, "link_flair_template_id": "71af4a56-ccf8-11e5-9ace-0e55464bea03", "link_flair_text": "Off-Topic", "num_comments": 52, "post_id": "kpp84c", "score": 481, "subreddit": "sales", "text": "\"On what I assume will be the first day back for many, if not most of us here, just wanted to send a quick note to say good luck to you all! Hoping you all get the successes you\\u2019re after this year!\"", "title": "Good luck tomorrow", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/sales/comments/kpp84c/good_luck_tomorrow/"}, {"author": "heroic_peter", "created_utc": 1699628255.0, "link_flair_template_id": "5d7b6946-0047-11e3-ab17-12313b0cf20e", "link_flair_text": "Sales Topic General Discussion", "num_comments": 428, "post_id": "17s5qee", "score": 481, "subreddit": "sales", "text": "\"I'm a dude. I'm in my early 40s, have been in enterprise tech sales for 20 years, and I've recently been working with new teams and partners and attending conferences I have not attended before.\\n\\nI've been around some sales guys that were assholes. And I know that some guys can be sexist pigs. But recently I've been around some real shitheads.\\n\\nMost of them are Boomers. And I don't know if it's because I'm \\\"one of the guys,\\\" and so they think they can be open around me, or what, but I've heard some truly awful shit.\\n\\nThese guys will talk about women's bodies, make sure every guy in the group sees the hot girl at the booth, openly talk about cheating on their wives, and tell stories of affairs with coworkers, clients, or competitors.\\n\\nOne group of guys was recently telling me which strip clubs in a particular town have dancers that also hook. These guys are married and have children. They work for companies whose values are \\\"Integrity\\\" or \\\"Tranparency.\\\"\\n\\nThey are also often the same guys that don't care about the success of the customer, only the sale. They want to close the deal, get the commission, fuck the secretary, and then move on to the next deal.\\n\\nI've started calling out the bullshit. A sales leader recently tried to have me scope out hot college girls with him at lunch, and I told him I wasn't like that, that I was happily married, and that I wasn't interested in looking at girls or talking like that. He looked at me like I had three heads. But I just ignored it and started talking about work stuff and sports.\\n\\nAnyway, I don't know what the point of this post is. Just bitching, I guess. I have a wife and a daughter, and to know that old dudes out there ogle over their bodies in public grosses me out and pisses me off. I don't want to work with guys that are like that. \\n\\nBe better, guys. And if you work with dudes that are like this, call them out on the bullshit. \\n\\n&#x200B;\"", "title": "A Lot of Sales Guys are Sexist Assholes", "upvote_ratio": 0.77, "url": "https://www.reddit.com/r/sales/comments/17s5qee/a_lot_of_sales_guys_are_sexist_assholes/"}, {"author": "None", "created_utc": 1565226123.0, "link_flair_template_id": "bdab74fe-cd00-11e5-a1b1-0ee60891a65b", "link_flair_text": "Career", "num_comments": 81, "post_id": "cneghp", "score": 482, "subreddit": "sales", "text": "\"Really nobody to tell. Shame, but people are weird when you get successful. For almost 20 years I've busted my ass in sales, been told no tens of thousands of times, managed assholes, worked for assholes, spent countless nights on the road, failed a few (hundred) times...and today I finally made VP of Sales for a healthcare company. \\n\\nSo I'm celebrating, but I wanted to share with any of y'all still in the grind. It never gets easier but it gets more rewarding if you push on.  Don't be afraid to fail, never stop learning, and always go on that next call. \\n\\nNow back to my cocktail!  Here if any of you need help.  \\n\\nCheers y'all!\"", "title": "Just got promoted!", "upvote_ratio": 0.99, "url": "https://www.reddit.com/r/sales/comments/cneghp/just_got_promoted/"}, {"author": "KillerBurger69", "created_utc": 1665768753.0, "link_flair_template_id": "71af4a56-ccf8-11e5-9ace-0e55464bea03", "link_flair_text": "Off-Topic", "num_comments": 96, "post_id": "y403mn", "score": 478, "subreddit": "sales", "text": "\"Thanks for attending my Ted talk\"", "title": "I feel like I shouldn’t have to say this but I will - Quit making tik-tok videos about your life in tech sales. Trust me no one gives a fuck, and you look like a cringy douche", "upvote_ratio": 0.94, "url": "https://www.reddit.com/r/sales/comments/y403mn/i_feel_like_i_shouldnt_have_to_say_this_but_i/"}]