[{"author": "SecurityAdditional17", "created_utc": 1686950495.0, "link_flair_template_id": "fe0a214e-146a-11e9-893d-0e90c126802c", "link_flair_text": "Teacher Support &/or Advice", "num_comments": 2039, "post_id": "14b8h2r", "score": 43206, "subreddit": "teachers", "text": "\"I don\\u2019t want to post this on my fb and look like an a@@hole seeking attention. But I need to process and unload with people who understand. I was out with my college age daughter today and had to stop at dr office that happens to be in a horrible part of town. She wants Starbucks but then remembers the dive burger place nearby. I jokingly told her, \\u201csure let\\u2019s get a burger and maybe shot today. I\\u2019m game!\\u201d And that is where some divine intervention happened. We go in and there is a homeless man that was so pitiful looking and smelling. Took my breath away. I also got that energy that something bad may go down. Then I\\u2019m telling myself to stop. But he was strung out on something. He keeps trying to get my attention. He finally makes eye contact and I said hi to him. Then\\u2026 he says to me \\u201cyou were my teacher, do you remember me?\\u201d I did! Couldn\\u2019t remember name because I\\u2019m 54 and been at this for over 3 decades. I had him in first grade and my daughter was one year ahead at same school. So we talk and bless him he was struggling. He is homeless and just got out of drug and mental rehab. At this point I\\u2019m just sick to my stomach. He walks outside and I ask the workers if he was causing any issues and if he had eaten. No, to both. So I go outside and ask him if I could buy his lunch. Next thing you know he is showing me his belongings and that is all he had. Sadly, some drugs were given to him by someone. He showed me he had no tracks on arms and I saw no needles. I went into teacher/mom mode and he told me what the pill number was. I told him he can\\u2019t be using meds someone on Street gave him. He showed me other things he had dug from trash cans. I then talked to him about a contact I have with homeless services in town. But he said he would rather be on streets. That\\u2019s when it hit me he was truly on something. I also found a kit that someone from an agency gave him to clean himself. I really just wanted to fix him right there but knew this is way bigger than the bandaid I had. So I took him inside the place and ordered him a meal and told him he had to be nice and respectful to everyone there. He thanked me over and over and then hugged me. I told him to be safe and take care of himself and find a safe place on the streets to sleep. I also told him to consider a shelter. When I walked away, kids sitting at another table asked who I was. As I was getting in my car I look up and he says, \\u201cthat was my first grade teacher.\\u201d He also had a huge smile on his face. I waved to him and told my daughter I was going to lose it when we pulled away. I ended up driving around the block a couple of times. My daughter said I did everything I could for him and not to feel guilty. But damn, he is only 19 and has been homeless awhile. It just sucks he was born into a shitty environment and was not able to climb out of it. But I always tell my kids on the last day of school they will always be one of my kids. So today, he is still my kid. And I got his belly full and he smiled. Hopefully when he lays down tonight he remembers I still care. Now I\\u2019m crying and just wish I could have done more. Thank you for letting me get this off my chest.\"", "title": "My heart broke today running into a former student", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/Teachers/comments/14b8h2r/my_heart_broke_today_running_into_a_former_student/"}, {"author": "None", "created_utc": 1708635772.0, "link_flair_template_id": "71f2aa60-b428-11ee-8f12-fa0f499e77d1", "link_flair_text": "Just Smile and Nod Y'all.  ", "num_comments": 6212, "post_id": "1axhne2", "score": 31879, "subreddit": "teachers", "text": "\"There was a teacher who went viral on TikTok when he stated that his 12-13 year old students do not know their shapes. It's horrifying but it does not surprise me.\\n\\nI teach high school. Age range 15-18 years old. I have seen students who can't do the following:\\n\\n* Read at grade level. Some come into my classroom at a 3rd/4th grade reading level. There are some students who cannot sound out words.\\n* Write a complete sentence. They don't capitalize the first letter of the sentence or the I's. They also don't add punctuation. I have seen a student write one whole page essay without a period.\\n* Spell simple words.\\n* Add or subtract double-digits. For example, they can't solve 27-13 in their head. They also cannot do it on paper. They need a calculator.\\n* Know their multiplication tables.\\n* Round\\n* Graph\\n* Understand the concept of negative.\\n* Understand percentages.\\n* Solve one-step variable equations. For example, if I tell them \\\"2x = 8. Solve for x,\\\" they can't solve it. They would subtract by 2 on both sides instead of dividing by 2.\\n* Take notes.\\n* Follow an example. They have a hard time transferring the patterns that they see in an example to a new problem.\\n* No research skills. The phrases they use to google are too vague when they search for information. For example, if I ask them to research the 5 types of chemical reactions, they only type in \\\"reactions\\\" in Google. When I explain that Google cannot read minds and they have to be very specific with their wording, they just stare at me confused. But even if their search phrases are good, they do not click on the links. They just read the excerpt Google provided them. If the answer is not in the excerpts, they give up.\\n* Just because they know how to use their phones does not mean they know how to use a computer. They are not familiar with common keyboard shortcuts. They also cannot type properly. Some students type using their index fingers.\\n\\nThese are just some things I can name at the top of my head. I'm sure there are a few that I missed here.\\n\\nNow, as a teacher, I try my best to fill in the gaps. **But I want the general public to understand that when the gap list is this big, it is nearly impossible to teach my curriculum efficiently.** This is part of the reason why teachers are quitting in droves. You ask teachers to do the impossible and then vilify them for not achieving it. You cannot expect us to teach our curriculum efficiently when students are grade levels behind. Without a good foundation, students cannot learn more complex concepts. I thought this was common sense, but I guess it is not (based on admin's expectations and school policies).\\n\\n***I want to add that there are high-performing students out there. However, from my experience, the gap between the \\\"gifted/honors\\\" population and the \\\"general\\\" population has widened significantly. Either you have students that perform exceptionally well or you have students coming into class grade levels behind. There are rarely students who are in between.***\\n\\nAre other teachers in the same boat?\"", "title": "The public needs to know the ugly truth. Students are SIGNIFICANTLY behind.", "upvote_ratio": 0.94, "url": "https://www.reddit.com/r/Teachers/comments/1axhne2/the_public_needs_to_know_the_ugly_truth_students/"}, {"author": "AndrysThorngage", "created_utc": 1702674638.0, "link_flair_template_id": "38a0f088-6a9a-11e8-ab9f-0e30a2dff32a", "link_flair_text": "SUCCESS!", "num_comments": 1159, "post_id": "18jadql", "score": 29445, "subreddit": "teachers", "text": "\"I've noticed students saying \\\"penis\\\" in the hallway, but it hadn't happened in my classroom until today. If you don't know, the penis game is basically a dare about who can penis the loudest.\\n\\nWhen it happened in my class today, rather than being shocked or angry, I laughed and told them how that was a thing when I was in middle school as well. I told a story about a boy in my friend group and how he incorporated the word into a speech on a dare. \\n\\nOf course, now it's deeply uncool and they stopped.\\n\\nEdit: Hey, I figured out editing! I meant SAY penis, but my mistake was more fun. I\\u2019m also glad we all got to bond over our memories of this silly game. I guess we weren\\u2019t so different from these kids! My apologies to my 7th grade English teacher.\"", "title": "I ruined the \"penis\" game.", "upvote_ratio": 0.94, "url": "https://www.reddit.com/r/Teachers/comments/18jadql/i_ruined_the_penis_game/"}, {"author": "blindside-wombat68", "created_utc": 1693001970.0, "link_flair_template_id": "fe0a214e-146a-11e9-893d-0e90c126802c", "link_flair_text": "Teacher Support &/or Advice", "num_comments": 2795, "post_id": "161d3cl", "score": 28404, "subreddit": "teachers", "text": "\"Last period of the day today I found out a group of female students pulled up another girl's shirt, threw her bookbag in the trash, and started spreading rumors about her to the other classes. The girl ran out of my class in tears before another teacher ran into the bathroom to comfort.  When the teacher exited I was informed of the events that happened, and as I was walking into my classroom I said \\\"that ain't gonna fuckin happen in my class\\\".\\n\\n As I talked to my students I informed them of the dangers of bullying, and the consequences of their actions. I did not name any of the bullies by name, but you could tell they knew. \\n\\nI know it was unprofessional of me, but that kind of stuff makes my blood boil. I'm just wondering how screwed I am.\\n\\n I work at a small private school, but a lot of our students come from disadvantaged backgrounds. Any advice y'all could give would be really helpful. \\n\\nThe administration is aware of the students actions and I have not heard of any consequences yet.\\n\\nEdit: thank you to everyone who took the time to comment. For every one person who said I didn't do enough, that I was a bitch for questioning if what I did was right, or that I shouldn't be a teacher there were hundreds of others saying I was justified given the situation. To all the people who reached out and shared your stories of bullying know that I am here for you. Thanks to everyone who offered advice I appreciate all of you.\"", "title": "Lost my cool and said \"fuck\" in front of my students.", "upvote_ratio": 0.92, "url": "https://www.reddit.com/r/Teachers/comments/161d3cl/lost_my_cool_and_said_fuck_in_front_of_my_students/"}, {"author": "adult_in_training_", "created_utc": 1596878412.0, "link_flair_template_id": "4433b45a-146b-11e9-a469-0ee696cc69a0", "link_flair_text": "Policy & Politics", "num_comments": 1462, "post_id": "i5wac7", "score": 20917, "subreddit": "teachers", "text": "\"Let me preface by saying, I am a black, pansexual woman. Let me tell you,my school life SUCKED. \\n\\nI live in a predominantly white area outside of Cincinnati that has a 3% black population. I was bullied A LOT at school. I actually had to switch schools at one point because it got so bad. Someone put a noose in my cubby. Then, in high school, I cut off my hair and went natural (no relaxers) which was a big decision for me. Well apparently it was \\\"distracting\\\". When I was in the theater program, they only had 1 set of stage makeup for black people... 3 tones too dark for my skin (to put it in perspective, there were 10 total options. The next darkest was probably meant for latinx people).\\n\\nIt was middle school/high school when I realized I wasn't straight. I was scared shitless. My parents told me to tell noone because I live in a fairly conservative town. When I got crushes on people who weren't men I was terrified and felt ashamed. Teachers blatantly told me same-sex marriage was bad.\\n\\nNow,as I start my first year on Monday, I realize I want to be the teacher I needed. When we went to school to become an educator, we learned that students need to feel safe in order to learn effectively. A student worrying about their parent getting deported, getting beat up for their sexual orientation, being catcalled in the street or being killed by police does NOT feel safe. If you think ANY human is lesser based on who they are and their experiences, you should not be educating and influencing the next generation. Period. \\n\\nSorry but I needed that to be said. It has been on my mind this weekend since I'm starting Monday.\\n\\nEDIT: Another redditor summarized what I was trying to say in perfect words. I hope this clears some confusion!\\n\\n\\\"I feel like what you're saying is that you should treat every human being with respect and not impose beliefs on your students. Teach facts and multiple reasonable perspectives on different topics. I'm sure \\\"reasonable\\\" is up for interpretation though.\\\"\"", "title": "(Potentially) Unpopular Opinion. If you are ant-BLM, anti-LGBT, sexist, anti-immigrant, anti-science, etc. You need to leave teaching. PERIOD", "upvote_ratio": 0.7, "url": "https://www.reddit.com/r/Teachers/comments/i5wac7/potentially_unpopular_opinion_if_you_are_antblm/"}, {"author": "geddy_girl", "created_utc": 1653909541.0, "link_flair_template_id": "4433b45a-146b-11e9-a469-0ee696cc69a0", "link_flair_text": "Policy & Politics", "num_comments": 874, "post_id": "v0xz61", "score": 18588, "subreddit": "teachers", "text": "\"1. Yes, my students are very important to me. No, I should not be expected to take a bullet for your kid, nor am I willing to kill what usually ends up being another student in the event of a school shooting scenario.This does not make me a bad teacher, nor does it mean I'm a crappy, selfish human being.\\n\\n2. I did not sign up for what you're proposing. I have my own family and my own child to come home to, and yes, I definitely love them more than your student.\\n\\n3. You seem unaware of the constant time and training RESPONSIBLE and EFFECTIVE law enforcement officers put in to make sure their skills are up to par and they will hit what they're trying to hit instead of an innocent when/if the time comes. I already work 10+ unpaid off-hours per week for my students; I'm not about to be saddled with yet another responsibility.\\n\\n4. If I shoot and miss, I'm liable. If a shooting happens and I don't react by using my gun against the assailant, I'm liable. I'm not protected from liability for failure to act like police are. I will be blamed for whatever ends up happening because I didn't \\\"do my duty.\\\" \\n\\n5. The political party the majority of you seem to support doesn't even trust me to assign appropriate books to your student or teach the inconvenient truths of history to your student. But you have the audacity to trust me with a firearm around them?\\n\\n\\\"Arm the teachers\\\" is a way for lawmakers and ammo-sexuals to pass the buck. We will not become your scapegoats for yet another issue.\\n\\nSigned,\\nA high school English teacher who's fed up with hearing this bullshit\"", "title": "An open letter to all the people crying \"Arm the teachers\"", "upvote_ratio": 0.91, "url": "https://www.reddit.com/r/Teachers/comments/v0xz61/an_open_letter_to_all_the_people_crying_arm_the/"}, {"author": "Toanume", "created_utc": 1708224391.0, "link_flair_template_id": "71f2aa60-b428-11ee-8f12-fa0f499e77d1", "link_flair_text": "Just Smile and Nod Y'all.  ", "num_comments": 470, "post_id": "1atjopt", "score": 18201, "subreddit": "teachers", "text": "\"I retired from teaching this year. And I never told anyone because I would have gotten reprimanded, and I didn't want my staff who would have supported me to talk me out of it or get in trouble for helping me.\\n\\nOn to the story: I helped a mother escape her abusive husband. I was legitimately afraid he would kill her. I helped her plan everything, including disappearing for a year. I told her how to pack clothes, not to put a go-bag out, but to know where everything was.  I helped her find a school for her son. And told her to tell them not to request school records that year because I didn't want a paper trail that would lead to her. I helped with money. She found an apartment and had it ready to go when the opportunity rose for her to get out.\\n\\nI told her not to tell anyone, so when she left and her husband turned up looking for her, they could act with genuine surprise. Her parents and sister were told she was going to leave, but not when or where she was going. He would come in the mornings and after school and park, looking for her and her son.\\n\\nShe made it out safely, and after a year and half came out of hiding. When her son was about to graduate high school, several years later, he came to visit me with a friend. It's weird how I just knew it was him. We hugged for a long time. We didn't say much. I heard him tell his friend, that's her as he approached. I never saw him again after that. But that was the highlight of my teaching career. Yes, I got too involved. I took a big risk; I know my school board would have told me to stay out of it ...  It wasn't the first time or last time, I got too involved, but it's something I'm happy I did. I guess it's safe to tell the teachers I worked with back then (still friends). They were great and had been protecting him before he was in my class. But I didn't want anyone to tell me not to get involved, so I just kept in on the down-low.\\n\\nAnyone else got a secret to share?\"", "title": "I kept a secret for 30 years.", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/Teachers/comments/1atjopt/i_kept_a_secret_for_30_years/"}, {"author": "Diligent-Astronaut38", "created_utc": 1682623432.0, "link_flair_template_id": "4433b45a-146b-11e9-a469-0ee696cc69a0", "link_flair_text": "Policy & Politics", "num_comments": 1373, "post_id": "13137t5", "score": 18117, "subreddit": "teachers", "text": "\"During my lunch break last week, a student knocked on my door begging to be escorted through the cafeteria because she was afraid of the bullies threatening to hurt her. Later that day, I overheard one of the bullies say \\u201c yeah the group chat couldn\\u2019t find (students name) at lunch\\u201d. They were tracking this student\\u2019s location with a massive grade level group chat. I immediately sent an email to the counselor reporting what I had heard and expressed my concern for the student. In the email I stated, \\u201c I worry there will be a fight if this situation is not addressed\\u201d and gave exact names of the bullies. She responded saying she would check in with the student being bullied. Five days after I sent the email, the student was jumped by the same bully who mentioned the group chat tracking. Around 60 students rushed into the classroom to film the attack. The huge group of students knew beforehand what was going to happen, and this attack was planned out via the group chat. \\n\\nAdministration tells the students to come to an adult if they are being bullied. NOTHING was done from administration to protect this girl. This student came to me crying for help, and my trust in administrators to actually do their job failed this poor girl. She did everything she was told to protect herself and the system failed her. \\n\\nA video of the attack was air dropped to my phone today. I am debating anonymously contacting the local news station with my story and a privacy edited copy of the video to expose the ineffectiveness of this school\\u2019s administration. I am leaving teaching  after this contract year, and I don\\u2019t care what this would do to my reputation if my identity leaked. Should I whistle blow?\\n\\nTL;DR: A student came to me afraid for their safety from bullies. I reported bullies and nothing was done. Shortly after the report, the student was physically attacked. Should I whistle blow to the local news?\"", "title": "Should I whistle blow?", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/Teachers/comments/13137t5/should_i_whistle_blow/"}, {"author": "penguin_runner", "created_utc": 1649373903.0, "link_flair_template_id": "001e3cdc-6b46-11e8-83b1-0e104432f86c", "link_flair_text": "Humor", "num_comments": 1364, "post_id": "typqo8", "score": 18011, "subreddit": "teachers", "text": "\"Having a rough week, trying to take a breather. I\\u2019m at a local coffee/wine bar having a glass of wine and embroidering a kitten and flowers for my sanity. A student is here with their  family. They just came up to me and said \\u2018Hey Ms Penguin! Hey look mom, it\\u2019s Ms Penguin\\u2019 Said hi, conversed for a moment, kid and parent left to sit down, I went back to my embroidery. \\n\\nThe kid\\u2019s mom came back and said \\u201cI just think it\\u2019s really inappropriate for a teacher to be seen drinking by the public, think about the message that sends\\u201d \\n\\nI\\u2019m just trying to unwind and privately do a craft here\"", "title": "Spotted: teacher in public! Drinking a glass of wine! How inappropriate…", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/Teachers/comments/typqo8/spotted_teacher_in_public_drinking_a_glass_of/"}, {"author": "heirtoruin", "created_utc": 1687302561.0, "link_flair_template_id": "001e3cdc-6b46-11e8-83b1-0e104432f86c", "link_flair_text": "Humor", "num_comments": 1026, "post_id": "14eqgh2", "score": 15504, "subreddit": "teachers", "text": "\"One of my self-identified redneck sophomore boys this past year brought me four pounds of ground venison plus one tenderloin on the day of his final exam. Obviously, he's a hunter. I'm just now getting around to making chili with half of the ground. Without a doubt... the most awesome gift I've received in 7 years of doing this thing. The boy himself is definitely not your scholar type, but he always gave me solid effort for at least the first 30 minutes of the period, which was the last of the day. Mom warned me that his meds would wear off around 2:30 each day!! Anyway, I'm stoked to eat tonight. I haven't had venison in several years. \\n\\nHave any of you reading this been gifted meat? ... or anything else consumable?\"", "title": "Student gave me deer meat on the last day of school", "upvote_ratio": 0.94, "url": "https://www.reddit.com/r/Teachers/comments/14eqgh2/student_gave_me_deer_meat_on_the_last_day_of/"}, {"author": "Eclectique1", "created_utc": 1687138384.0, "link_flair_template_id": "001e3cdc-6b46-11e8-83b1-0e104432f86c", "link_flair_text": "Humor", "num_comments": 871, "post_id": "14d0zns", "score": 15211, "subreddit": "teachers", "text": "\"I live where I teach, and shop at the local grocery store that employs a ton of our students (because it's a shitty job and most places that hire high schoolers are shitty jobs). Some of the knuckleheads actually bear down when they have a paycheck dangled in front of them and working is actually very good for them, a couple graduated seniors are even assistant managers. \\n\\nHowever, some of them try to carry their school behavior into the workplace. One in particular was always a pain. I never taught him but wrote him up a few times for hallway behavior. Even as a senior, he behaved like a 5th grader (actually no, this is an insult to 5th graders) but got everything excused because he had an IEP and an enabling mom. It got to the point where flipping desks and telling teachers to go fuck themselves just got excused by admin with a 15-minute detention where he was allowed on his phone. He barely graduated, I'm certain somebody fudged his grades to avoid the trouble. This young man cannot function in society. \\n\\nI'm chatting with one of the graduated seniors working there for the summer, and he said that X got fired after a single shift working. I asked what happened, and he said \\\"X was sitting on a pallet of product, eating snacks off the rack, vaping, and sitting on his phone. Our manager came over to talk to him, and he told her to go fuck off and die. When he got fired, his mom came in screaming about how he has extended time in his IEP and deserves a retake of his first day. We had to call the cops to get her to leave.\\\"\\n\\nLack of consequences in school lead to this type of situation in the workplace. \"", "title": "Student saw consequences in the workplace! Fool around and find out!", "upvote_ratio": 0.93, "url": "https://www.reddit.com/r/Teachers/comments/14d0zns/student_saw_consequences_in_the_workplace_fool/"}, {"author": "HollabackGwen", "created_utc": 1688188166.0, "link_flair_template_id": "fe0a214e-146a-11e9-893d-0e90c126802c", "link_flair_text": "Teacher Support &/or Advice", "num_comments": 1241, "post_id": "14nmaml", "score": 15147, "subreddit": "teachers", "text": "\"The title basically.\\n\\nAdmin pulled me into their office to discuss a parental complaint against me for \\\"teaching the class that homosexuality was okay\\\". Along with a diatribe about it \\\"going against the Christian values of my family, and the teacher should keep her personal life and politics away from our child and out of the classroom\\\".\\n\\nFor background, the students asked me about my husband since I wear a wedding ring. I didn't want to lie and I didn't know what else to say, so I said \\\"well, my wife is very nice\\\" and the students got excitable and one student said something along the lines of \\\"you married a GIRL and you're a girl? That's weird!\\\" And I just said \\\"well, sometimes boys marry boys and girls marry girls, okay? I like my wife a lot, thank you for asking about her, but let's move on with the lesson!\\\" And that was it. We got done with the lesson and nothing else happened, and it was never brought up again. \\n\\nThe complaint came in a few days later, and the principal wanted to discuss it with me to \\\"check the facts\\\". To their credit, the principal upon hearing my side said \\\"We fully support you. I know your wife, and she's wonderful, your kids are wonderful and you're wonderful. Talk about her any time and as much as you like, and we will always have your back here\\\".\\n\\nDespite my principal's reassurance, I'm still floored and depressed honestly. I literally cried right there in the office... I was crying at home too... I've seen so many other teachers talk about their spouses, with much more detail than I gave, while even having pictures on their desks of their families and husbands/wives... Why can't I even \\\"admit\\\" I have a wife without worrying again? \\n\\nI swear I am a good teacher. I do my best every single day. And the child of those parents who complained is one of my best, and is an absolutely amazing student who is always engaged and helpful. Before this \\\"issue\\\" many parents spoke highly of me. Their child also has never complained and never expressed anything other than surprise at my revelation, lol... But now I'm a terrible teacher for \\\"pushing sinful lifestyles on our children\\\"? (Also in the complaint).\\n\\nI hate feeling like I have to hide a massive part of myself to just have some peace at work. I hate feeling like I have to omit specifics with my coworkers or parents when sharing any personal experience. I've been married legally to my wife for a long time. We have children together. We've built a life. And I'm proud of that life. I just wish parents cared more about how I actually teach and serve their kids, rather than who I choose to spend my life with. Sigh...\\n\\nAny advice on how to handle this in the future? I'm fairly new to this, and I have a foreboding feeling this definitely won't be the last time it happens.\"", "title": "Parents Filed a Formal Complaint Because I'm Gay", "upvote_ratio": 0.9, "url": "https://www.reddit.com/r/Teachers/comments/14nmaml/parents_filed_a_formal_complaint_because_im_gay/"}, {"author": "nsald28", "created_utc": 1608808363.0, "link_flair_template_id": "0973713e-146b-11e9-9158-0e2d8a9d2f30", "link_flair_text": "Student Teacher Support &/or Advice", "num_comments": 1553, "post_id": "kjdq5z", "score": 15027, "subreddit": "teachers", "text": "\"I just don\\u2019t know what to do anymore. I teach 4th grade in a low performing school and I can\\u2019t keep going back to pre-k and kindergarten level work for the kids who can\\u2019t read. We are supposed to be analyzing texts and yet, here I am still teaching kids what sound the letter w and y make. I am not a kindergarten teacher and I don\\u2019t have the time or patience to keep going over these skills with some kids. Schools need to start holding kids back when they can\\u2019t read or write and bomb state tests. When did we stop doing that? Or is it just my district? Why do we have 8th graders reading at 2nd grade levels? \\n\\nI\\u2019m in my second year teaching and I am already over it. Maybe moving to a district where the kids are at grade level would help, but in all honesty I\\u2019ve had Korean students who could read better than my native English speaking kids. I just needed to vent a little while we are on break.  I am not looking forward to returning at all. The district requires us to spend all of our time helping the kids who can\\u2019t read while the kids who are at or almost at grade level get neglected. It just isn\\u2019t fair to students or teachers to set them up for failure.\\n\\nEdit: I guess I\\u2019m wrong here because I keep getting downvoted. Sorry I\\u2019m not all rainbows and sunshine about my students not being able to read.\\n\\nEdit 2: not all teachers are built the same. I think everyone does their very best, but some of y\\u2019all are just plain perfectionists. Sorry if my view on reading isn\\u2019t clear. Students need to be able to read in life so they can vote, go to college, get a job, etc. It\\u2019s not just test scores. I do differentiate, but with virtual it\\u2019s hard to. Thought I could vent on here without being attacked by other underpaid, overworked teachers but I guess not.\\n\\nEdit 3: Thank you for those who understand and aren\\u2019t belittling me or my teaching and not judging. We are all in the same boat! I\\u2019m taking advice and applying it to my classes. I and I think we all want kids who can vote for their interests, who can get good jobs, and who can keep the planet from dying. Thank you and have a great rest of your holiday break \\ud83c\\udf84\"", "title": "Stop promoting illiterate children", "upvote_ratio": 0.92, "url": "https://www.reddit.com/r/Teachers/comments/kjdq5z/stop_promoting_illiterate_children/"}, {"author": "starbarbazzar", "created_utc": 1659740296.0, "link_flair_template_id": "001e3cdc-6b46-11e8-83b1-0e104432f86c", "link_flair_text": "Humor", "num_comments": 1467, "post_id": "wh8wi7", "score": 14292, "subreddit": "teachers", "text": "\"I work at a charter and I have 47 incoming kindergarteners. And they\\u2019re acting like it\\u2019s normal. I can\\u2019t wait.\"", "title": "47 kindergartners in my classroom this year. That’s it. That’s the post.", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/Teachers/comments/wh8wi7/47_kindergartners_in_my_classroom_this_year_thats/"}, {"author": "LuciusDickusMaximus", "created_utc": 1690565938.0, "link_flair_template_id": "3df03460-146b-11e9-8e30-0ef5ea3c0604", "link_flair_text": "Classroom Management & Strategies", "num_comments": 1514, "post_id": "15c3yd4", "score": 13430, "subreddit": "teachers", "text": "\"In my tenth year of teaching mostly freshmen and I s2g ever since the pandemic (and honestly like 5 years before that) there\\u2019s always a new \\u201cthing\\u201d students bring to school that they learned over the summer from the internet or wherever.\\n\\nThe newest thing here is a flock of self-proclaimed \\u201ccoin boys\\u201d who carry a quarter on hand at all times and constantly flip it. They have their entire personality revolve around coins, coin flips, and chance. When we went around doing an ice breaker, 4 or 5 of the kids said some variation of \\u201cI live by the coin and die by the coin\\u201d as their fact.\\n\\nJust about an hour ago, when I assigned the first assignment of the school year, one of the coin boys was bold enough to say \\u201cheads I do it, tails I don\\u2019t.\\u201d I told him if he flipped the coin he would be getting a call home on the first week of HS. He flipped it anyway and it came up heads (thank god for that at least). \\n\\nBut then the other coin boy in that class flipped his coin and it came up tails. He said the coin has spoken and he\\u2019s not doing it. I say very well, enjoy your 0 and your call home\\u2014 what a great way to start off the school year and your high school career.\\n\\nI really hope this dies off soon. I haven\\u2019t seen anything online about this when I googled it, so I\\u2019m guessing it\\u2019s just a local friend group thing, unless one of you has some more info\\u2026\"", "title": "Every year these kids come back with a new annoying quirk… “coin boys” are apparently the new thing", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/Teachers/comments/15c3yd4/every_year_these_kids_come_back_with_a_new/"}, {"author": "None", "created_utc": 1681257624.0, "link_flair_template_id": "001e3cdc-6b46-11e8-83b1-0e104432f86c", "link_flair_text": "Humor", "num_comments": 1254, "post_id": "12j2s8h", "score": 12907, "subreddit": "teachers", "text": "\"A student at my school today brought in some Uranium to show his science teacher. Actual, certified, in-a-lead-box-with-\\u2622\\ufe0f-on-it Uranium. For some reason, the science teacher didn\\u2019t confiscate it or inform admin, so of course, during lunch, one of the kid\\u2019s friends ate it. \\n\\nThat kid is spending the night in the hospital.\\n\\nI work in a high school.\\n\\nI literally don\\u2019t even know anymore. Like, nothing will ever surprise me now.\"", "title": "I don’t even have a title for how stupid this is…", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/Teachers/comments/12j2s8h/i_dont_even_have_a_title_for_how_stupid_this_is/"}, {"author": "Cyclosarin88", "created_utc": 1653747505.0, "link_flair_template_id": "fe0a214e-146a-11e9-893d-0e90c126802c", "link_flair_text": "Teacher Support &/or Advice", "num_comments": 832, "post_id": "uzoa5c", "score": 12885, "subreddit": "teachers", "text": "\"Please don\\u2019t make me carry a gun\\n\\nAs a male teacher/coach\\u2026 I\\u2019m terrified I\\u2019m about to be pressured to carry a gun\\u2026\\n\\n1.) I am not comfortable with guns and we do not have any in our home.\\n\\n2.) I\\u2019d be constantly worried about an accident in the classroom.\\n\\n3.) I know some teachers that I do NOT trust to be armed. I can tell you this\\u2026 the ones I trust the least, will be the first ones to sign up to carry their guns in class.\\n\\n4.) If I was armed in an active shooter scenario\\u2026 What if I accidentally fired at an officer or the wrong kid\\u2026 now I\\u2019m going to prison because of an accident I never wanted to face.\\n\\n5.) What if the police fire on me because the see a man with a gun inside the school and they are taught to neutralize the threat as soon as possible.\\n\\nI became a teacher to teach.  I am not Rambo or GI Joe\\u2026 I am not comfortable or qualified to brandish a firearm during an emergency\\u2026.\"", "title": "Please don’t make me carry a gun", "upvote_ratio": 0.88, "url": "https://www.reddit.com/r/Teachers/comments/uzoa5c/please_dont_make_me_carry_a_gun/"}, {"author": "schebles", "created_utc": 1683730574.0, "link_flair_template_id": "4433b45a-146b-11e9-a469-0ee696cc69a0", "link_flair_text": "Policy & Politics", "num_comments": 1106, "post_id": "13dt3sb", "score": 12843, "subreddit": "teachers", "text": "\"Did anyone else watch this interview on GMA? My jaw was on the floor. She mentioned how her son felt ignored that week. She also goes on to detail an instance where her son \\u201caccidentally\\u201d knocked the teacher\\u2019s phone out of her hands, and it got him suspended. Ms. Zwerner\\u2019s Account was very different. I cannot believe his mom stepped out and tried to victimize her son while shading the teacher.  Am I the only one that struggled to watch this?\"", "title": "Parent of six year old who shot his teacher speaks out.", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/Teachers/comments/13dt3sb/parent_of_six_year_old_who_shot_his_teacher/"}, {"author": "go_zarian", "created_utc": 1703079982.0, "link_flair_template_id": "001e3cdc-6b46-11e8-83b1-0e104432f86c", "link_flair_text": "Humor", "num_comments": 904, "post_id": "18muyho", "score": 12694, "subreddit": "teachers", "text": "\"I once had a student email me his assignment. It was his final assignment prior to graduation. He sent the email literally hours before I had to submit all the grades to the grading management system.\\n\\nWithin five seconds of opening the email, I gave him an instant zero. The student had hired a third party to complete the assignment for him for a fee. The third party had emailed the completed assignment to him, along with a demand for final payment ($50 deposit + $50 final payment). The student then simply forwarded the whole thing to me.... *with the full email trail.*\\n\\nThe student got furious and demanded to know why he got the zero.\\n\\nMe: You paid someone named Jim $100 to do your assignment for you.\\n\\nStudent: WHAAAAAT?!?!? How did you figure that out?\\n\\nMe: You told me.\\n\\nStudent: What? I didn't tell you!\\n\\nI stood my ground. He really couldn't figure out how I worked it out.\\n\\nHe missed his graduation. Oh, and $100.\"", "title": "The most humorous case of cheating you've ever seen", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/Teachers/comments/18muyho/the_most_humorous_case_of_cheating_youve_ever_seen/"}, {"author": "None", "created_utc": 1660759306.0, "link_flair_template_id": "4433b45a-146b-11e9-a469-0ee696cc69a0", "link_flair_text": "Policy & Politics", "num_comments": 407, "post_id": "wqvn9a", "score": 12095, "subreddit": "teachers", "text": "\"Have y\\u2019all heard of a sexist, misogynistic, disgusting excuse of human being known as Andrew Tate? \\n\\nWell, I promise you all your middle school & high school boys have & they\\u2019re addicted to his content. Just this week I had to have 6 convos with families about their sons saying shit like \\u201cwomen are inferior to men\\u201d \\u201cwomen belong in the kitchen Ms____\\u201d. \\n\\nNot only are they making these misogynistic claims in class but are literally refusing to do assignments if it\\u2019s sourced from a woman\\u2026.I had three boys refuse to read an article by a female author because \\u201cwomen should only be housewives\\u201d. But when I say \\u201cI\\u2019m a teacher and here teaching you\\u201d the cognitive dissonance kicks in and they start saying \\u201cyah but teaching is a woman\\u2019s job\\u201d\\u2026??!?\\n\\n5/6 parents (all mothers) were mortified when I discussed their comments. The other 1 dad said \\u201cwe\\u2019ll he isn\\u2019t wrong\\u201d. 2 are immigrant mothers and they cried on the phone when I shared a video of Andrew Tate that their sons kept referencing & translated the content to them. And this particular videos was talking about his webcaming \\u201cbusiness\\u201d (ie human trafficking women). \\n\\nY\\u2019all. It\\u2019s been only 2 weeks of school & these young boys are losing it. I\\u2019ve never heard such vitriol from young boys since this Andrew Tate guy came on the scene. \\n\\nThis rise of incel and misogynistic rhetoric is terrifying.\"", "title": "The rise of Andrew Tate is ruining my freshman boys", "upvote_ratio": 0.94, "url": "https://www.reddit.com/r/Teachers/comments/wqvn9a/the_rise_of_andrew_tate_is_ruining_my_freshman/"}, {"author": "KDwiththeFXD", "created_utc": 1650066902.0, "link_flair_template_id": "001e3cdc-6b46-11e8-83b1-0e104432f86c", "link_flair_text": "Humor", "num_comments": 1350, "post_id": "u4l5uq", "score": 12086, "subreddit": "teachers", "text": "\"Being a former Marine I like to think that I have a decent control of my bearing but sometimes these kids just say things that make you lose it.  Earlier this week I was subbing in a lower achieving HS science class.  One kid felt the need to pick on a student who has some developmental issues.  I was ready to jump in and intervene but the kid quickly snapped back \\u201cI am in here for a reason and I have an excuse, you\\u2019re here and failing because you\\u2019re just dumb as shit.\\u201d I immediately let loose a laugh and the bully looked so embarrassed and didn\\u2019t say another word the rest of the class.\"", "title": "Has a student ever said anything so funny you couldn’t help but laugh?", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/Teachers/comments/u4l5uq/has_a_student_ever_said_anything_so_funny_you/"}, {"author": "JLewish559", "created_utc": 1596291901.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 856, "post_id": "i1t0ka", "score": 11580, "subreddit": "teachers", "text": "\"I'm just stupefied by some of my colleagues. I teach with 20 in my department (science) and I've talked to at least 8 that think Covid-19 is in *some way* a hoax. Or that \\\"the numbers aren't real\\\". I have heard Facebook-spread talking points like \\\"It has a 99% survival rate\\\" or \\\"It's been around since last October. We have all probably had it already!\\\"\\n\\nI get that skepticism is alright. It's a good characteristic to have, but in the absence of any real evidence to support a claim...you should not be spreading misinformation and basing decisions off of that. A lack of evidence goes against the very crux of scientific investigation.\\n\\n&#x200B;\\n\\nSo if you are a science teacher and you spread this kind of crap I truly believe you need to leave. **YOU** are the problem with science education in the United States \\\\[and the world\\\\].\\n\\nAs a science teacher I look at the data and think \\\"That doesn't look great. Maybe schools should stay closed to students and we go virtual,\\\" or I just look at what the experts are saying. Because I am not an epidemiologist. But the way some of my colleagues talk you'd think they have their PhD's on the subject.\\n\\n&#x200B;\\n\\nGet out of science teaching and go be a Feng Shui expert. Spread your charlatanism elsewhere.\\n\\n&#x200B;\\n\\nEdit: 22 hours later....\\n\\nI wanted to address a few things here.\\n\\nFirst, the \\\"you must not be a scientist\\\" remarks--what exactly is unscientific about what I typed here? I specifically stated that I don't know the answer. I am not an expert on everything...no one is an expert on everything. You have to defer to other people that are. If you are a Physicist that wants to build a new kind of bridge then you will have to either go through years of school to become an engineer or you can find one and get their opinion on its structural soundness and utility.\\n\\nSecond, several times people think they are \\\"catching me\\\" because I state (in some replies) that the CDC put out the IRD (infectious rate of death) to be 0.65%. And so the 99% argument must be a valid one because I am saying it's actually 99.35%! Well, the difference between typing this over reddit and saying it in person is vast. Over reddit, I can at least assume that people understand what that means in terms of number of people dead. In person this is never put into context...you just use it as a point of contention and coldly move on. You use it to be intentionally misleading. 0.65% of 309,000,000 is not a small number let alone the population of the entire globe. And neither is 1% for that matter...\\n\\nThirdly, back to the \\\"scientists are curious\\\" remarks. And I must not be a scientist because I'm not curious or unwilling to be skeptical. I stated that skepticism is alright, but in the absence of real evidence to support a claim you should not be spreading misinformation. I state multiple times throughout replies that there is possibly something fishy going on with the numbers, but **I DONT KNOW** so I won't jump to any conclusions. It's like looking up and seeing an airplane configuration that you've never seen before and immediately jumping to \\\"That must have been aliens!\\\" even though that's obviously a silly thing to conclude without any evidence other than not knowing what it was.\\n\\nFinally, I want to be clear that this economic shutdown was a shit-show and I know. Of course I played no role in it. When I saw the numbers in Italy back in March it was *scary*. When the WHO was releasing conflicting information I scoffed at them and thought \\\"What the fuck is wrong with them?\\\" And then Trump started talking about Covid-19 never being a problem here and then injecting sunlight into our veins (??). And then the entire governmental structure seemingly failing to handle this thing properly. There's a difference between being skeptical of what is going on based on real, tangible evidence and being skeptical based on your political standing which is going to color your skepticism and deceive you.\\n\\nI hope that in 6 months time this is all behind us. That we have a vaccine that is being mass produced and everyone (including our black neighbors, our overweight/obese neighbors, our elderly neighbors, our neighbors with cancer, etc.) can start to feel safer going out into the world. I'm prepared for things to completely turn around because I'm not really taking a stance here. Do I think it will happen based on trends? No...not *quickly*, but I'm sure we will eventually be back to \\\"normal\\\" and look back at this clusterfuck and hopefully learn from it.\"", "title": "If you teach science and think Covid-19 is a \"hoax\" then please resign", "upvote_ratio": 0.93, "url": "https://www.reddit.com/r/Teachers/comments/i1t0ka/if_you_teach_science_and_think_covid19_is_a_hoax/"}, {"author": "ShirleyMcLoon", "created_utc": 1702256964.0, "link_flair_template_id": "fe0a214e-146a-11e9-893d-0e90c126802c", "link_flair_text": "Teacher Support &/or Advice", "num_comments": 806, "post_id": "18fijuw", "score": 11483, "subreddit": "teachers", "text": "\"My student was killed in a car accident yesterday. Very sweet and quiet kid in my lab science class. He is the third student to die in the last 5 weeks (all senior boys; 1 from an accident another from SI). I\\u2019m supposed to have him in lab tomorrow and do not know what to do. I do not know what to say to his class. His lab group. To reach out to his parents or not. Our school is in a very dark place lately already with budget cuts, ignored disciplinary issues, and now the death of three students. \\n\\nWe have another emergency faculty meeting tomorrow am before school to discuss students who may be in crisis. With the other students deaths teachers were not given a protocol for class. \\n\\nI\\u2019m not sure what to do and any advice would be welcome and I\\u2019d be forever grateful.\"", "title": "My student died.", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/Teachers/comments/18fijuw/my_student_died/"}, {"author": "fourassedostrich", "created_utc": 1694441293.0, "link_flair_template_id": "fe0a214e-146a-11e9-893d-0e90c126802c", "link_flair_text": "Teacher Support &/or Advice", "num_comments": 2817, "post_id": "16fw9br", "score": 11372, "subreddit": "teachers", "text": "\"I really don\\u2019t even know why I bother talking about or showing these kids any 9/11 material. The event is such a mascot for edgy meme culture that I\\u2019m essentially showing them a comedy. I get it, the kids are desensitized and annoying, but man on this day my composure with them is put to the ultimate test. \\n\\nHave a good Monday, y\\u2019all. Don\\u2019t let \\u2018em get to you if you\\u2019re feeling particularly somber today.\"", "title": "9/11 is hilarious to these kids.", "upvote_ratio": 0.88, "url": "https://www.reddit.com/r/Teachers/comments/16fw9br/911_is_hilarious_to_these_kids/"}, {"author": "Kittylicious1224", "created_utc": 1692462108.0, "link_flair_template_id": "fe0a214e-146a-11e9-893d-0e90c126802c", "link_flair_text": "Teacher Support &/or Advice", "num_comments": 3171, "post_id": "15vkitd", "score": 11331, "subreddit": "teachers", "text": "\"My God, the names. The names. I've got 140ish high schoolers and I've got alllll the McKenzie/McKinley/Kinzley/Makailey/Kylee you name its, what feels like ten kids named Isaac or Ian, three kids named Reese (two girls, one boy), four kids named Jayden/Jaden/Jaiden (two girls, two boys), and then a bunch of random, made-up names that aren't phonetic at all. I'm too old for this. I can't. \"", "title": "These names are going to be the death of me...", "upvote_ratio": 0.94, "url": "https://www.reddit.com/r/Teachers/comments/15vkitd/these_names_are_going_to_be_the_death_of_me/"}, {"author": "MathALetics", "created_utc": 1505163899.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 683, "post_id": "6zib3s", "score": 10995, "subreddit": "teachers", "text": "\"\"", "title": "Jon Hamm: \"Paying teachers more is 'one of the most obvious things we could do to improve life\"", "upvote_ratio": 0.89, "url": "http://www.businessinsider.com/jon-hamm-on-teachers-2017-4"}, {"author": "anapashu22", "created_utc": 1683228691.0, "link_flair_template_id": "fe0a214e-146a-11e9-893d-0e90c126802c", "link_flair_text": "Teacher Support &/or Advice", "num_comments": 881, "post_id": "137xdcb", "score": 10677, "subreddit": "teachers", "text": "\"One of my students pulled me aside today and told me that he got his girlfriend pregnant. He told me that he hadn\\u2019t told anyone else yet (he has a really bad home life), he was panicking, and didn\\u2019t know what to do. So, we sat down and chatted about their options and how to tell their parents and he asked if they could both come in tomorrow and talk with me together. \\n\\nI can\\u2019t believe how reckless these kids are. They\\u2019re 15! He was out of school for 3 weeks and ironically ended up missing sex ed so maybe that was the problem /s\"", "title": "One of my 9th graders got his girlfriend pregnant", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/Teachers/comments/137xdcb/one_of_my_9th_graders_got_his_girlfriend_pregnant/"}, {"author": "teachingteacherteach", "created_utc": 1708186633.0, "link_flair_template_id": "001e3cdc-6b46-11e8-83b1-0e104432f86c", "link_flair_text": "Humor", "num_comments": 920, "post_id": "1at5kjo", "score": 10607, "subreddit": "teachers", "text": "\"I have 4 or 5 gang-affiliated students in each of my classes. Beginning of the year, I always prioritize relationship building with them...for obvious reasons.\\n\\nI call them to my desk a couple times a week in the beginning of the year, give them a piece of candy, and just talk to them. They're all 2 kool 4 skool the first month of the year. Get into all types of nonsense. \\n\\nThey generally come around to me by October and after that they're secretly my favorites. \\n\\nIn class - attentive, happy, trying their best, I have to shoo them away from my desk because they want to chit chat\\n\\nOutside of class - Admin: \\\"Yeah, we're gonna need you to get some work for XYZ to take home. He got suspended for fighting again.\\\"\"", "title": "I'm always surprised at how nice my gang-affiliated students are.", "upvote_ratio": 0.9, "url": "https://www.reddit.com/r/Teachers/comments/1at5kjo/im_always_surprised_at_how_nice_my_gangaffiliated/"}, {"author": "CRAPtain__Hook", "created_utc": 1703103703.0, "link_flair_template_id": "001e3cdc-6b46-11e8-83b1-0e104432f86c", "link_flair_text": "Humor", "num_comments": 594, "post_id": "18n47ec", "score": 10335, "subreddit": "teachers", "text": "\"My 4th block Earth Science class had their final exam today and during the middle of it I look up and see a kid staring, with the utmost of concentration, at their lap. Either something unbelievably fascinating was happening to his crotch, or he was looking at something.  I guessed the latter and approached him from about 8 o\\u2019clock directionally, fully expecting some rapid \\u201chiding of the phone that you\\u2019re obviously holding\\u201d hand movements. Instead, nothing. Didn\\u2019t even notice I was standing behind him. So I stood there for a good 15 seconds and watched him try to Google answers. \\n\\nEventually I just pulled out my phone and recorded a 20 second video of him Googling answers so I had some irrefutable evidence to bring forward when I inevitably get called into the office to discuss why I gave such a promising young football star a 0 on a final exam.  I always thought spatial awareness was an important part of football but I guess I\\u2019ve always been wrong about that.\"", "title": "Have students always been this bad at cheating?", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/Teachers/comments/18n47ec/have_students_always_been_this_bad_at_cheating/"}, {"author": "MightyMississippi", "created_utc": 1684070368.0, "link_flair_template_id": "4433b45a-146b-11e9-a469-0ee696cc69a0", "link_flair_text": "Policy & Politics", "num_comments": 1108, "post_id": "13hc2ak", "score": 10309, "subreddit": "teachers", "text": "\"# We devote so much time and energy to the worst children that we have little to nothing remaining for the best.\\n\\nI don't doubt that there are a few schools about the country managing to keep their heads above water and provide a quality education to some deserving children. This isn't about them.\\n\\nThis is about those kids you see in front of you, sitting in silence, politely waiting for the madness to end, so that maybe, just maybe, they might get five minutes of education out of a 55-minute class.\\n\\nYou ever see **that one good kid** looking up at you from the mosh pit and just feel sick to your stomach? Some times, I find myself apologize to them for having to share oxygen with the animals who are allowed to ruin our school.\\n\\nI've had administrators pressure us to surrender control of after school activities in support of those same miscreants, to use our programs as a reward, incentive, or after school day care for the worst students in our building\\u2014rather than as the intended special opportunity for the best and brightest.\\n\\n**It is no secret that American public schools weaponize troubled children to undermine the entire system to yield advantage to private and charter schools.** When student violence cripples or kills a kid, or, even better, a teacher, it's all just icing on the cake.\\n\\n**We are in dire straits. We need a way to stratify student bodies to protect and nurture the good ones while providing the necessary services to the troubled ones.** This needs to start no later than kindergarten. Good kids should not have to wait until high school AP classes to pick up a few scraps of quality education in peace before graduation.\\n\\nI am done being a door mat for entitled monsters and the oblivious fools who enable them.\"", "title": "We are failing our best and brightest", "upvote_ratio": 0.92, "url": "https://www.reddit.com/r/Teachers/comments/13hc2ak/we_are_failing_our_best_and_brightest/"}, {"author": "coachpea", "created_utc": 1706184305.0, "link_flair_template_id": "001e3cdc-6b46-11e8-83b1-0e104432f86c", "link_flair_text": "Humor", "num_comments": 634, "post_id": "19f7tgp", "score": 10171, "subreddit": "teachers", "text": "\"Mom: I noticed my kid has an F.\\nMe: Yes, they do. \\nMom: Why?\\nMe: Your child has not completed any assignments this quarter. \\nMom: How can my child improve their grade.\\nMe: ...He could start by doing the assignments.\\nMom: I don't understand. Why does he have an F?\\nMe: His grade is a direct reflection of his effort, ma'am. \\n\\n\\n\\ud83e\\udd37\\u200d\\u2640\\ufe0f If we don't laugh, we'll cry.\\n\\nUpdate: Mom is mad I didn't tell her sooner he was failing. She also said student said he asks for help and I say no. I responded \\\"Ma'am. I was on maternity leave and just returned Monday. He did no work for the last two weeks and has still chosen to do nothing all week. I informed you of the grade as soon as I came back and input it. And I am always happy to help a student who asks for help. He doesn't ask, because he isn't even attempting or opening the assignment, which the program shows me. In fact, he's in my class right now, playing around with another student as I type this. I'll be moving his seat.\\\" \\n\\nUpdate: Mom asked me why I didn't help him while I was on leave or communicate while I was on leave. Me: Well, I was with my newborn baby. This is why I informed all parents I would be out on leave and left detailed instructions how to monitor grades and who to reach out to while I was out. Mom: Well communicate in the future so I can address the issue. \\nMe:... \\n\\n\\nYeah I'm not responding. I can't keep repeating myself without either losing my sanity or sounding like a total bitch. \\ud83d\\ude02\\ud83e\\udd37\\u200d\\u2640\\ufe0f\"", "title": "\"My child has an F\"", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/Teachers/comments/19f7tgp/my_child_has_an_f/"}, {"author": "ToesocksandFlipflops", "created_utc": 1605621089.0, "link_flair_template_id": "dde077ec-146f-11e9-9dd3-0ef99acb7998", "link_flair_text": "Bad Teacher, No Apple", "num_comments": 895, "post_id": "jvtat3", "score": 10139, "subreddit": "teachers", "text": "\"This post was inspired by the 'How are you making sure the student is wearing pants?' post.\\n\\nI have been noticing that teachers are being called out for not doing things that are obviously NOT our jobs.  This is something that has been happening at all levels.  Honestly when I got into the profession I thought that my job would be enlightening young minds to the glorious history of world.  In reality my job is making sure:\\n\\n* kids are fed\\n* emotionally stable\\n* safe at home\\n* dressed appropriately\\n* entertained\\n* passing class\\n* able to do executive functions (planning, time management, interpersonal relationship etc.)\\n\\nI'm sure I could go on, the the absolutely last thing I teach is content.\\n\\nI'm not really complaining, really I get it we have to meet the hierarchy of needs, kids need to be fed, safe and clothed.  I just feel that a lot of these key features of a child's life used to be handled by the parents, but especially with the window into the home we see the lacking education of students by parents.\\n\\nI also know that this is probably the way it has always been, and maybe I've just been sheltered... I don't know it's just frustrating to be asked to teach things that you never learned how to teach.\\n\\nEdit:  My very first award!  Thank you kind reddit stranger!\"", "title": "I strongly believe that the hatred of remote learning is that parents are being called out for lack of parenting", "upvote_ratio": 0.94, "url": "https://www.reddit.com/r/Teachers/comments/jvtat3/i_strongly_believe_that_the_hatred_of_remote/"}, {"author": "TheBarnacle63", "created_utc": 1698580314.0, "link_flair_template_id": "fe0a214e-146a-11e9-893d-0e90c126802c", "link_flair_text": "Teacher Support &/or Advice", "num_comments": 806, "post_id": "17j1b8x", "score": 10074, "subreddit": "teachers", "text": "\"I have been in education for 34 years. 27 years as a teacher, 7 years as an administrator, and 17 years as a coach. I have never seen us in such a state. Here is a recollection of a conversation I had recently with an administrator.\\n\\nAdmin: You need to explain why you have 17 seniors failing your class.\\n\\nMe: They don't come to school.\\n\\nAdmin: Ok, but why are they failing your class?\\n\\nMe: They don't come to school.\\n\\nAdmin: But in the meantime, we need to do something to help them pass.\\n\\nMe: How, when they don't come to school?\\n\\nAdmin: There's nothing we can do about that.\\n\\nMe: Have you told them to go to class and do their work?\\n\\nAdmin: No.\\n\\nMe: Why not?\\n\\nAdmin: <<Silence>>\\n\\nMe: Don't you have a policy that says they automatically fail due to excessive absences?\\n\\nAdmin: Yes, but we are not going to enforce it.\\n\\nMe: Why not?\\n\\nAdmin: We're still dealing with Covid. The central office won't support that.\\n\\nMe: I stopped riding that dead horse a while ago. At that point, I just started walking.\\n\\nAdmin: What does that mean?\\n\\nMe: Covid was four years ago, how long are we going to ride that excuse? When you find yourself riding a dead horse, get off, and start walking.\\n\\nAdmin: How bad is your attendance?\\n\\nMe: Over half of my students are chronically absent, and many of these seniors are absent 30% of the days. Two have been absent for over half the quarter.\\n\\nAdmin: Then explain how many of these students are making As in other classes.\\n\\nMe: Well, those teachers don't even give tests. Have you seen their assignments? I have.\\n\\nAdmin: No, I haven't looked into that.\\n\\nMe: Well, until you find a way to get these kids into school, I guess we are at an impasse.\\n\\nWe are at the place where administrators just want us to have easy assignments, and just shuttle the kids out the door. Teachers who want to have standards and expectations are eventually beaten down and just comply. I am so glad I retire soon.\"", "title": "The dumbest conversation I ever had with an administrator.", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/Teachers/comments/17j1b8x/the_dumbest_conversation_i_ever_had_with_an/"}, {"author": "makeupaddict337", "created_utc": 1705862297.0, "link_flair_template_id": "fe0a214e-146a-11e9-893d-0e90c126802c", "link_flair_text": "Teacher Support &/or Advice", "num_comments": 1608, "post_id": "19ca8gp", "score": 9467, "subreddit": "teachers", "text": "\"I teach FCS and we're doing the unit where they take home a flour sack baby (our school doesn't have the budget for the electronic dolls). One of my students asked for a replacement because his mom turned his flour sack baby into dinner rolls. He said they were out of flour and his mom didn't want to drive to the store while cooking dinner. He offered to pay for the cost of the flour sack. Should I allow a do-over? If so, would you mark down the grade for eating the first one?\"", "title": "What grade would you give a student who ate their flour sack baby?", "upvote_ratio": 0.94, "url": "https://www.reddit.com/r/Teachers/comments/19ca8gp/what_grade_would_you_give_a_student_who_ate_their/"}, {"author": "journey_to_myself", "created_utc": 1687798724.0, "link_flair_template_id": "4433b45a-146b-11e9-a469-0ee696cc69a0", "link_flair_text": "Policy & Politics", "num_comments": 1227, "post_id": "14jmqtt", "score": 9387, "subreddit": "teachers", "text": "\" This is working at a public school summer program.  \\n\\nSo...one of the places I get cute, simple dresses (almost tunic shirts) that I wear over jeggings.  is Children's place.  The skater dresses and I'll usually get size 14 or 16.  They do not look like a child's dress.  IE NOT special, loud or otherwise distinct. They fall about mid thigh for me, again, more like a long tunic shirt.  Never had a complaint, ever.  I've done it for years.  These are often marked down to $10 or less!!!  \\n\\n\\nWhen I was on getting a couple new ones, I noticed this.  Science teacher me HAD to have it.  It's so fucking perfect.  I teach stem.  I couldn't resist. (I also sent the link to the art teacher because there's a fantastic art one!!!!)\\n\\n[https://www.childrensplace.com/us/p/Girls-Mix-And-Match-Science-Doodle-Print-Knit-Everyday-Dress-3041493-1362](https://www.childrensplace.com/us/p/Girls-Mix-And-Match-Science-Doodle-Print-Knit-Everyday-Dress-3041493-1362)  \\n\\n\\nSo I wear it, and it so happens one of the girls in my class, a middle school kid is wearing it too.  She's a head shorter than me so the dress comes down to her knees, she was wearing shorts.  Summertime outing code of conduct for outdoor science is shoulder to knee coverage to help prevent burns and injury.  We're all with in code.  Cool, right?    \\n\\n\\nShe wanted to take a picture of us \\\"twinning\\\" and let her...because how cute is that?  Mom comes in and loses her shit.   She said that I made her daughter look bad because she wears size 16, too.  Yes, the child's dress is very tight on her, but kiddo said it was also the most comfortable clothing she had, so I was happy for her.  That was the entirety of the convo.  \\n\\n\\nKracken 2.0 complained to admin that  \\\"her grown ass teacher has to violate dress code by being a pervert and wearing kids clothes\\\" (I might point out that had I not been wearing PANTS the dress would, but I had pants on, not shorts, so going to my thigh is not an issue)  \\n\\n\\nAdmin told me that while I was completely in code that no teacher should ever wear children's clothes for any reason.  I pointed out that they'd literally, just weeks before, suggested that teachers check out the Princess Awesome site for inspiration for clothing that \\\"inspired\\\" kids.   (never mind this dress was $13 and princess awesome is $65.)  To which \\\"those are in adult sizes even if they offer children's clothes and you fit you need to buy the adult one. \\\"  \\n\\n\\nWhat the actual fuck?  \\n\\n\\nThe art teacher (who is in the union) was livid and she's dealing with it on her end. (I'm just a contractor).\\n\\nBut really?  Part of me wants to be understanding but part of me is just so angry because it's a  dress that fits.  I'm willing to accept that I'm in the wrong, because it is kids clothing.\\n\\n&#x200B;\"", "title": "Parent mad I wore same print & size as child", "upvote_ratio": 0.94, "url": "https://www.reddit.com/r/Teachers/comments/14jmqtt/parent_mad_i_wore_same_print_size_as_child/"}, {"author": "Reasonable_World1680", "created_utc": 1696175281.0, "link_flair_template_id": "fe0a214e-146a-11e9-893d-0e90c126802c", "link_flair_text": "Teacher Support &/or Advice", "num_comments": 933, "post_id": "16x4n10", "score": 9146, "subreddit": "teachers", "text": "\"[ Removed by Reddit on account of violating the [content policy](/help/contentpolicy). ]\"", "title": "[ Removed by Reddit ]", "upvote_ratio": 0.91, "url": "https://www.reddit.com/r/Teachers/comments/16x4n10/removed_by_reddit/"}, {"author": "Radiant-Salad-9772", "created_utc": 1709663148.0, "link_flair_template_id": "23b73a8a-146b-11e9-8ac3-0ebef30ca78a", "link_flair_text": "Professional Dress & Wardrobe", "num_comments": 620, "post_id": "1b7ch9e", "score": 8844, "subreddit": "teachers", "text": "\"And before the comments start, I frankly don\\u2019t care that parents have to go work. I and many other parents in my class also have a very limited number of sick days, and you infecting us and getting us sick causes us problems at work, too. \\n\\nEDIT: way too many responses to answer everyone. I\\u2019m talking about kids who are clearly sick and the parents send them to school, not kids who have other reasons for throwing up. \"", "title": "If your kid threw up this morning and you STILL sent them to school, you’re an asshole. ", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/Teachers/comments/1b7ch9e/if_your_kid_threw_up_this_morning_and_you_still/"}, {"author": "MsAvaPurrkins", "created_utc": 1542893097.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 423, "post_id": "9ze2nz", "score": 8744, "subreddit": "teachers", "text": "\"No amount of Lysol could get ahead of the uncovered coughs, the unwashed hands or the mere presence of your sickly children. \\n\\nThis Thanksgiving, I am thankful for FUCKING NOTHING, YOU INCONSIDERATE GAPING ASSHOLES. If your kid is sick, keep them the fuck home so their teachers can enjoy their much needed time off with their families and friends. \\n\\nEDIT: All of my students, regardless of disability, are old enough and responsible enough to stay home alone while sick. No one has to miss work for them, they\\u2019re in high school. \"", "title": "Big shout out to all the parents who sent their sick kids to school this week.", "upvote_ratio": 0.87, "url": "https://www.reddit.com/r/Teachers/comments/9ze2nz/big_shout_out_to_all_the_parents_who_sent_their/"}, {"author": "AndrysThorngage", "created_utc": 1682706367.0, "link_flair_template_id": "001e3cdc-6b46-11e8-83b1-0e104432f86c", "link_flair_text": "Humor", "num_comments": 178, "post_id": "1325p6g", "score": 8737, "subreddit": "teachers", "text": "\"There's this kid.  I don't have him in class (fortunately) but he's one of these kids who every adult in the building knows who they are.  My room is close to the BD room and all during my planning period he either repeatedly slams the BD room door or walks up and down the hallway chanting \\\"Shut up BITCH\\\" with a certain cadence as if it were a song.\\n\\nToday, he wandered into my room during passing time.  I asked the kid he was talking to to have his seat (I ignore the kid I don't have).  He tells his friend, \\\"Just say, 'Shut up BITCH.' That's what I do.\\\"\\n\\nHis friend says, \\\"They let you do that because you ain't right in the head.  I'd get in trouble.\\\"\\n\\nIt was great to watch it dawn on this kid that people are not impressed by him and see him as different because of his behavior.  The hallway was remarkably quiet today.\"", "title": "Watched a kid have a realization today", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/Teachers/comments/1325p6g/watched_a_kid_have_a_realization_today/"}, {"author": "Impressive_Ad_3103", "created_utc": 1682690318.0, "link_flair_template_id": "fe0a214e-146a-11e9-893d-0e90c126802c", "link_flair_text": "Teacher Support &/or Advice", "num_comments": 618, "post_id": "131sjto", "score": 8567, "subreddit": "teachers", "text": "\"Hey,\\n\\nI am officially quitting teaching after this year\\u2019s contract is over\\u2026if I can actually survive until the end!\\n\\nBefore we go on, I\\u2019m a male teacher for only 2 years. I only got into it because I lost my other job in the private sector during the pandemic. I have a 2nd job with another skill set that i wish not to disclose out of anonymity. The point is, I do the bare-minimum as a high school teacher and do this other job in the afternoon/evening so I am never around the school for anything I\\u2019m about to tell you o have happened. \\n\\nA month ago, during the time in which admin is deciding reappointments for next year, a scandal broke loose, set forth by students I can only describe as dangerous. \\n\\nA group of my 10th grade girls made a 30 second video of themselves joking around vaping in the bathroom and were saying my name alleging i \\u201cf*** someone named becky\\u201d and posted it on IG. Someone told the admin and I was immediately sent home with pay and barred from the campus. I was given a letter by the principal and it said I was being investigated for an inappropriate relationship with a student. \\n\\nFor 9 days I knew absolutely nothing and was left to my imagination to speculate what was going on until the HR investigator called me in for an interview. Then when i saw the video, i was immediately disgusted. Both police and HR questioned all the girls and they said they knew nobody named \\u201cbecky\\u201d and denied everything in the video to be true. After answering a few basic questions, i was exonerated and told I\\u2019d get a letter and just go back to work the next Monday.\\n\\nDuring the time i was out a student emailed me saying rumors were flying so i told the principal i need him to tell everybody this was all bogus. \\n\\nWhen i returned, i had to have security and the principal himself in each class at the beginning bc the kids were harassing me and threatening even though it was proven false. What i went thru that day was absolutely awful. It was SO AWFUL. \\n\\nI had to carry on for a few days but then yesterday, i had my reappointment meeting and was told i would not be offered a contract next year. Before this, i had high marks on all observations and was pretty much developing a great reputation among faculty and students. I was told by my instructional coach i was a \\u201cnatural.\\u201d \\n\\nNow im just using my vacation time to unwind and destress from one of the worst things anyone has ever done to me. I realized that these kids had nothing to gain from saying what they said and posting it publicly other than the satisfaction of turning my whole life upside down and destroying my soul. \\n\\nI already spoke to an attorney who said I had no case for anything. I figured so. \\n\\nLet my story be a lesson to anyone who gets into teaching even as a casual day-job like i did. You can\\u2019t make it work. There are kids out there nowadays who define what evil is. I bet even if i had a little family with a baby at home these kids would still destroy me with no remorse. Again, they actually believed these rumors despite what the principal said. \\n\\nAnd let me also say that everything that happened was because of how these kids videotape themselves and post it all publicly. \\n\\nWhat were once learning institutions have now turned into Tiktok challenge courses. Stay the hell away. I pray for the safety and well-being of all good-hearted teachers because those are the ones who always get hung out to dry like i did.\\n\\nEDIT: When i said \\u201ci do the bare minimum\\u201d i meant i don\\u2019t do anything other than the \\u201ctried-and-true\\u201d lesson plans that are pre-built by the county, and I don\\u2019t do sports/clubs. The pay as a teacher is not enough so I work a second job as an independent contractor, which has no health insurance. Since I was new in the game, i never tried to reinvent the wheel or get heavy involved since its not worth the pay.\"", "title": "Life ruined by 15 year olds!", "upvote_ratio": 0.94, "url": "https://www.reddit.com/r/Teachers/comments/131sjto/life_ruined_by_15_year_olds/"}, {"author": "totallabrat", "created_utc": 1699720271.0, "link_flair_template_id": "38a0f088-6a9a-11e8-ab9f-0e30a2dff32a", "link_flair_text": "SUCCESS!", "num_comments": 639, "post_id": "17sy18x", "score": 8451, "subreddit": "teachers", "text": "\"Flaired success\\u2026ish\\n\\nI am a second year 7th grade science teacher in a very large public school. \\n\\nI posted a couple of weeks ago about a disastrous observation I had- kids awful, yelling slurs to each other, admin not stepping in to help blah blah blah. I was convinced it was the worst observation ever and was ready to quit. I didn\\u2019t quit, I was told they\\u2019ve seen observations way worse, and I wasn\\u2019t even rated ineffective. I was rated developing, which isn\\u2019t good either, but for a second year teacher who never student taught or had guidance I figure I could be worse. The developing rating was for\\u2026you guessed it\\u2026.classroom management. My school is HUGE on praising the good (even the bare minimum) and restorative justice and all those jazzy words. So I\\u2019ve been making some drastic changes, but not in the way admin wants. But it\\u2019s working, so I don\\u2019t care.\\n\\nI\\u2019ve created a tally system. Every time I have to redirect a student, for any behavior, I add a tally next to their name. 5 tallies in one class = parent notification and office referral. At the end of every class, I put the total number of class tallies in a chart and at the end of every month the class with the fewest tallies will get a big prize (not bullshit school prizes they don\\u2019t care about). I\\u2019m talking chick fil a catered lunch, Dunkin\\u2019 Donuts\\u2026stuff they actually want. My students have started holding each other accountable because they really don\\u2019t want tallies. I\\u2019ve also come up with ways to take away class tallies from the total so that one class is who is bad doesn\\u2019t give up halfway through the month (but not individual tallies because students who behave badly still need their parents notified, even if they were angels in the last 10 min of class). The students who don\\u2019t care about the prizes and are acting up anyway are getting told off by the kids who do care. They don\\u2019t give a shit what I think but they care what their friends think. It\\u2019s working phenomenally\\u2026.better than any other strategy I\\u2019ve ever tried. I struggle the most with the kids who have zero intrinsic motivation, and this has helped me finally come up with something that resonates with them. They love the competition and I\\u2019m finally getting to teach. The students are also getting a visual representation through tally marks of just how often I have to stop doing my job (teaching) to correct their behavior. \\n\\nBut admin hates it because I\\u2019m \\u201clooking for bad behavior instead of praising the good.\\u201d\\u2026but that strategy wasn\\u2019t working for me. I literally can never win in admin\\u2019s eyes\\u2026but I finally feel like I\\u2019m winning in the classroom- participation is better, grades are improving, and bullying in my room has magically stopped. So admin can shove it.\\n\\nEDIT: I\\u2019m seeing a fair amount of comments that this is collective punishment and against the law, against the Geneva Convention, a War Crime, etc. but I\\u2019m genuinely curious about where that leap is coming from. Collective punishment is punishing a group of people for the actions of a few. I\\u2019m not punishing my classes at all. They aren\\u2019t getting extra work, they aren\\u2019t getting recess taken away, they aren\\u2019t getting lunch detention. I\\u2019m not punishing the bad classes, I\\u2019m rewarding the good ones. Right? The good students in every class have always been rewarded for their behavior through incentives in my class as well as school-wide ones. This is just an added one on the whole-class level. \\n\\nEDIT #2: I didn\\u2019t think this had to be said but if a child has an IEP, 504, or BIP those students\\u2019 plans are followed first and foremost and those students do not get penalized for manifestations of whatever the reason for their accommodations may be. The tallies are for students who display disruptive behaviors and interrupt the education of other students in class because they think it\\u2019s funny or that they are above the rules. \"", "title": "Finally seen a drastic improvement in student behavior…by doing the exact opposite of what my admin said to do", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/Teachers/comments/17sy18x/finally_seen_a_drastic_improvement_in_student/"}, {"author": "None", "created_utc": 1708392161.0, "link_flair_template_id": "71f2aa60-b428-11ee-8f12-fa0f499e77d1", "link_flair_text": "Just Smile and Nod Y'all.  ", "num_comments": 1858, "post_id": "1av4y2y", "score": 8420, "subreddit": "teachers", "text": "\"I\\u2019m a 10th grade language arts teacher in NJ. They don\\u2019t know how to read at their age. I\\u2019m serious\\u2026 2-3 grade reading levels, MAYBE. What the hell happened, and how did we get here? I have coworkers who said students who came from being homeschooled are at their appropriate levels even a bit higher than kids that have been in school since the pandemic \\u201chybrid\\u201d rules were lifted. I\\u2019m at a loss. The most they can get through is Charlottes Web or the bridge to Terabithia.. They\\u2019re rude, always on their phones, destructive. I feel like my school isn\\u2019t doing anything. I have lost my passion in the last 2 years. We have lost a tremendous amount of education for our kids. I would rather be an online teacher on outschool.com than deal with angry parents because their kids are failing. I need wine, I need something I don\\u2019t know what.\\n\\nEDIT:\\n1-I think I am going to teach 10th graders to read from scratch. Maybe it\\u2019ll help with the headache until the end of the year. \\n2- I don\\u2019t believe Covid is the issue. It\\u2019s the system and our county that doesn\\u2019t believe in education- just about showing off to others. \\n3- In my 14 years of teaching maybe a handful struggled but not as bad as the last 2 years. \"", "title": "They don’t know how to read. I don’t want to do this anymore.", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/Teachers/comments/1av4y2y/they_dont_know_how_to_read_i_dont_want_to_do_this/"}, {"author": "AndrysThorngage", "created_utc": 1685730566.0, "link_flair_template_id": "3df03460-146b-11e9-8e30-0ef5ea3c0604", "link_flair_text": "Classroom Management & Strategies", "num_comments": 997, "post_id": "13yklrl", "score": 8404, "subreddit": "teachers", "text": "\"I have a kid. Let's call him Merlin. He's been a pain all year.  Today, he was given a warning that if he got any more referrals this year, he would not be able to attend the end of the year party that we have (which is really fun).  I did not know that he had been told that.\\n\\nThen, he came to my class and proceeded to ignore every single expectation all class period.  I opened up a new email and started keeping a log.  From refusing to sit in his assigned seat, to repeatedly punching his friend in the arm, to refusing all assignments (even fun things like a Blooket), I just wrote it all down.  When he said, \\\"Stop talking to me, bitch\\\" when I asked him to keep his hands to himself, I sent it.\\n\\nThe principal was in my room in minutes and SHOWED HIM MY EMAIL.  It was literally just a list of his behaviors, no exaggeration or commentary, but now he's really, really mad at me.  He can't go to the party and, according to him, it's all my fault.  He takes no ownership over his behavior.  He was near tears and yelling in the hallway about \\\"that bitch,\\\" which is probably me (or the principal, but probably me).\\n\\n2 class periods left with him.\\n\\nEdit: I don't feel bad or guilty, I'm just surprised at how emotional he's being about this considering the consequences were clearly explained to him by admin. He's so very angry at me, but he knew that he was on super thin ice and continued to ignore rules. \"", "title": "Student banned from the last day of school party. Super pissed at me.", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/Teachers/comments/13yklrl/student_banned_from_the_last_day_of_school_party/"}, {"author": "Augustane", "created_utc": 1471965288.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 695, "post_id": "4z6yff", "score": 8261, "subreddit": "teachers", "text": "\"I'm a young looking 23 year old Asian guy. I was entering my first year teaching at the high school level. The first day was last week and I had told all of my department members I was going to do it. Some of them even helped set it up.\\n\\nThe day went hilariously.\\n\\nI wrote up on the board \\\"INSTRUCTIONS: Introduce yourself to as many people as you can and tell your *best* story!\\\" I had different coworkers come into my class period at the beginning of each prep and tell the students Mr. Augustane was running late making copies. My students were to begin the activity without me until I arrived.\\n\\nI wore a hoodie over my dress shirt and tie and brought one of my old backpacks. During the periods I sat down in the seats and introduced myself as the new student named 'Jeremy Lin' and told some of my best stories. Dates and age were changed of course, haha. About 5-10 minutes after introducing myself and hearing several students' stories, I would step to the front of the class and stand on a table, then reveal myself... to the shock of all of my students. It was pretty funny how some students who were quite ~~caddy~~ catty looked when they realized who I was.\\n\\nIn one period in particular, however, I was seated next to a gentleman who proceeded to tell me \\\"Oh man, this period is going to go APESHIT.\\\" The conversation continued like this:\\n\\nHim: I had [name], [name], and [name] in my ___ class last year and we ~~wrecked~~ wreaked havoc. We drove that teacher nuts.\\n\\nMe: Oh. [name], [name], and [name]?\\n\\nHim: Yeah. They're cool guys. I'm pretty sure we're going to eat this teacher alive.\\n\\nMe: Why?\\n\\nHim: He's a first year teacher. They never know what the hell they're doing. All they ever do is stick to the textbook and generally suck.\\n\\nMe: Do you know anything else about this Mr. Augustane?\\n\\nHim: No, not really, but he's probably going to be really slow and boring. First year teachers always are. He won't have control of this class. I don't think he'll be any good.\\n\\n\\nAt that moment, I put my hand on his shoulder, and said something along the lines of \\\"Don't worry buddy, I'm sure I'll do fine.\\\" before stepping up to the class and revealing myself. The class really did go apeshit, but for different reasons. (:\\n\\nThe look on that kid's face was priceless. I was sure to thank him for pointing out all the trouble makers for me afterwards.\\n\\nBy 5th and 6th period, all the students were scanning around trying to figure out where I could've been hiding. They were accusing different Asian students of being the teacher.\\n\\nOverall it was a great start before laying down the rules and syllabus the following day. I was nervous it was going to be a terrible idea, but now my students won't stop joking about it.\\n\\n**TL;DR: Pretended to be a student. Found out my trouble makers and sent my students for a loop.**\\n\\n[Proof](https://www.youtube.com/watch?v=E9czAaLoaeY)\\n\\n***Final ninja edit:*** If you're still reading this three and a half years later, I'd like you to know that I'm definitely still teaching. Going into year four now. The love for the job as never changed. If you're a new teacher like I was in this post/video, just so you know, the job gets easier. It gets significantly easier around the three-year-mark. \\n\\nMy advice? Try to have fun with your kids if you can. The antics don't have to be anywhere as crazy as pranking your kiddos, but you can still try to have fun every single day. *You* control what happens between your four walls. That's how I personally get excited for every day of a school year and am still in love with this job.\\n\\nI hope my advice helps someone out there.\\n\\nHang in there and keep on educating those kiddos!\"", "title": "I pretended To Be a student on the first day [first year teacher]", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/Teachers/comments/4z6yff/i_pretended_to_be_a_student_on_the_first_day/"}, {"author": "gilmore0918", "created_utc": 1683682428.0, "link_flair_template_id": "fe0a214e-146a-11e9-893d-0e90c126802c", "link_flair_text": "Teacher Support &/or Advice", "num_comments": 990, "post_id": "13dclyn", "score": 8143, "subreddit": "teachers", "text": "\"Our after school professional development today was led by a school police officer. It was about active shooter situations. The officer mentioned at least three times that every teacher he knows would protect their (students) babies and save them. \\nAt the questions portion I raised my hand and told my colleagues that we all have permission to not die for our students. That we are allowed to think of ourselves and our own families first. The officer even agreed and said that he couldn\\u2019t say it but he\\u2019s glad someone did. \\nNow I think my mentor/only close friend on campus and my principal hate me. Cool. \\nAITA?\\n\\nEDIT: wow. I wrote that last night just to get it off my chest. It\\u2019s 30 minutes before school starts today I was dreading coming in today. I\\u2019m sure all eyes are on me. And it\\u2019s awkward af. But reading these comments and seeing all the support is really helping me get thru this day. Thank you everyone.\"", "title": "Told my colleagues we didn’t have to die for our students. I’m pretty sure my principal hates me now.", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/Teachers/comments/13dclyn/told_my_colleagues_we_didnt_have_to_die_for_our/"}, {"author": "Didsomebodysayringo", "created_utc": 1696509247.0, "link_flair_template_id": "fe0a214e-146a-11e9-893d-0e90c126802c", "link_flair_text": "Teacher Support &/or Advice", "num_comments": 818, "post_id": "170gu05", "score": 8104, "subreddit": "teachers", "text": "\"Yesterday a child in my class hit me in the face three times and destroyed my classroom. He was throwing chairs and supplies everywhere. I had to evacuate my classroom. Kids were crying, I was crying, it was very traumatic. The kept the child in the office and did not send him home because \\u201cthat\\u2019s what he wants\\u201d. He isn\\u2019t getting any suspension at all. The kids are scared. I have parents asking me if the child will be there today and I just directed questions to the office. I am still so upset and I shouldn\\u2019t be scared of a 5 year old but I am. My union rep said I had every right to stay home today and I hope this proves a point. I\\u2019m not going to just take it.\"", "title": "I’m not going to work today", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/Teachers/comments/170gu05/im_not_going_to_work_today/"}, {"author": "Ok_Stable7501", "created_utc": 1685289652.0, "link_flair_template_id": "001e3cdc-6b46-11e8-83b1-0e104432f86c", "link_flair_text": "Humor", "num_comments": 4367, "post_id": "13u3wr9", "score": 8065, "subreddit": "teachers", "text": "\"When I was in high school, we counted the days until we could drive. Now so many students don\\u2019t get a license. I don\\u2019t think it\\u2019s the cost (at least in my area) \\u2026 they just are completely content having people drive them and don\\u2019t want the responsibility. We wanted the freedom. And they can\\u2019t be bothered. I\\u2026 don\\u2019t\\u2026 get\\u2026 it\\u2026\\n\\nEdit: so, I hear you and I understand the logistical reasons: cars are expensive, dangerous, we have Uber now. But kids still don\\u2019t want to get in a car with friends and get away from their parents? Go to a concert or the beach or on a road trip? I\\u2019ve asked students why the don\\u2019t have licenses, but asking if they want to be free to go where they want with their friends would lead to angry parent phone calls, or being fired.\\n\\nEdit 2: are kids doing some things we us do with friends (first concerts) with parents instead and have no need to drive themselves? And to clarify, I work with kids who are younger, and have some chances to ask them this, but most students are too young.\\n\\nEdit 3: I think a lot of people are still missing my point. Not asking why teens don\\u2019t buy cars, but why they are not learning how to drive at all. Are they going to learn later, Uber and get rides forever, or do they just all plan for remote work? Also, lived abroad and my friends all drove. Mopeds.\"", "title": "When did students stop caring about getting a drivers license?", "upvote_ratio": 0.79, "url": "https://www.reddit.com/r/Teachers/comments/13u3wr9/when_did_students_stop_caring_about_getting_a/"}, {"author": "None", "created_utc": 1693527335.0, "link_flair_template_id": "3e476a5c-db64-11ea-a983-0ee7daf6e7e9", "link_flair_text": "Student or Parent", "num_comments": 892, "post_id": "166rtyq", "score": 8048, "subreddit": "teachers", "text": "\"I teach 8th grade so I am beyond mortified that my Kindergartener's teacher sent me a message today explaining that my kid is a nightmare in class.\\n\\nHe tells her \\\"no\\\" to every instruction. He throws a fit when he can't use the color crayon he wants. He pulls the I'm-going-to-cry to get out of trouble card. Of course when we try to talk to him about it, all reports at home are that school is going great. We're really big on respect at home. It's all \\\"yes, ma'am/sir\\\" here. We explained that the Teacher is the boss, etc. He's been in 2 years of preK. School structure isn't new to him. He has consistent behavioral consequences at home. I explained to the teacher our usual response to behavior corrections. They align to her classroom policies. I told her we fully support whatever behavioral management plan she wants to try. \\n\\nWhat else can I do to help? There's a reason I teach 8th. I couldn't imagine dealing with 25 defiant mini humans that have near-zero reasoning skills. I don't want her day to be any harder than it is.\"", "title": "My kid is THAT kid", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/Teachers/comments/166rtyq/my_kid_is_that_kid/"}, {"author": "magnanimous14", "created_utc": 1694830100.0, "link_flair_template_id": "fe0a214e-146a-11e9-893d-0e90c126802c", "link_flair_text": "Teacher Support &/or Advice", "num_comments": 4692, "post_id": "16jvm5r", "score": 7844, "subreddit": "teachers", "text": "\"We just had our first student council meeting. In order to become a part, you had to submit a 1-2 paragraph explanation for why you wanted to join (the council handles tech club, garden club, art club, etc.). The kids are 11-12 years old. \\n\\nThere was 46 girls and 5 boys. Among the 5 boys 2 were very much \\\"besties\\\" with a group of girls. So, in a stereotypical description sense, there was 3 non-girl connected boys. \\n\\n\\nMy heart broke to see it a bit. The boys representation has been falling year over year, and we are talking by grade 5...am I just a coincidence case in this data point? Is anyone else seeing the girls absolutely demolish the boys right now? Is this a problem we need to be addressing? \\n\\nThis also shouldn't be a debate about people over 18. I'm literally talking about children, who grew up in a modern Title IX society with working and educated mothers. The boys are straight up Peter Panning right now, it's like they are becoming lost\"", "title": "Is there anyone else seeing the girls crushing the boys right now? In literally everything?", "upvote_ratio": 0.85, "url": "https://www.reddit.com/r/Teachers/comments/16jvm5r/is_there_anyone_else_seeing_the_girls_crushing/"}, {"author": "whoknows-whocares", "created_utc": 1698108145.0, "link_flair_template_id": "3df03460-146b-11e9-8e30-0ef5ea3c0604", "link_flair_text": "Classroom Management & Strategies", "num_comments": 2724, "post_id": "17ezzna", "score": 7820, "subreddit": "teachers", "text": "\"I was so dumbfounded that a student had the gall to answer her phone and openly have a conversation in the middle of my class period!!! I stood there in shock for a second and when she hung up I held out my hand to take her phone. The policy has been so clear all year - if I see it I take it. She refused to give it to me, saying \\u201cit was my mom, it\\u2019s an emergency\\u201d. It clearly states is my syllabus uncooperative students will have their phone sent to the office, so just said \\u201cI\\u2019m not going to argue with you about it\\u201d so I wrote her up and sent her out. \\n\\nLater in the day I get an email from my admin that the parent wants to meet with me about some \\u201cconcerns\\u201d. What the heck!! I feel totally unsupported by my admin here. They should have told the parent that answering the phone in class is unacceptable. I see no reason for this meeting to occur. \\n\\nAm I being such a boomer about this??? It\\u2019s crazy to me that there\\u2019s debate around a student answering her phone DURING class time? It\\u2019s so disrespectful!\\n\\nUgh! Parents! Stop calling your kids during school!!! If there is an emergency, call the office! What kind of \\u201cemergency\\u201d could possibly be occurring where you need to call your 16 year old in the middle of a class period. Omg I am so frustrated and annoyed by this situation.\\n\\nEdit: \\u201cmom mom\\u201d -> \\u201cmy mom\\u201d\"", "title": "A student answered her phone during class. I sent her to the office. Now parent wants a meeting.", "upvote_ratio": 0.85, "url": "https://www.reddit.com/r/Teachers/comments/17ezzna/a_student_answered_her_phone_during_class_i_sent/"}, {"author": "None", "created_utc": 1663516178.0, "link_flair_template_id": "001e3cdc-6b46-11e8-83b1-0e104432f86c", "link_flair_text": "Humor", "num_comments": 753, "post_id": "xhk5he", "score": 7781, "subreddit": "teachers", "text": "\"I\\u2019m not saying it\\u2019s the only reason, but I firmly believe it\\u2019s a major factor in why kids today can hardly pay attention longer than 3 minutes.\\n\\nAlso wanted to share another thought I had. I saw this comment on a post I made a month ago, and it summed up my thoughts perfectly: kids today don\\u2019t know how to be bored. This constant (over) exposure to phones/tablets has hard-wired their brain to need constant stimulation and now they just don\\u2019t know how to be alone with their thoughts.\"", "title": "Agree or disagree: Tiktok (and social media in general) is a major contributing factor in this generation’s decline in attention span", "upvote_ratio": 0.92, "url": "https://www.reddit.com/r/Teachers/comments/xhk5he/agree_or_disagree_tiktok_and_social_media_in/"}, {"author": "DontBopIt", "created_utc": 1709643616.0, "link_flair_template_id": "001e3cdc-6b46-11e8-83b1-0e104432f86c", "link_flair_text": "Humor", "num_comments": 331, "post_id": "1b74mow", "score": 7728, "subreddit": "teachers", "text": "\"No joke. A parent wanted to send me a graduation announcement for their kid, which is awesome and I genuinely think their kid is freaking amazing! However, I told them to just send it to the school and I'll get it (I teach at a vocational school and not at their kid's main school). They got upset because they wanted to send it to my personal address because it would \\\"mean more\\\" and \\\"be more personalized\\\". I told them I wasn't comfortable giving out my information to anybody and that I hoped they understood.\\n\\nCome yesterday, I got called to my principal's office and had a meeting with them and the parent because they were upset. They said they felt like I was calling them a stalker or a danger to me because I wouldn't give them my personal address. \\ud83e\\udd23 My principal didn't know this was coming because the parent lied to them on what the meeting was about and told the parent that I wasn't mandated to give any information out.\\n\\nParents are some of the dumbest creatures on this planet...and I'm including sloths in that statement.\\n\\nEDIT:: I'm gonna go ahead and add in this edit to say I still think sloths are dumb, but they ARE adorable. \\ud83d\\ude02 I'm not one to go back on my word and I don't want y'all to think that, but I just know I love sloths to death and shout out to the person that referenced the video of the sloth laying down eating the carrots off the plate! Lol\\n\\nAlso, to answer a question that was brought up, I have no idea what the parent said to get the meeting, but all I know is that they lied to set it up and the principal didn't know what was going on other than they were mad at me. My principal is one of the rare good ones that'll go to bat for me.\\n\\nEDIT #2:: Why are there so many accounts with \\\"sloth\\\" in the name?! \\ud83d\\ude02\"", "title": "I had a meeting with a parent and my principal because I didn't give out my personal address", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/Teachers/comments/1b74mow/i_had_a_meeting_with_a_parent_and_my_principal/"}, {"author": "Old-Bend-3014", "created_utc": 1644069023.0, "link_flair_template_id": "38a0f088-6a9a-11e8-ab9f-0e30a2dff32a", "link_flair_text": "SUCCESS!", "num_comments": 1010, "post_id": "sl7dw9", "score": 7679, "subreddit": "teachers", "text": "\"My students have been disrespectful all year, and normally I take it in stride and don\\u2019t let it rile me up, but I lost my temper Thursday during 3rd period. \\n\\nI\\u2019m writing on the whiteboard and one of my more problematic students is walking around the class, knocking students water bottles off their desk, grabbing their pencils, pushing their papers on the floor etc.\\n\\nI turn around and tell him to sit down. He says, \\u201cor what?\\u201d And I tell him, \\u201cor I can call school security to escort you out and then end the day with a phone call to your dad. This is not a negotiation and I am not going to waste time explaining to you how a 13 year old is supposed to behave. If you want to spend today not learning anything, then sit down and distract yourself, the rest of your classmates actually came here to accomplish something.\\u201d \\n\\nHe immediately sits down. Now this kid thrives off of attention, hates being removed from the classroom, and it\\u2019s important to note his father is extremely involved and does NOT let him mess around, so he hates when you call him. This kid also doesn\\u2019t like \\u201closing\\u201d and I can tell he is FUMING that I\\u2019ve \\u201cchallenged him.\\u201d \\n\\nSo he starts doing that thing kids do where they mutter loudly under their breath because they want you and the class to hear what they say, but also want plausible deniability if you call them out on it. \\n\\nHe\\u2019s talking about how I\\u2019m a bitch and it doesn\\u2019t really bother me, but it\\u2019s distracting, so I turn around and ask him if he wants to share something with the class. \\n\\nHe says it louder, and I respond in a flat, monotone voice with no facial expression, absolutely I am, thank you for pointing out the obvious.\\u201d Some of the kids giggle and one says \\u201cMs._____ stays unbothered.\\u201d And this sets the kid off even more...so he threatens me. \\n\\n\\u201cYou always talk shit because you think being a teacher is going to protect you. You always run your mouth, but I bet if I socked you in the face you wouldn\\u2019t keep running it. You better watch out, etc. etc.\\u201d\\n\\nAt this point I\\u2019ve had it with this kid, and to be frank, with all kids that are under the impression that we as teachers are pushovers or don\\u2019t have comebacks just because we exercise self-control and have certain things we can\\u2019t say/do without fear of losing our jobs, so I respond in probably not the most professional manner.\\n\\nI tell him I in fact, do know how to fight and that my hands are rated 18+ when it comes to boxing. I tell him I\\u2019m not going to risk my job over a student that lacks the ability to shut his mouth for more than three seconds, but if he manages to graduate high school, he can find me afterwards and I\\u2019ll be more than happy to meet his threats in kind. I tell him if it\\u2019s a fight he wants, just remember my email and we can arrange it in about six years.\\n\\nHe goes home and tells his mom (it\\u2019s her week with him) and the next thing I know I have a meeting with her and the principal.\\n\\nI was fully expecting to be fired, and at this point I\\u2019m so exhausted that I couldn\\u2019t really bring myself to care, so imagine my shock when I tell admin my side of the story and he tells me not to speak in the meeting and let him handle everything.\\n\\nThe mom comes in screaming talking about I threatened her son and he feels unsafe, yadda yadda. The principal cuts her off and says if anything her son threatened me and that I\\u2019m traumatized. He looks at me to back up his claim and I nod my head yes.\\n\\nHe says that if both I and my student feel like we cannot be in the same classroom, then it is his duty to protect both of us and maybe it\\u2019s time for her son to be moved to a different class group (the behavior issue pod). The son starts panicking because he doesn\\u2019t want to be removed from all his friends and the mom starts cussing out the principal saying that\\u2019s not his decision. \\n\\nHe tells her she\\u2019s absolutely right, it\\u2019s mine because I\\u2019m the one the kid threatened. The kid immediately started apologizing to me and begging to be allowed to stay. I asked for the weekend to think about it and my principal said absolutely. Since then, I\\u2019ve received three emails, one from the dad apologizing for the son\\u2019s behavior and telling me to do as I see fit, one from the mom saying I\\u2019m ruining her son\\u2019s middle school experience, and one from the kid apologizing and begging me not to switch him. \\n\\nI know I shouldn\\u2019t, but based off the kids reaction I actually kind of feel guilty for moving him. At the same time, he causes all the teachers and a fair amount of the students a massive headache on a daily basis. I still don\\u2019t know what to decide.\\n\\nUPDATE: Thank you for all the advice and support, it is very much appreciated and I wish I could respond to each and every one of you.\\n\\nI reached out to my team members through text and it was quickly decided that the kid needs to be removed. While we all differed on for what length of time (one of my coworkers wanting him gone for the rest of the year), we decided on a month trial basis. Now we are not going to tell him it is only a month, but we think any less than that would not show us whether or not there is a true behavior change. We will draft a contract with all our signatures saying that he has to earn his way back into the classroom and if the behavior returns, he will be sent back to the behavior pod with no chance of return for the rest of the year. \\n\\nI do want to address some of the hate messages I got, as it is clear many people don't now what it is like to be a teacher in this current climate. \\n\\n1. For those saying I should have just \\\"called the security the first time,\\\" our school only has security once a week, on random days, and we are never notified when they are on campus. When a kid is being extremely bad, you just have to hope that either A) security is there, or B) the threat of calling them is enough to make the kid calm down. Schools are severely understaffed across the board - there is a lack of teachers, paraeducators, bus drivers, janitors, etc. Some of our classes have 36 kids in them at a time and that amount is already hard to juggle when they are al well-behaved. So for those of you criticizing me, or claiming that this could never happen because kids could not possibly be this bad, put your money where your mouth is and come volunteer at your local public school. \\n\\n2. For those asking me why I hadn't moved him to the behavior pod already, I think you are severely overestimating the amount of power teachers have. That decision is almost never left up to us. In this case, this student has had so many complaints of violence and disrespect documented that the school is finally able to do something. Teachers deal with verbal and mental abuse on a daily basis, and this last year is some of the worst I have seen when it comes to them actually facing physical violence. A kid told one of our teachers she hopes her baby has a miscarriage and dies, and another kid punched our PE teacher in the face when he tried to break up a physical altercation and was allowed back into the school a week later. \\n\\n3. For those of you telling me to take time out my day to \\\"mentor\\\" him. I know you mean well, but I genuinely ask you with what time am I supposed to do that? Teachers already work 20-40 extra unpaid hours a week. Most that I know dedicate 5 am to 8 pm doing lesson planning, grading, making parent phone calls, creating seating charts, etc. The only time would be after school, and I am not meeting one-on-one with a kid who threatened to punch me in the face. Nor, to be frank, should I have to. I have a lot of students who I have built personal connections with, who feel like they can trust me, who tell me my classroom is their safe space. These kids have overcome some crazy adversities, and yes, at the beginning of the year, some of them did not like me/talked back to me; but never did they threaten me, and that makes all the difference to how far I am willing to go for them. Sorry-not sorry. \\n\\n4. Lastly, for those who are claiming I actually did \\\"threaten\\\" the child, you are intentionally ignoring the fact that I stated I would never get into a physical fight with a minor. I meant it when I told him there is no point in trying to fight me, because I am not going to put my hands on a child; however, just because he is a kid does not mean he gets to make threats to my physical safety. Half of my students are way bigger than me, and their age does not preclude them from actually being able to hurt me. No one has the right to threaten to punch someone in the face because they didn't get their way and just because were adults doesn't mean we have to let them. In the real world, if a 13 year old walked up to an adult who wasn't a teacher and tried to fight them, that adult would have every right to fight them back. The kids should learn sooner or later, before they find themselves facing assault charges as adults.\\n\\nNow it is time for me to be a bit rude, but I feel I have to be a bit blunt with some of the parents in this sub. I hate to break it to some of you, but you have failed at your job. When teachers returned to the classroom after COVID lockdown, we dully expected their to be academic and maturity deficits, what we did not expect was for you to neglect your child for damn near two years and not teach them how to be good people. Some of you confuse the responsibilities of parenting and teaching. It is not up to us to teach your children how to be good people, they should be learning that at home, and if they aren't, chances are it is because you are not equipped to teach them because you yourself are not a good person. We have to stop using trauma as an excuse for kids being extremely disrespectful. There are people who spent their childhoods during great world wars, who spent their childhoods facing constant unfettered racism, who spent their childhoods unable to even think about being true to their identities because of the brutal time period they lived in, yet we are only seeing these off the wall behaviors emerge in the last ten years. That is telling.\"", "title": "Went into a meeting thinking I was going to get fired for a verbal exchange I had with a student, and the principal took my side!", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/Teachers/comments/sl7dw9/went_into_a_meeting_thinking_i_was_going_to_get/"}, {"author": "Head_Spirit_1490", "created_utc": 1706125260.0, "link_flair_template_id": "4433b45a-146b-11e9-a469-0ee696cc69a0", "link_flair_text": "Policy & Politics", "num_comments": 1234, "post_id": "19ep7ew", "score": 7681, "subreddit": "teachers", "text": "\"I work at a high school in special education resource room. I have a student who does NOTHING. Sits on his phone, ignores my prompts or any support, sometimes he props his feet up on the desk and when I tell him not to, he looks at me and then right back to the phone. He has been a project for me for two years. One day I sat next to him and tried to have a heart to heart. Asked him what was up? Was he self-sabatoging because he\\u2019s a senior and doesn\\u2019t know what he will do after high school? \\n\\nI shit you not. This is what he says:\\n\\n\\u201cMy mother said there\\u2019s this thing called No Child Left Behind so I will still graduate even if I do nothing.\\u201d \\n\\nI stood up in amazement, went to my desk and just sat there. He\\u2019s not wrong. I\\u2019ve seen kids in our district with chronic absences and complete little to no work and we still hand them a diploma. I\\u2019m very concerned about the future.\"", "title": "Actual conversation I had with a student", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/Teachers/comments/19ep7ew/actual_conversation_i_had_with_a_student/"}, {"author": "Jormungandr315", "created_utc": 1683458583.0, "link_flair_template_id": "4433b45a-146b-11e9-a469-0ee696cc69a0", "link_flair_text": "Policy & Politics", "num_comments": 555, "post_id": "13aky9q", "score": 7611, "subreddit": "teachers", "text": "\"Holy hell, who green lit this official statement?  I feel like this would be a press release from Michael Scott. Personal gems from the Virginia School Board's filing:\\n\\n1) Stating that since she was injured at work, this is simply a case of workers compensation. \\n\\n*\\\"Plaintiff was clearly injured while at work, at her place of employment, by a student in the classroom where she was a teacher, and during the school day,\\\" the school board said.\\\"*\\n\\n2. OFFICIALLY STATING it's unreasonable for teachers to expect students not be a danger to them.\\n\\n*\\\"...also argues against Zwerner's assertion in her lawsuit that she reasonably expected she would be working with elementary-aged children who wouldn't be a danger to her. The district cited cases of violence against teachers by students from across the country and in Newport News.\\\"*\\n\\n3) And my personal favorite....arguing that Abigail Zwerner focuses on the use of a gun in the attack to sensationalize the story. LIKE IT IS NOT BECAUSE SHE WAS SHOT WITH A GUN, NOT A BOSTICH  SHARPNER.\\n\\n*\\\"This is exactly why Plaintiff strategically focuses on the use of a handgun as opposed to some other weapon with less perceived notoriety and shock value, even though serious injuries can be inflicted with scissors, knives, pencils, rocks, chairs, and hands.\\\"*\\n\\n*The district argued if the child had stabbed Zwerner in the neck with sharp scissors rather than shooting her with a gun, there would be no question the injury would fall under workers compensation.\\\"*\\n\\n\\nI have no words.\"", "title": "Virginia school board says teacher shot by 6-year-old should get workers' comp, not $40 million from lawsuit", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/Teachers/comments/13aky9q/virginia_school_board_says_teacher_shot_by/"}, {"author": "PuffPoof215", "created_utc": 1699980383.0, "link_flair_template_id": "001e3cdc-6b46-11e8-83b1-0e104432f86c", "link_flair_text": "Humor", "num_comments": 134, "post_id": "17v6di0", "score": 7513, "subreddit": "teachers", "text": "\"A student just emailed me \\\"Hey, why did you mark me absent in class, I was there.\\\"\\n\\nI am not there today to mark people absent in the first place so I found this strange. But I humored him. \\n\\nI emailed back \\\"Why didn't you come up to me after the lesson I taught and correct me.\\\"\\n\\nHe emails back. \\\"I was too busy listening and doing the notes so I forgot.\\\"\\n\\nYeah sure bud.\"", "title": "I am out sick today and this happened", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/Teachers/comments/17v6di0/i_am_out_sick_today_and_this_happened/"}, {"author": "DuckterDoom", "created_utc": 1690939107.0, "link_flair_template_id": "38a0f088-6a9a-11e8-ab9f-0e30a2dff32a", "link_flair_text": "SUCCESS!", "num_comments": 358, "post_id": "15futfw", "score": 7504, "subreddit": "teachers", "text": "\"Our presenter for social studies from the district came back from our lunch and wanted us all in a circle to do, yet another, icebreaker.  I asked her why we were doing this since we all know each other and it was a waste of time.  You'd have thought I ran over and kicked her dog.  Nonetheless she asked the crowd if they wanted to do her \\\"activity.\\\"  They all said no.  We didn't do it.  I had no idea I had this kind of power.  Maybe I got bit by a radioactive teacher or something but having it feels good.\"", "title": "I did the unthinkable!", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/Teachers/comments/15futfw/i_did_the_unthinkable/"}, {"author": "Prime_Kin", "created_utc": 1676494983.0, "link_flair_template_id": "3e476a5c-db64-11ea-a983-0ee7daf6e7e9", "link_flair_text": "Student or Parent", "num_comments": 320, "post_id": "1138gr4", "score": 7497, "subreddit": "teachers", "text": "\"Someone got ahold of my personal cell phone number. What proceeded was about 80 calls during the school day, on the weekend, and at night from \\\"private number\\\".   All hangups or robo voice requests for personal information. I'd have blocked private numbers, but my wife is pregnant and I was worried about missing any important calls, like from a hospital or ambulance. I suspected it was a student of mine from the background noise. \\n\\nI filed a police report in my district. No speedy action was taken, so I filed another in the town in which I live. The investigator contacted my carrier, found what number the private calls were coming from, and tracked down the caller as a student in my school. \\n\\nWhat followed was about three months of off-and-on investigation, ultimately winding up with the kid, his dad, and me in court with the kid facing juvenile cyber harassment charges. The dad tried to get me to drop the charges by pleading, yelling, begging, and screaming. I didn't. My district tried to get me to drop the charges. I asked what punishment the kid had faced so far. The answer was none, so I paralleled their answer. \\n\\nThe judge asked me what remediation I thought was appropriate. I simply stated that the child was not trustworthy with a phone, and did not respect personal boundaries. I also explained the stress this put me under, the wakeups and the worry due to my wife being pregnant. \\n\\nThe final ruling was that the child was placed under a 36 month injunction where they were not allowed to own, possess, or operate a cellular phone, up for review in 12 months. Everyone but me was in outrage, district included, but I really don't give a darn. \\n\\nKids have been awfully careful about using their phones appropriately in the building since, and as it was a personal conflict and not a work one, everyone involved just seems to be ignoring that it ever happened. It's a win all around, as far as I'm concerned. \\n\\nFile the damned police report, people. Maybe nothing happens, but maybe something will.\"", "title": "File the dang police report.", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/Teachers/comments/1138gr4/file_the_dang_police_report/"}, {"author": "MickIsAlwaysLate", "created_utc": 1707666563.0, "link_flair_template_id": "3df03460-146b-11e9-8e30-0ef5ea3c0604", "link_flair_text": "Classroom Management & Strategies", "num_comments": 1697, "post_id": "1aoayty", "score": 7438, "subreddit": "teachers", "text": "\"UPDATE: Holy shit, I can\\u2019t believe this reached as many of you as it did! I'm still reeling TBH, and I'm trying to respond to all of the question comments. And sending ALL the spiritual caffeine and duct tape to all of y'all out here suffering. \\n\\nI'm not quitting these kids\\u2026not yet. In the meantime, I think this is a call to start my second novel \\u201chighlighting the lowlights\\u201d of teaching (to borrow a quote from the incomparable Ryan Sickler) through a comedic lens. \\n\\n If any of y'all are interested in the first one, it's called Adventures in Subbing: The Life and Times of a Classroom Mercenary. I *completely* believe we can change this course, but it\\u2019s going to be an \\u201cAll hands on deck\\u201d situation and it\\u2019s going to be what feels like a lifetime before it gets better. But I honestly believe it will\\u2026\\n\\n\\n\\nSorry, long one incoming. \\n\\nTL;DR 14th year teacher\\u2014 is this the beginning of the end?\\n\\nI really, *really* try not to believe that we\\u2019re in the Idiocracy (aka The Darkest) timeline, but y'all...dark days are coming. \\n\\nI teach 9-12 ELA, and the one thing ALL grades seem have in common is a \\u201cone and done\\u201d aesthetic. I always give kids a chance to boost their grade with revisions, but less than a third ever even try. \\n\\nWorse yet, I have parents complaining that little Jeff turned in a one page essay and doesn\\u2019t have an A. When I show them that Jeff refused to turn in a revision, didn't address the prompt and had 15+ spelling errors on a *digital assignment*, the parents just stare, stone faced, and say \\u201cbut you assigned a one page essay, and he turned in a one-page essay.\\u201d \\n\\nThe majority of parents that I encounter, unfortunately, are in this \\u201cI\\u2019m gonna be my child\\u2019s best friend\\u201d zone, so more now it's a 2- (or even 3-) on-one battle. Or, worse yet, they disregard the mountains of missing work, and ask \\u201caren\\u2019t there any extra credit assignments they can do?\\u201d \\n\\nMy sister in Christ, your child has a 22% in this class, because they didn\\u2019t turn in any of the work and bombed all of the tests. What extra credit could possibly equal a 40% shift in their grade? And then, I cave slightly, and allow them to turn in months old work for 30% of the credit. \\n\\nTHEN, THEY PUSH BACK AGAIN WHEN THEIR KID IS STILL FAILING!\\n\\nLuckily, I\\u2019ve had admin defending me for holding the line and expecting better of my kids. That\\u2019s legitimately the silver lining. But I imagine even that will have a shelf life.\\n\\nLiterally 95% of my tests are open notebook.  I painstakingly go over content, and literally say things like \\u201cthis is DEFINITELY something I'd want to have in my notebook!\\u201d And still, less than half of them ever write anything in their notebook aside from sketches of anime characters. \\n\\nI became a teacher to help build resiliency in our kids, and show them how to be problem-solvers, and assets to our community at large. But between the apathy, the lack of structure at home, and the \\u201cI\\u2019m gonna be my child\\u2019s best friend\\u201d play, it becomes extra challenging. \\n\\nWe can\\u2019t fill positions, we\\u2019re constantly understaffed, our student numbers get bigger, and our students with exceptional needs quota is off the charts. Neurodivergent students make up almost 35% of my inclusion model classroom, with another 25% who would absolutely qualify for a 504+. But both neurotypical and neurodivergent students have one thing in common: they don't give a shit. \\n\\nAlmost every kid tells me they don\\u2019t go to bed until 1am (but that they're \\u201cin bed\\u201d by 9), and more than half show up in their pajamas, wrapped in fleece blankets, clutching their Starbucks/Stanley, but leaving everything but their (uncharged) laptops at home. \\n\\nIs this going to be our new normal?\\n\\nEdit: grammar \\n\\nEdit 2: update \"", "title": "It’s going to get worse, isn’t it?", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/Teachers/comments/1aoayty/its_going_to_get_worse_isnt_it/"}, {"author": "Pike_Gordon", "created_utc": 1703430246.0, "link_flair_template_id": "52ff1c72-db2f-11ea-946d-0eaed2f57979", "link_flair_text": "COVID-19", "num_comments": 858, "post_id": "18pwvt4", "score": 7435, "subreddit": "teachers", "text": "\"I flaired it COVID, but these assholes sent a kid in my class with the flu on Tuesday, Dec 19.\\n\\nOn the 21st, my last day at school I developed symptoms. I've been isolated at home alone since then. I've missed my best friends group Christmas party, a date I was thrilled about, and I can't spend Christmas with my widowed mom.\\n\\nI looked at that child when they walked and said \\\"you look like death.\\\"\\n\\nHer parents told her she was tired from staying up late. She was up late because she was coughing all night.\\n\\nI'm sincerely depressed right now and made it an entire semester without getting sick. This is the kind of shit that makes me want to go nuclear on a parent and call them Christmas day lmao.\"", "title": "Parents who sent their kids to school with the flu can fuck right off", "upvote_ratio": 0.92, "url": "https://www.reddit.com/r/Teachers/comments/18pwvt4/parents_who_sent_their_kids_to_school_with_the/"}, {"author": "Jeromiewhalen", "created_utc": 1493865347.0, "link_flair_template_id": null, "link_flair_text": null, "num_comments": 781, "post_id": "694yxi", "score": 7415, "subreddit": "teachers", "text": "\"Edit #2: This blew up, so I wanted to put at the top if they ever see this: THANK YOU YEARBOOK CREW! Deadline is tomorrow and they are still working as we speak (12:00 AM EST). Your hard work is why it's worth it!\\n\\nI wrote this as a comment in a post today but I feel like it needs to stand on it's own as well. To start: I don't work for Treering, but this all came out of a post about potentially switching to Treering for yearbooks. I think it's really important to understand how Jostens did the smoke and mirrors routine for years until they finally got caught. Here it goes:\\n\\nAs technology teacher, I took over yearbook advising last year to raise funds for our tech department. Immediately upon taking over I was sent invoices from Jostens in the amount of ~~$5,000~~ $4,748.34. What? How do we OWE for a yearbook that costs $78 (price goes from $55 to $78 by the end)? Where is the money going? That question led me down the biggest and shadiest rabbit hole I have ever seen. \\n\\nFirst, when asked to send an itemized invoice, Jostens was hesitant. Finally, after persistence, I got it, and low and behold the numbers just didn't add up.\\n\\nWhy? Well first off I had nothing to go off of because they had not sent a contract IN THREE YEARS, so I could not even refute pieces of any agreement. Secondly, a line item showed up in the top right in small print on our invoice saying \\\"production fee\\\". What was this? After pressing again, Jostens was making us pay $100 FOR THE FIRST 50 BOOKS, AND WE WERE SELLING THEM FOR $55 a piece! That's right; our kids were buying books for negative fundraiser profit. No mention of this in any contract. No mention of this even on the line items in the itemized invoice. Nothing.\\n\\nSo I go down the lines and - oh hey! - we are getting charged ~~$1500~~ $860 for \\\"advertising materials\\\", . Sweet. I never asked for this, you just sent a box of posters. If we made them ourselves it would have cost us maybe $50. But tack on another ~~$1500~~$860, awesome.\\n\\nSo I'm already at our wits end by the time the books arrive, and things get even better. I count the books and while we ordered 320, we received ~~375~~365. Why do we have so many extras? JOSTENS SENT US THEM WITHOUT OUR PERMISSION, AND CHARGED US! They claimed it was for kids who forgot to order them so we could sell them, but if you look at the numbers of books it conveniently brought the small amount of profit we made to zero. They then want you to return the books by a certain date (usually in the summer) for a credit refund. JOSTENS ZEROS YOU OUT WITH EXTRA BOOKS AND HOPES YOU DON'T SEND THEM BACK.\\n\\nYou think that's the end? Oh boy, not even close.\\n\\nSo after months of being pushed around, I made it one of my absolute priorities to get these kids the most money I could back. I nit-picked every little detail, knowing full well that Jostens had no legal ground on things because no contract was signed and our students had paid a lot of money to this shady company. I argued about advertising, I contested them about the extra books, everything. In all, Jostens waived around $5000 in money owed. Think about that for a second. Jostened erased ~~$5,000~~ $4,748.34. at the wave of a wand. If you can magically erase ~~$5,000~~ $4,748.34 out of nowhere, what does that mean for the charge to begin with?\\n\\nSo finally satisfied that I could be rid of the plague that is Jostens for ~~$1,400~~ $1,475.82, we sent paperwork to our downtown financials to pay our balance and move one. That should be the end of the story right?\\n\\nWrong. Downtown gets back to us and notices that JOSTENS IS CHARGING US TAX ON OUR YEARBOOKS. They collected taxes that never existed, to the tune of ~~$1600~~ $1,614.79. So, livid, I send an email to JOSTENS demanding our payment record for the entirety of our relationship with them and find THEY DID THIS FOR FOUR YEARS. They claimed that they needed a new tax exempt sheet from us but we never sent it in. They had the old one, which is THE SAME NUMBER as a new one, but that's what the problem was. They are supposed to be cutting a check to us now for around $6000 (5/11 update: they cut one for $2,737, trying to figure out that now). Now think about how many schools use Jostens and how many schools they potentially did that to. That's a class action lawsuit in the millions of dollars right there.\\n\\nMy blood pressure is up just writing this. They have basically robbed our students for years, and it happens all the time because advisors come and go and rarely have time like I did to catch them and call them on their crap.\\n\\nSo we went with Treering this year. First off, I came in with fangs and demands from the get go because I was so pissed off and jaded from Jostens. I started mentioning everything to the guy and listed all my needs in what I wanted contract wise and he was like \\\"yeah our contract is one page long.\\\" It's literally one page long (front and back). The next thing I asked was the base price, which came out to $35.62 (140 pages, estimated 300 books sold). JOSTENS BASE PRICE WITH ALL THE HIDDEN FEES WAS $58. They were going to bump it down to $40 (so generous!) when I told them we were firing them.\\n\\nSo our Jostens ones sold for $78, and now we sell them at $60. So that's $18 LESS per book and $25 MORE in fundraising money. We went from owing Jostens $3k last year to [raising over $7000 this year](http://imgur.com/a/WYUgM). I have learned that we can do discounts for students with free and reduced lunch, so our goal is to make the books equitable for all students. I think you can do this with Jostens as well, but I didn't have the time during my battle to find out.\\n\\nI love my students and defend them rabidly, and seeing how Jostens treated our school makes me sick. Go do the math on how much Jostens (or ANY yearbook company for that matter) is making on your school and you will be too. I would be upset about any swindling, but public school kids? Our free and reduced kids could never afford even discounted books because prices got out of hand, and all because of shifty tactics and corporate greed.\\n\\nSo on the technical side, Treering is not a big improvement from Jostens software, but I do like the linking with social media and especially Flickr. We post all of our pictures to Flickr for the kids to view, print and share during the year for free, then we can automatically grab from albums and place. The themes are good, a lot to choose from too.\\n\\nI could go on, and if you want to talk more please PM me, I try to tell anyone that will listen this story because it really is an injustice. \\n\\n*********\\nEdit: Admins banned post for \\\"self promotion\\\", so link removed. \\n*********\\n\\nOh man that felt therapeutic getting out!\\n\\nEdit #1: thank you to u/behemothpanzer for submitting to r/bestof , I have put so many hours into fighting this small battle that no one knew about or cared about and it really means a lot to me to see such support. I also wanted to add that I don't just have problems with Jostens, other yearbook companies have done shady things too and I don't even know them. This was from a post at the bottom of the comments about a yearbook company essentially trying to bribe me:\\n\\nAnother thing I didn't point out is that other companies try to lure you in with free gifts. A company told me they would [give me a free $50 gift card just for meeting with them.](http://imgur.com/dAwATtz) Like ME a gift card. I'm pretty sure that's illegal, and if not that's immoral as all hell! Greasing teachers with gift cards... unbelievable.\\n\\nEdit #3: Thank you everyone for reaching out, it means a lot to me. I tried to respond to everyone, and if I missed you I'm sorry I will try tomorrow. It's late hear but I was too pumped about your support! Goodnight and thank you!\\n\\nEdit #4: In a poetic moment, I went to my school mailbox this morning [and found this!](http://imgur.com/rrlRRL9) Haha\\n\\nEdit #5: I fixed up some language here and went back to get some exact numbers from invoices.\"", "title": "Jostens Yearbooks scammed Our High School for Years..", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/Teachers/comments/694yxi/jostens_yearbooks_scammed_our_high_school_for/"}, {"author": "Middle-Employment701", "created_utc": 1703187836.0, "link_flair_template_id": "0973713e-146b-11e9-9158-0e2d8a9d2f30", "link_flair_text": "Student Teacher Support &/or Advice", "num_comments": 767, "post_id": "18nvfqj", "score": 7369, "subreddit": "teachers", "text": "\"A former student came to me and said that another student was asking him questions about his relationship which upset him. Let me note that the kid is autistic but high functioning. He just blurts out that she is 11 and that nothing is wrong with that. I ask his age and he says 16\\u2026this evidently made me uncomfortable and he shared that it\\u2019s okay because he isn\\u2019t interested in being sexual\\u2026.still a red flag. I am going to tell another staff but am also considering calling mom. What do you think?\"", "title": "I (25f) am a teacher and a student told me that he is (16m) dating an 11 year old (11f)", "upvote_ratio": 0.92, "url": "https://www.reddit.com/r/Teachers/comments/18nvfqj/i_25f_am_a_teacher_and_a_student_told_me_that_he/"}, {"author": "BassMaster516", "created_utc": 1649513871.0, "link_flair_template_id": "b09886a4-f166-11eb-af40-8665575735d6", "link_flair_text": "RANT [Students/Parents]", "num_comments": 752, "post_id": "tzu43f", "score": 7325, "subreddit": "teachers", "text": "\"I teach middle school math at a charter school. We got a new student in November and she was suspended for fighting the first day. She\\u2019s been in 3 fights since. Her mother is, I\\u2019m sorry but, a rude nasty bitch. Impossible to communicate with. It\\u2019s been a problem all year, but admin keeps bending over backwards for parents and there are no consequences. \\n\\nSo yesterday, it happens again. I end up being the one to pry her hands off another girls hair. She tells me to get my fucking hands off her, kicks me, and throws a water bottle at me. I take the other girl, the one who was attacked, to another room. \\n\\nThe gym teacher tells me the cops are downstairs and he\\u2019s gonna go see what\\u2019s up. I\\u2019m thinking, damn, that\\u2019s crazy, she\\u2019s gonna get arrested. He comes back to tell me they were actually there to arrest me. Mom called the cops on me. \\n\\nThe office staff told the cops that this girl is a fucking animal, her mother is a fucking animal and I was just breaking up a fight. \\n\\nIn another universe, I would be just getting out of jail. I was having a pretty decent year until now. Now I kinda don\\u2019t wanna work there anymore.\"", "title": "Parent called the cops on me", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/Teachers/comments/tzu43f/parent_called_the_cops_on_me/"}, {"author": "capraithe", "created_utc": 1624190705.0, "link_flair_template_id": "001e3cdc-6b46-11e8-83b1-0e104432f86c", "link_flair_text": "Humor", "num_comments": 866, "post_id": "o447r8", "score": 7250, "subreddit": "teachers", "text": "\"\\u2026just so I can look at them across the table and say \\u201cGosh, I didn\\u2019t even know that was a thing. Would you mind defining it for me? I\\u2019d also appreciate the titles of any of the academic texts you read that helped you understand it well enough to be able to identify it so easily.\\u201d\"", "title": "I want some idiot parent to accuse me of teaching critical race theory…", "upvote_ratio": 0.82, "url": "https://www.reddit.com/r/Teachers/comments/o447r8/i_want_some_idiot_parent_to_accuse_me_of_teaching/"}, {"author": "Leading-Yellow1036", "created_utc": 1688672760.0, "link_flair_template_id": "4433b45a-146b-11e9-a469-0ee696cc69a0", "link_flair_text": "Policy & Politics", "num_comments": 593, "post_id": "14sjmzq", "score": 7249, "subreddit": "teachers", "text": "\"Stop buying hundreds of dollars worth of shit for your classrooms.\\n\\nStop working during the summer if you're not getting paid for it.\\n\\nStop leaning on the \\\"poor pitiful overworked teacher\\\" identity. STOP IT. \\n\\nIf we all demanded to be paid for our work and refused to work for free or supply our own classrooms, something would change! But because there are so many martyrs among us, the mistreatment continues.\"", "title": "Stop it, teacher martyrs!", "upvote_ratio": 0.93, "url": "https://www.reddit.com/r/Teachers/comments/14sjmzq/stop_it_teacher_martyrs/"}, {"author": "OnceNFutureNick", "created_utc": 1691627020.0, "link_flair_template_id": "4433b45a-146b-11e9-a469-0ee696cc69a0", "link_flair_text": "Policy & Politics", "num_comments": 1001, "post_id": "15mwmg9", "score": 6931, "subreddit": "teachers", "text": "\"Students come back to class tomorrow and our superintendent just sent out a message to the entire county explaining that parents have to fill out legal documentation or teachers aren\\u2019t allowed to call kids anything but their full, legal name. \\n\\nSo if your child is named William, I can\\u2019t call him Will, Bill, Billy, etc. unless the parent signs paperwork. \\ud83e\\udd26\\ud83c\\udffb\\u200d\\u2642\\ufe0f\\n\\nI know there are more serious policy issues at work in Florida, but it\\u2019s pretty embarrassing that innocuous nicknames (nicholasnames?) have become collateral damage in the culture wars.\"", "title": "Florida is not okay", "upvote_ratio": 0.93, "url": "https://www.reddit.com/r/Teachers/comments/15mwmg9/florida_is_not_okay/"}, {"author": "PresentationActual17", "created_utc": 1693266626.0, "link_flair_template_id": "001e3cdc-6b46-11e8-83b1-0e104432f86c", "link_flair_text": "Humor", "num_comments": 103, "post_id": "1642938", "score": 6929, "subreddit": "teachers", "text": "\"It's the Monday before our first all day test day where the students will get to take a practice SAT on their computers, getting them geared up for the new format in April. \\n\\nAnyway, decided that, since we finished a unit on Friday, and I've got a lot of kids out sick, and since tomorrow isn't an instructional day, I'd let today be a bit more unstructured, see how they handle it. \\n\\nSo we're just talking about the assessment, hands up sometimes, usually a bit more free flowing, it's a big class, but I like having a bit of energy to my class, a bit of noise during discussion time. \\n\\nSo of course, today was my first informal evaluation. \\n\\nImmediately, more hands, I do whole class call and answer (\\\"...and this is the, what property?\\\" Class \\\"communicative!\\\" \\\"And why isn't it the associative?\\\" \\\"Because of the groupings!\\\")\\n\\nThe evaluator sat, took notes. No side conversations, no little misbehaviors, the kids shaped up for 20 minutes solid until the evaluator left. \\n\\nDoor closes, everyone is quite, I look at the class with a smile. \\n\\n\\\"We got you Mr. S, we got you!\\\"\\n\\nSo I think it's gonna be a good year.\"", "title": "Kids did me a solid today", "upvote_ratio": 0.99, "url": "https://www.reddit.com/r/Teachers/comments/1642938/kids_did_me_a_solid_today/"}, {"author": "throwawayBBBS", "created_utc": 1699738656.0, "link_flair_template_id": "4433b45a-146b-11e9-a469-0ee696cc69a0", "link_flair_text": "Policy & Politics", "num_comments": 1039, "post_id": "17t4li0", "score": 6764, "subreddit": "teachers", "text": "\"\\u2026and it\\u2019s making me sad how callous I\\u2019ve become. \\n\\nAt the beginning of my career I swallowed all the social justice, restorative discipline, no grade below a 50, build relationships stuff hook line and sinker. \\n\\nNow in year 10, I feel like a bitter shell of myself who no longer believes in any of it. \\n\\nThe main drivers of this:\\n\\n1. Horrendous student behavior, directly proportionate to bad parenting, that admin excuses as \\u201cit\\u2019s just trauma, we can\\u2019t discipline for that\\u201d while students run into zero consequences until they get arrested at age 17 for felonies. \\n\\n2. Continued lowering of the bar of rigor until it\\u2019s basically in the toilet, all in the name of equity, while kids who are trying to go to college can\\u2019t find rigorous courses to take (and in the few that exist, everyone is allowed in because of equity, so tons of kids just fuck around). \\n\\n3. Prioritizing the needs of 3-4 disruptive students over the needs of the other 30 trying to learn, until even those 30 give up. \\n\\n4. This one is tricky but: browbeating some teachers into accepting unprofessional, uncollegial behavior from other teachers because admin is afraid of being called racist. \\n\\n5. Seeing the long term effects of lowered expectations, \\u201cgrace\\u201d,  and accepting the bare minimum from students and families, and the culture that fosters of entitlement/customer service rather than a true relationship between parents and teachers \\n\\n6. Being held hostage emotionally by kids who say \\u201cthat\\u2019s racist\\u201d any time they are asked to do something other than sit on TikTok and admin forced to take it seriously because they\\u2019re scared not to \\n\\nIt\\u2019s truly unreal to experience all of this and then hear white SJWs scream about how unfair the world is for kids of color and it\\u2019s all the fault of whiteness\\u2026I\\u2019m sorry, fucking WHAT? I get shit on by kids all day, and it\\u2019s my fault?\\n\\nI hate what this has done to me. I feel like a Fox News asshole.\"", "title": "Confession: teaching at a Title I school with a progressive admin has made me less liberal…", "upvote_ratio": 0.83, "url": "https://www.reddit.com/r/Teachers/comments/17t4li0/confession_teaching_at_a_title_i_school_with_a/"}, {"author": "TheLionInZelda", "created_utc": 1599154281.0, "link_flair_template_id": "dde077ec-146f-11e9-9dd3-0ef99acb7998", "link_flair_text": "Bad Teacher, No Apple", "num_comments": 1213, "post_id": "ily15r", "score": 6696, "subreddit": "teachers", "text": "\"I received a very angry phone call from a parent who claims he works for the school district. My lesson today was on identity and intersectionality and I had the students complete an identity wheel chart. The parent called me in the middle of class and left a voicemail. I called back during my lunch break. He then proceeded to scream at me and tell me my lesson on identity was offensive to him, his son, and all Muslims. He said that by asking students to differentiate between sex and gender (i.e. what sex you were born and what gender you consider yourself to be) I was brainwashing them into thinking like me. He told me to stop teaching things like that and to stick to teaching English grammar only. I decided to include a unit on identity and intersectionality in order to begin the year with some social emotional learning, a requirement from our district. He ended the phone call by telling me he would be reporting my behavior to the district and was going to ensure I was fired. \\n\\nAt this point, I hope I do get let go. I\\u2019m just over it. I love being a teacher, but with digital learning and now this, I am reconsidering my entire career.\\n\\nUPDATE: Just received an email from my principal saying he will support me in my identity wheel as this is a conversation that is needed right now and I have his full support to continue having these conversations. He also said he will personally deal with the parent.\\n\\nEDIT: A lot of people have been asking what grade I teach. I currently teach seniors in high school. Also, people have been asking me to share my resources for the lesson I taught today. For the sake of protecting my identity, as I use Nearpod for my lessons, I don't want to share the actual slides that I use. But I will share the identity wheel I found online and modified for my lesson. You can find that resource here: https://sites.lsa.umich.edu/inclusive-teaching/wp-content/uploads/sites/732/2020/07/Social-Identity-WheelDefinitions.pdf Hopefully links are allowed. If not, mods, let me know and I will figure out another way to share the link. \\n\\nThank you for all the encouraging replies and advice! I promise I read them all, even if I did not respond to all of them!\"", "title": "It’s the second day of school and a parent has already reported me to the district for my teaching methods.", "upvote_ratio": 0.88, "url": "https://www.reddit.com/r/Teachers/comments/ily15r/its_the_second_day_of_school_and_a_parent_has/"}, {"author": "None", "created_utc": 1704997982.0, "link_flair_template_id": "fe0a214e-146a-11e9-893d-0e90c126802c", "link_flair_text": "Teacher Support &/or Advice", "num_comments": 859, "post_id": "1948s3x", "score": 6684, "subreddit": "teachers", "text": "\"When starting to go over and practice pronouns with a middle school intervention class today, a student immediately said \\u201cSo\\u2026can I identify as a toaster?\\u201d \\ud83e\\udd26\\u200d\\u2640\\ufe0f \\n\\nI said that was not appropriate, and that the lesson is not about identity pronouns, just pronouns generally. We did notes including a long list of the major examples of pronouns, including all the she/he/they ones of course, but also pronouns like I/me/my, you/your/yours, someone/everyone, it/that/this/those/these. I explained several times that pronouns are a way to refer to a noun without actually stating its name, and that there are all different types that might be used. We labeled pronouns in sentences together to prepare for their independent practice. \\n\\nThe kid then made the toaster comment AGAIN. Another chimed in and said \\u201cso they is a pronoun?\\u201d I said yes and he shook his head and said \\u201cno it\\u2019s not.\\u201d I said \\u201cOkay let\\u2019s do an example scenario: you find a lost water bottle in the hallway, but you have no idea whose it is and it\\u2019s just a generic water bottle. You have a friend with you, what do you say about the water bottle?\\u201d The kid immediately said \\u201cSomeone lost their water bottle.\\u201d I said \\u201cRight, so there is nothing incorrect about using their, even if you\\u2019re only referring to one person, because sometimes you don\\u2019t know who it was.\\u201d \\n\\nTo make it clear I wasn\\u2019t being political, I said something along the lines of \\u201cPronouns have existed in the English language forever because we need a way to refer to nouns in lots of different ways. When you talk about a plural noun or a group of nouns you might use they/them/their to refer to all of them. When you don\\u2019t know the gender of a person, like if someone did something and you don\\u2019t know who it was or if they\\u2019re a boy or girl, your brain automatically inserts the only other pronoun available to refer to a person.\\u201d \\n\\nI was careful not to say anything specific about nonbinary or trans people so I don\\u2019t end up in hot water. I respect the trans community and I understand nonbinary people\\u2019s preference for they/them, because I understand grammatically that it\\u2019s a neutral pronoun. However, I resent that all the political debates surrounding it now interfere with basic grammar instruction. All some kids think of when I say pronouns are identities, and if their family and therefore they are against the whole gender identity thing they just tune out. It\\u2019s bonkers!\"", "title": "It is absurd that I can’t teach pronouns in grammar lessons without these stupid comments.", "upvote_ratio": 0.88, "url": "https://www.reddit.com/r/Teachers/comments/1948s3x/it_is_absurd_that_i_cant_teach_pronouns_in/"}, {"author": "local-made", "created_utc": 1666223378.0, "link_flair_template_id": "38a0f088-6a9a-11e8-ab9f-0e30a2dff32a", "link_flair_text": "SUCCESS!", "num_comments": 547, "post_id": "y8iaok", "score": 6693, "subreddit": "teachers", "text": "\"You all have heard it around the world. Quiet quitting or \\\"simply doing your job and nothing else\\\" is going around. Anyway the Fall Fling dance rolls around and teachers are \\\"required\\\" to chaperone. Basically we are given a google form to sign up for a shift to chaperone the dance. No this isnt paid, yes its on a Friday night after a long work day and week, and no food is not provided to teachers. Total suckfest all around. Well get this, the day before the dance we get a frantic email from Admin. No one signed up to chaperone. NOT A SINGLE teacher signed up to chaperone. We get some messages about how this is mandatory, teachers must be there for the event, we can choose which shift we work but must be there. No one signs up. Cue Admin start walking door to door with a sheet asking people to sign up. Get this, the teachers stand their ground and say no. Of course a few caved, 1 or 2, but overwhelmingly the teachers say no. \\n\\n&#x200B;\\n\\nGuess what happened, well they had the dance, the admin chaperoned, the few people that signed up, basically a skeleton crew. The next week nothing, no messages, no angry faculty meeting, nothing. They know that they cant do anything to the teachers because its not one or two, its everyone. Listen I understand that kids need fun stuff to do, but maybe don't make teachers do it, or if they have to be there pay them??\"", "title": "Quiet quitting is happening at my school", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/Teachers/comments/y8iaok/quiet_quitting_is_happening_at_my_school/"}, {"author": "lhatss98", "created_utc": 1707951292.0, "link_flair_template_id": "001e3cdc-6b46-11e8-83b1-0e104432f86c", "link_flair_text": "Humor", "num_comments": 656, "post_id": "1ar0cb3", "score": 6659, "subreddit": "teachers", "text": "\"Tagging as humor because there really is nothing we can do to help, but laugh. \\n\\nOn Monday, a student in my lower elementary class was trying to steal a classroom tablet. (That I purchased with my own money) The student had it hidden under their shirt and tried to stuff it in their backpack. \\n\\nAnother student saw this and shouted , \\u201cHey! Blank\\u2019s name, what are you doing?\\u201d That\\u2019s when the tablet fell out from their shirt. \\n\\nI called the student over and had a very serious, but gentle chat about what had happened. Student admitted that there were trying to take the tablet. We end our conversation with discussing that stealing is wrong and to move clip down for not being respectful. Student is of course upset and cries at the front of the room. Other students give hugs and I give a hug too. Remind student that sometimes we make mistakes. Student stops crying less than 10 minutes later. \\n\\nEnd of the day rolls around and I write in the planner about the incident. After school, I had a face to face meeting with mom already scheduled and share exactly what happened. \\n\\nAfter hearing what happened, Mom asks why child was crying. I reiterate that the student was caught stealing the tablet. Mom asks again and again. I keep saying back they tried to steal a tablet. She asks again . Finally, I say , \\u201c I guess she was embarrassed for getting in trouble?\\u201d Like I didn\\u2019t know what to say? They were stealing and got caught. Tears were an appropriate reaction. It showed remorse. \\n\\nMom also asked if it happened in front of the class. I again reiterate, that it happened during center time, and that the entire class was present, but that the conversation was private. We move on without much issue. \\n\\nApparently, this was wrong. \\n\\nThe next day, the father calls and yells at the principal, saying that I embarrassed his child and labeled them a thief. He also said the child was just trying to \\u201cborrow\\u201d the tablet. He also said I shouldn\\u2019t have written what happened in the planner ( I told parents at the beginning of the year that I use the planner to communicate any behavior problems, good or bad to them) and that I should have called him (he and mom are married and live together ) \\n\\nMy principal, of course, contacts me about this whole issue. I explain what happened. I was basically told next time just to call the parents. I guess talking IN PERSON wasn\\u2019t enough? \\n\\nBut this is where I\\u2019m worried about this upcoming generation. What should\\u2019ve been a discussion about stealing and that it\\u2019s wrong, instead became a witch hunt for the teacher????? What are we teaching our children? That\\u2019s stealing is fine???? That if we make a mistake, it\\u2019s someone else\\u2019s fault? \\n\\nI\\u2019m beside myself on this!!! Like what?!?! \\n\\nAlso, don\\u2019t worry the page where I wrote the note was torn out \\u2026 so their precious cherub didn\\u2019t need to be reminded that they literally tried to steal a classroom tablet. \"", "title": "Well… this next generation is doomed… parents have lost their minds! ", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/Teachers/comments/1ar0cb3/well_this_next_generation_is_doomed_parents_have/"}, {"author": "Natylit", "created_utc": 1696375068.0, "link_flair_template_id": "001e3cdc-6b46-11e8-83b1-0e104432f86c", "link_flair_text": "Humor", "num_comments": 177, "post_id": "16z6wrc", "score": 6656, "subreddit": "teachers", "text": "\"I work primarily with students of color, and today I went to visit our after-school art club. I walk up and one girl says \\u201cWatch this!\\u201d to the art teacher. She then proceeds to come up and give me a giant hug. I, of course, instantly reciprocate and ask her how she is. She then says \\u201cSee! I told you! Ms. X has the sweetest personality - she\\u2019s like my white mom!\\u201d I cracked up immediately. She then proceeds to say \\u201cThis is why I love Ms. X. She\\u2019s just everyone\\u2019s white mom.\\u201d\\n\\nIt was simultaneously the sweetest and most ridiculous/hilarious thing I\\u2019d heard all day. She\\u2019s such a good kid, and it\\u2019s nice that she thinks of me as a mother figure. I have so much love for my students, and this little exchange made my day. Moments like this is why I love to teach middle school. What\\u2019s a funny, little, ridiculous moment that\\u2019s made your day?\"", "title": "Student calls me “everyone’s white mom” 😂", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/Teachers/comments/16z6wrc/student_calls_me_everyones_white_mom/"}, {"author": "24hourhypnotoad", "created_utc": 1697899429.0, "link_flair_template_id": "fe0a214e-146a-11e9-893d-0e90c126802c", "link_flair_text": "Teacher Support &/or Advice", "num_comments": 801, "post_id": "17d44sy", "score": 6574, "subreddit": "teachers", "text": "\"I (male) teach 12-14 year olds for the past 10 years. Whenever students ask to use the bathroom, I always say yes (the only exception is 1 person at a time).\\n\\nFor the last couple years, I've had a few female student's period soak through onto the chairs. the tough thing is, I'm unable to notice before the next class comes in. When it's brought to my attention, I clean it up discreetly. Is there something I could be doing more to help the students feel more comfortable to go and take care of themselves to avoid this, or is this something that 'just happens'? I haven't really seen this until recently (unless I was oblivious the first 7-8) years of teaching).\\n\\nEdit: some great advice. I'll talk with a counselor to help bring awareness. My goal is to not bring unwanted attention to it more for fear of embarrassing the girls affected. I'll see if I can find a casual, indirect way to help them understand it's normal, and if they can, let me know so I can help them avoid any embarrassment. I'll look into getting some products in my room.\\n\\nEdit 2: I'm also sorry to hear some were bullied for something natural. I try my best to keep my ears open and prevent that where I can. It's not fair. I want to make sure these girls feel safe, and that's tricky for a male teacher. Here's hoping we can improve the next generation!\"", "title": "Students not realizing they're on their periods?", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/Teachers/comments/17d44sy/students_not_realizing_theyre_on_their_periods/"}, {"author": "Orangecatbuddy", "created_utc": 1684552213.0, "link_flair_template_id": "4433b45a-146b-11e9-a469-0ee696cc69a0", "link_flair_text": "Policy & Politics", "num_comments": 777, "post_id": "13mg9ql", "score": 6436, "subreddit": "teachers", "text": "\"Because that is exactly what happened today. A senior decided, on his very last day of school, to literally piss on a teacher.  \\n\\nThe seniors went way overboard with their pranks. They broke into the school after the overnight custodians left at 2:00am. They pulled desks and chairs out into the halls, stacked them into piles so that no one could get thru the halls. \\n\\nThere were chairs piled in the lunchroom, and just about everyplace they shouldn't be. \\n\\nThe kicker is when the senior decided to piss on a older teacher. He was arrested and as far as I know, will be charged with felonious assault. \\n\\nIt's my understanding they know who was involved with the rest of the vandalism. Criminal charges will be filed. \\n\\nThis is what they get when admin is more worried about a state report card and less about taking care of simple housekeeping matters.\\n\\nEdit Update:\\n\\nWow, never expected this to go beyond the teachers reddit.\\nThe text messages have been busy this morning, but this is what I know so far.\\n\\nThe teacher who was assaulted has evidently filed criminal charges. Unsure of what, there is a rumor that an additional charge was added because he prevented her from getting away. Again, that's part of the rumors. \\nIt's not clear how the kids got into the building, I do know that there are several \\\"sub\\\" door keys missing. \\n\\nThe term stacked, when it comes to the chairs is misleading. It was more like they were tossed into a pile. It was not a neat orderly stack. \\n\\nThere will be no real updates until Monday morning. I'm certain this will be the subject of our morning talk. \\n\\nFor those of you who think schools are open books, boy are you mistaken. Kids are pretty much allowed run rampant because this is a litigious world we live in. Administrators are more concerned with keeping school boards happy and less about discipline when it's necessary.  The same admin will do everything in their power to keep this quiet. They have an \\\"ignorance is bliss\\\" policy when it comes to things like this.\"", "title": "12 Grades and Kindergarten, only to be walked out on the last day in handcuffs.", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/Teachers/comments/13mg9ql/12_grades_and_kindergarten_only_to_be_walked_out/"}, {"author": "BackwoodsDegenerate", "created_utc": 1686393918.0, "link_flair_template_id": "38a0f088-6a9a-11e8-ab9f-0e30a2dff32a", "link_flair_text": "SUCCESS!", "num_comments": 150, "post_id": "145x1m0", "score": 6395, "subreddit": "teachers", "text": "\"Hey, \\\\*\\\\*\\\\*\\\\*\\\\* (they used my first name).Don't know if you're looking at these emails now that you're retired. God damn, man. Was so happy to see you lived to see retirement age, let alone that you were actually doing it. Nobody deserves it more than you. Really hope you enjoy retirement and can put even half the amount of enthusiasm into it that you did to educating us kids. I graduated in 2010, and for the past 13 years, I've told everybody even moderately close to me that you were by far my best and most influential educator. You maybe (probably) won't remember this, but you suggested I go to see Crater Lake out in Oregon. I did, right after I graduated, when I was 18. It was absolutely beautiful, I loved it. Spent over a week there, hiking all the trails around that amazing park. Now that I'm an adult who's seen as much of the world as I could have seen, given where I'm from and the budget I've had to work with, can I make you a suggestion? B\\u00e2lea Lake in the F\\u0103g\\u0103ra\\u0219 Mountains, in Romania. It's one of the few places that has contended with the beauty I found in Crater Lake National Park that week. The road is practically treacherous, but it's so damn worth it. Absolute beauty. Seasonally dependent, there really wasn't anybody there. It's a pristine glacier lake up in the mountains above the clouds, what more is there to say? You had a gigantic impact on my life, and I truly wish nothing but the best for you moving forward. You deserve the type of story that has a thousand amazing endings. The timing never added up very well, but one of the only reasons I regret not having children sooner is that they will miss out on the opportunity of having \\\\*\\\\*\\\\*\\\\*\\\\* \\\\*\\\\*\\\\*\\\\*\\\\* teaching them science.\\n\\nI hope you have a happy retirement,\\u00a0\\n\\n\\\\- \\\\*\\\\*\\\\*\\\\* \\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\\\*\\n\\nEdit: Their formatting was so much better, but the copy paste from email to here seems to have ruined it.\"", "title": "I just retired, and upon my retirement, got this email from one of my favorite students that I haven't spoken to since they graduated, 13-15 years ago.", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/Teachers/comments/145x1m0/i_just_retired_and_upon_my_retirement_got_this/"}, {"author": "None", "created_utc": 1685485105.0, "link_flair_template_id": "001e3cdc-6b46-11e8-83b1-0e104432f86c", "link_flair_text": "Humor", "num_comments": 681, "post_id": "13w3yle", "score": 6333, "subreddit": "teachers", "text": "\"I wish I was shitting you. The parent went all the way to the Superintendent and of course it got to the principal. How the principal spun it was that that movie \\u201cdidn\\u2019t align with any standards\\u201d\\u2026 \\n\\nThe irony is, I showed the same movie in my class, to hell with \\u201cstandards\\u201d. I just wanted to let my class unwind. But now at the end of the day, this is a job so now I\\u2019m not going to show anything higher than a G. \\n\\nThese parents have too much goddam time on their hands.\"", "title": "Teacher got in trouble for showing Remember the Titans. Parent didn’t like how there was a scene showing two guys kissing. Yes, this is Florida.", "upvote_ratio": 0.92, "url": "https://www.reddit.com/r/Teachers/comments/13w3yle/teacher_got_in_trouble_for_showing_remember_the/"}, {"author": "Eclectique1", "created_utc": 1685385280.0, "link_flair_template_id": "001e3cdc-6b46-11e8-83b1-0e104432f86c", "link_flair_text": "Humor", "num_comments": 774, "post_id": "13v2qhp", "score": 6291, "subreddit": "teachers", "text": "\"At a family picnic this weekend I kept on getting teased about the fact that I get summers off and that I\\u2019m not working a part time job over the summer. My one cousin in particular was insufferable about it because he has a STEM degree and I make more than him (strong union state) plus have summers off. \\n\\nHe shut up really quickly when I said \\u201chey man you have a bachelors in biology, you can get a teaching certificate done post-bacc in a year or two. Plus as a science teacher you would have a really easy time finding a job.\\u201d Something or another about how he could never deal with teenagers all day and that he was done with school, he was just too smart for it and didn\\u2019t learn anything (total bs)\"", "title": "You want summers off? Become a teacher", "upvote_ratio": 0.93, "url": "https://www.reddit.com/r/Teachers/comments/13v2qhp/you_want_summers_off_become_a_teacher/"}, {"author": "None", "created_utc": 1686331044.0, "link_flair_template_id": "3e476a5c-db64-11ea-a983-0ee7daf6e7e9", "link_flair_text": "Student or Parent", "num_comments": 535, "post_id": "145b3aa", "score": 6211, "subreddit": "teachers", "text": "\"A family wanted me to let a student do \\\"replacement assignments\\\" for the entire semester of work that he never did.  The work was to be done 100 percent at home and \\\"scribed\\\" by the parent and a tutor.  \\n\\nTwo principals and the counselor not only went along with this attempt at academic fraud, but pressured me to agree.  I said no and state law makes it nearly impossible to overrule me.  I have never taught a student that was less deserving of a diploma in my career.  I see it as a good life lesson.\"", "title": "\"No, there is no way that your child can pass my class and graduate on time.\"", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/Teachers/comments/145b3aa/no_there_is_no_way_that_your_child_can_pass_my/"}, {"author": "Serpents-Smile", "created_utc": 1706013928.0, "link_flair_template_id": "38a0f088-6a9a-11e8-ab9f-0e30a2dff32a", "link_flair_text": "SUCCESS!", "num_comments": 223, "post_id": "19dnm5y", "score": 6212, "subreddit": "teachers", "text": "\"Had a 15 year old student who just wasn't getting the mathematical concept of Capacity today. He just had a huge mental block on the entire concept. \\n\\nI removed his worksheet and sat with him. \\n\\n\\\"Look. You play Call of Duty. I know you do. So you reload. You have 36 rounds to fire. That means your guns clip has a CAPACITY-\\\"\\n\\n\\\"A capacity of 36 bullets!!\\\"\\n\\nHe then just blasted through the sheet with just a few mistakes, and far above his average. \\n\\n\\nLater on in the halls he just shouts out at me in front of his mates, \\\"Ms Serpent smile! You're a legend!\\\"\\n\\nTop compliment from a 15 year old British kid.\"", "title": "Sometimes, that tiny bit of unprofessionalism works", "upvote_ratio": 0.97, "url": "https://www.reddit.com/r/Teachers/comments/19dnm5y/sometimes_that_tiny_bit_of_unprofessionalism_works/"}, {"author": "None", "created_utc": 1659289855.0, "link_flair_template_id": "001e3cdc-6b46-11e8-83b1-0e104432f86c", "link_flair_text": "Humor", "num_comments": 1551, "post_id": "wcujnu", "score": 6172, "subreddit": "teachers", "text": "\"Made the mistake of asking on a conservative sub why most of them hate public education, and it was the same thing every other post: they hate how we\\u2019re all indoctrinating kids.\\n\\n\\nSo I\\u2019m curious: how do you personally indoctrinate kids? Can I indoctrinate them to bring me some tacos every Friday?\"", "title": "How are you personally “indoctrinating kids”?", "upvote_ratio": 0.89, "url": "https://www.reddit.com/r/Teachers/comments/wcujnu/how_are_you_personally_indoctrinating_kids/"}, {"author": "DoubtOdd263", "created_utc": 1707180597.0, "link_flair_template_id": "71f2aa60-b428-11ee-8f12-fa0f499e77d1", "link_flair_text": "Just Smile and Nod Y'all.  ", "num_comments": 879, "post_id": "1ajwvx7", "score": 6146, "subreddit": "teachers", "text": "\"The student body is on a boycott over the food served in the cafeteria. The student body is not eating the food served by the cafeteria staff due to hair found in the food being served\\u2026 one student claims they got food poisoning from the cafeteria food, and it started a boycott against the cafeteria food. \\n\\nThe administration decided to put the \\u201corganizers\\u201d of the boycott in detention. The reason was for trying to \\u201ccoerce others to skip lunch served by the school\\u201d. The absolute dumbest reason to throw kids into detention in her mind. Apparently it\\u2019s getting worse, the administration is wanting to try and trickle down the punishment to all who participated, since they only have so many seats available in the detention room. \\n\\nThe students aren\\u2019t irate over the nutrition guidelines, they just don\\u2019t like how they keep pulling hairs out of their food, and that they feel like they are just being served low quality food. Buuut it sounds like the administration isn\\u2019t going to bother with basic health standards with the cooking staff, it\\u2019s bad, this wouldn\\u2019t fly with a restaurant\\u2026 why subject students to terrible food?? \\n\\nThe administration is more pissed over the fact that the \\u201cnice lunch ladies\\u201d happened to \\u201cmake too much food!\\u201d \\n\\nYou can lead a horse to water, but you can\\u2019t make that horse drink the water, seems to me and her that the powers that be seems incapable of figuring that out.\"", "title": "Wife had detention duty, there’s so many students serving detention over their boycott of cafeteria food", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/Teachers/comments/1ajwvx7/wife_had_detention_duty_theres_so_many_students/"}, {"author": "Fix_Em_Up", "created_utc": 1703213582.0, "link_flair_template_id": "fe0a214e-146a-11e9-893d-0e90c126802c", "link_flair_text": "Teacher Support &/or Advice", "num_comments": 753, "post_id": "18o4pun", "score": 6092, "subreddit": "teachers", "text": "\"I won\\u2019t repeat the email received but a student called me dumba\\u2014 and an a\\u2014hole, along with telling me he hopes I k\\u2014- myself. Plus the f word along with an extra one to let me know a good \\u201cf\\u2014- you\\u201d. \\n\\nContext: student will fail my class and called dad to let him know. The student wasn\\u2019t doing anything to help prevent the failure and I talked to dad in the past about this. Student was shy and would never say much in class. I tried working with him and I checked up on him about everyday.\\n\\nAs my school is on break I just forwarded this automatically to his principal and counselor. I haven\\u2019t contacted the parent as I\\u2019m on break and my principal told me to wait. What would you do in this situation? This is high school\"", "title": "Student emailed me to K—- myself", "upvote_ratio": 0.93, "url": "https://www.reddit.com/r/Teachers/comments/18o4pun/student_emailed_me_to_k_myself/"}, {"author": "notpinheadlarri", "created_utc": 1685809259.0, "link_flair_template_id": "001e3cdc-6b46-11e8-83b1-0e104432f86c", "link_flair_text": "Humor", "num_comments": 732, "post_id": "13zhngi", "score": 6054, "subreddit": "teachers", "text": "\"My husband last night wanted to have dinner with his parents and I was down. Then he mentioned some of his parent\\u2019s friends would be there, and I was still willing to go because the in-laws are my in-laws. \\n\\nLet\\u2019s call the new friends Marti and Barty. Marti seemed like a nice and sweet lady, but Barty on the other hand was a real asshole. \\n\\nWhen we first got there my in-laws and their friends were in the dining room eating, and my husband and I are were in the living room. While we were eating I thought I overheard Barty saying some real off-putting shit about Mexicans and Cuban, but whatever I let it slide because I wasn\\u2019t sure. \\n\\nAfter they got done I heard my MIL say let\\u2019s go to the living room to join us, and oh my I wish I would have left then because they brought up that I was a school teacher. \\n\\nIt was the usual I wIsH I hAD tW0 moNthz oFf or I CoUlD dO tHaT jOB iF iT wAsNt fOr thE kiDs teeHEE and blah blah blah blah. Nothing that really bothers me because I, my husband, and in-laws know how hard I work, so whatevs. \\n\\nThen Barty says, \\u201cI hear they\\u2019re teaching kids to be racist in schools.\\u201d\\nFIL replies, \\u201cNo, they are starting to teach Critical Race Theory.\\u201d\\nBarty, \\u201cYes thats the thing\\u201d and then they both look at me.\\u201d\\nSo I say, \\u201cNo, no one is teaching CRT, and it\\u2019s not even in most state standards.\\u201d Barty says, \\u201cNo they are teaching it at schools because I heard it from Dr. Phil.\\u201d\\nThen I politely say, \\u201cNo, actually they are not because K-12 students cannot grasp CRT. CRT is usually taught in grad school or upper level college, teaching CRT would be unable to be taught to K-12 students because they do not have a firm understanding of Law, History, or theory to properly apply CRT\\u201d. \\nBarty stares at me and says, \\u201cWe\\u2019ll it\\u2019s being taught.\\u201d \\n\\nI cannot fathom how people still take the word of Dr. Phil these days lol and this man knows no teachers and ain\\u2019t even from here. \\nSo what I really wanted to say is \\u201cSHUT YOUR CRT ASS UP. Motherfucker, YOU don\\u2019t even know what CRT is! Students aren\\u2019t even on grade-level and you think they can learn CRT??\\u201d \\n\\nBest part of last night was the official start of summer! It was also my birthday! And FIL said we ALL would have dinner again next week! Yaaaaaay!\\n\\nEdit: wow I did not think this would blow up like it did lol thanks for the coins, idk how to use them but I\\u2019ll figure it out \\ud83d\\ude06 and thank you for the responses as well some of them were hilarious too. \\n\\nSomeone commented I should make videos or posts about this subject matter and honestly it\\u2019s worth it. Even if I wasn\\u2019t teacher, you all out there are amazing individuals, and yes the compliment even extends to those who judged me based on this post or my Reddit account. \\n\\nFinally, I just wanna say that I was raised and believe that everyone does deserve respect and kindness, especially if you are a guest in someone\\u2019s home, and if anyone ever were to cross a line or boundary l was also taught to stand up for myself too.\"", "title": "Shut your CRT ass up!", "upvote_ratio": 0.89, "url": "https://www.reddit.com/r/Teachers/comments/13zhngi/shut_your_crt_ass_up/"}, {"author": "RedFoxWhiteFox", "created_utc": 1639575481.0, "link_flair_template_id": "b09886a4-f166-11eb-af40-8665575735d6", "link_flair_text": "RANT [Students/Parents]", "num_comments": 831, "post_id": "rgzans", "score": 6036, "subreddit": "teachers", "text": "\"I know we aren\\u2019t supposed to even think it about these angels, but \\u2026 some of these kids are straight up dumb asses. Downvote me. I know it isn\\u2019t nice. Don\\u2019t get me wrong, I have some GREAT students, but there are some real dumb asses as well. I look at them and I see someone who will need a lifetime of \\u201csupports\\u201d with no accountability. I am over laboring for dumb asses. I have kids who are bright and competent; polite and curious. They get little of my time because most of my time is spent putting out fires or taking care of paper work re: dumb asses. They need their own dumb ass school so I can teach and other students can learn.\"", "title": "I’m just going to say it", "upvote_ratio": 0.94, "url": "https://www.reddit.com/r/Teachers/comments/rgzans/im_just_going_to_say_it/"}, {"author": "chocandcholl", "created_utc": 1620502885.0, "link_flair_template_id": "a800be2a-db2e-11ea-a2d9-0e7c7daf2ec7", "link_flair_text": "Resignation", "num_comments": 254, "post_id": "n7wu38", "score": 6019, "subreddit": "teachers", "text": "\"...because nothing says \\\"fuck you, respectfully\\\" like giving thirty days notice with my last day as May 7, when school ends June 4. I had to miss a lot of work this year due to having Covid (that I got from school!) + my son's daycare closing three times due to Covid. We have been in-person since August and it's been a shitshow of a year. The last straw was when I asked to leave school an hour early to take my son to a major doctor's appointment and was told no. My admin had said, \\\"You *took* ten whole days off when you had Covid, so I think you've been home enough. You should schedule appointments outside of work hours. You could improve your time management skills.\\\" We have been urged by admin all year to \\\"give students grace during this challenging year\\\" yet I was told I couldn't leave an hour early for a toddler's doctor's appointment. Shameful.\\n\\nI went home that night and sent in my thirty days. Damn, did it feel good. It is 3:39PM on a Saturday and you know what I'm doing? NOT LESSON PLANS AND GRADING! 3,000 upvotes and I will send my former admin an email of my middle finger. (JK)\"", "title": "I just had my last day of teaching while my school has four weeks left.", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/Teachers/comments/n7wu38/i_just_had_my_last_day_of_teaching_while_my/"}, {"author": "LordFalcoSparverius", "created_utc": 1645369122.0, "link_flair_template_id": "001e3cdc-6b46-11e8-83b1-0e104432f86c", "link_flair_text": "Humor", "num_comments": 250, "post_id": "sx30if", "score": 5986, "subreddit": "teachers", "text": "\"We held PT conferences recently, and we hold ours as a group for each student. One parent came in determined to chew out our history teacher for teaching CRT to her son. Halfway through her tirade, the teacher stopped her and asked if her son had explicitly told her that she was teaching CRT. She replied that he said they were learning about race and BLM. \\n\\nWhat they were actually doing is learning the RACE strategy for answering questions: rewrite, answer, cite, explain. The topic they were covering was Spanish discovery of the new world and if her son had been paying any attention whatsoever, he would have known that and also wouldn't be failing every assignment.\"", "title": "Coworker eviscerates a parent", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/Teachers/comments/sx30if/coworker_eviscerates_a_parent/"}, {"author": "jbeldham", "created_utc": 1701795148.0, "link_flair_template_id": "001e3cdc-6b46-11e8-83b1-0e104432f86c", "link_flair_text": "Humor", "num_comments": 392, "post_id": "18bgf50", "score": 5935, "subreddit": "teachers", "text": "\"I teach in middle school and the history teacher was absent last week.  These students, being middle schoolers in a not so great section of town, have a tendency to run a little wild.  So imagine my surprise when they come in to my class, meek and quiet, and do exactly what I tell them.  For the whole period they\\u2019re well behaved, following directions, even saying please and thank you!\\nI later discovered that the history substitute had grabbed a student by the collar and yelled in the students face, which was so shocking to me that I didn\\u2019t believe it at first.  And while I in no way approve of what the substitute did, my God it was good to have an easy day\"", "title": "My students were very well behaved after a substitute manhandled one of them…", "upvote_ratio": 0.94, "url": "https://www.reddit.com/r/Teachers/comments/18bgf50/my_students_were_very_well_behaved_after_a/"}, {"author": "dirtynj", "created_utc": 1687101316.0, "link_flair_template_id": "001e3cdc-6b46-11e8-83b1-0e104432f86c", "link_flair_text": "Humor", "num_comments": 421, "post_id": "14cmwxg", "score": 5919, "subreddit": "teachers", "text": "\"Just saw The Flash last night. At the beginning of the movie these 2 high school girls were on their phones (fully up, bright screen, in-use, not just checking a notification). They got a warning to put them away from the usher after about 2 minutes of using them. \\n\\nAbout 20 minutes later, they were on them again. The usher came back and told them they had to go. They made a little fuss...usher goes \\\"I JUST told you before!\\\"...but ultimately they did leave after some hawing. \\n\\nCrazy that this college kid making $12/hr has more power/management than teacher's with masters degree.\"", "title": "The 20-year old usher in the movie theater has more power than us.", "upvote_ratio": 0.93, "url": "https://www.reddit.com/r/Teachers/comments/14cmwxg/the_20year_old_usher_in_the_movie_theater_has/"}, {"author": "UniqueUsername82D", "created_utc": 1683203107.0, "link_flair_template_id": "4433b45a-146b-11e9-a469-0ee696cc69a0", "link_flair_text": "Policy & Politics", "num_comments": 779, "post_id": "137j21w", "score": 5908, "subreddit": "teachers", "text": "\"The term \\\"digital natives\\\" is such a misnomer. The vast majority of my senior students cannot compose an email or understand boolean searches before they get to my class, let alone how algorithms target them or how companies make money off of \\\"free\\\" apps and software.\\n\\nThey know how to click, scroll and record. That's it. The number of teachers in my building alone who assume kids just \\\"know\\\" how to compose emails or do proper searches is frightening.\"", "title": "They're not \"digital natives,\" they're \"click natives.\"", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/Teachers/comments/137j21w/theyre_not_digital_natives_theyre_click_natives/"}, {"author": "fourfrenchfries", "created_utc": 1633279448.0, "link_flair_template_id": "38a0f088-6a9a-11e8-ab9f-0e30a2dff32a", "link_flair_text": "SUCCESS!", "num_comments": 237, "post_id": "q0liyi", "score": 5861, "subreddit": "teachers", "text": "\"\\u201cHi, Mrs. Fourfrenchfries: my son has a zero for Essay 1 because he chose not to do it. This behavior is unacceptable. He had ample time and direction to complete it successfully. Instead of attending a social event this evening, he will be finishing the essay and submitting it to you. Please do NOT give him a grade for it, but some comments about areas for improvement in his writing would be appreciated if you have time.\\u201d\\n\\nSchool rules dictate I must grant 50% credit for late work, but this is a refreshing email from a parent nonetheless!\\n\\nETA: Why do some people insist on putting a damper on a happy post? Sheesh. I am so sick of comments criticizing me for assigning \\u201chomework\\u201d or the late work policy. I teach for an accelerated dual credit program (the kind where juniors/seniors graduate from high school with their associate\\u2019s degree) that is 100% online. Their work is all homework by default. The late policy is dictated by the program and it is the same for all the courses.\"", "title": "An email from a parent", "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/Teachers/comments/q0liyi/an_email_from_a_parent/"}, {"author": "BbTrumpet2", "created_utc": 1687492717.0, "link_flair_template_id": "001e3cdc-6b46-11e8-83b1-0e104432f86c", "link_flair_text": "Humor", "num_comments": 2244, "post_id": "14go727", "score": 5842, "subreddit": "teachers", "text": "\"Is anyone else having the trend of boys moaning as if they\\u2019re pornstars in school?? My friends who teach in different areas are all dealing with this, too, and I\\u2019m wondering what the hell is going on with kids these days??? Is it some kind of TikTok trend? \\n\\nI can\\u2019t escape them this summer. My teacher friends and I have left stores because we are so triggered by random, unattended moaning teenage boys. I hear them screaming, \\u201cYes Daddy!!!\\u201d As they play basketball next door. \\nAnd. It. triggers. Me. \\n\\nI guess this is my own personal Karen moment, because as my non-teacher family and friends say, \\u201cBoys will be boys!\\u201d But I don\\u2019t remember kids being this stupid when I was their age\\u2026 \\n\\nJust something so disturbing about hearing tween/teen/elementary boys making what they think are women\\u2019s \\u201csex noises\\u201d constantly.\\n\\nEnd rant.\\n\\nEdit to add: For all of you saying, \\u201cThis has been a thing since the 1800\\u2019s!\\u201d I teach ELEMENTARY school. The point is: this is happening younger and younger. And it doesn\\u2019t stop with the moaning, at my school alone boys were tea bagging each other, describing sex acts to each other and girls, accusing boys of having sexual relations with each other and bullying relentlessly, and pretending to deep throat anything phallic (hot dogs, recorders) with gurgling sounds. It is more rampant and deliberately to be heard by the entire room than it was in your day and age, the retiring teachers in my school have never witnessed anything like it. \\n\\nIf you\\u2019re cool with boys making girls and other boys in class feel uncomfortable for the sake of \\u201cboys being boys,\\u201d just say it. \\n\\nThe amount of predators in the comment section doesn\\u2019t pass the vibe check.\"", "title": "I am permanently traumatized from the amount of boys moaning in class this year", "upvote_ratio": 0.89, "url": "https://www.reddit.com/r/Teachers/comments/14go727/i_am_permanently_traumatized_from_the_amount_of/"}, {"author": "dolfan4life2", "created_utc": 1681222546.0, "link_flair_template_id": "38a0f088-6a9a-11e8-ab9f-0e30a2dff32a", "link_flair_text": "SUCCESS!", "num_comments": 445, "post_id": "12il73h", "score": 5799, "subreddit": "teachers", "text": "\"I\\u2019m a big believer in students understanding exactly what waits for them in the real world. I also like to destroy the myth that they can just get a job and be fine. So every year my Financial Literacy students get an assignment to build a monthly budget. They have a set wage of $15/hr (our state\\u2019s minimum wage by 2025) and must provide for a long list of normal expenses including rent, car payment, insurance, food, clothes, entertainment, etc. A student came to me yesterday to tell me they\\u2019d finished and I asked them how they did. They told me they had to ask their mom for help and once they\\u2019d finished her mom called it a \\u201cdepressing assignment\\u201d. I love the parents getting a brief taste of what world their children are about to enter into. We have mostly mid to late Gen X parents and there are plenty of Teslas, Mercedes, BMW, etc cars in the drop off line, so I know a lot of these kids come from fairly middle class backgrounds. Exposing the middle class to the struggles of the lower class brings me great joy\"", "title": "A rare win! Gave my kids a budget assignment that their parent called “depressing”", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/Teachers/comments/12il73h/a_rare_win_gave_my_kids_a_budget_assignment_that/"}, {"author": "None", "created_utc": 1653474484.0, "link_flair_template_id": "4433b45a-146b-11e9-a469-0ee696cc69a0", "link_flair_text": "Policy & Politics", "num_comments": 30, "post_id": "uxecrc", "score": 5777, "subreddit": "teachers", "text": "\"I am so sick of the narrative that teachers should sacrifice their lives for their students.  That\\u2019s not what I signed up for when I went into education.  School shootings are horrific and I\\u2019m sure no one truly knows how they\\u2019ll respond until they are in this nightmare situation.  I\\u2019m so tired and want to get out of the teaching field.  My life has no value to others except to be a human shield for active shooters?\"", "title": "It’s not my job to actually die for my students", "upvote_ratio": 0.95, "url": "https://www.reddit.com/r/Teachers/comments/uxecrc/its_not_my_job_to_actually_die_for_my_students/"}, {"author": "-kidsonleashes-", "created_utc": 1599683092.0, "link_flair_template_id": "52ff1c72-db2f-11ea-946d-0eaed2f57979", "link_flair_text": "COVID-19", "num_comments": 403, "post_id": "ipod2m", "score": 5756, "subreddit": "teachers", "text": "\"THANK YOU. \\n\\nThank you SO much for making my year so far a living hell, as if teaching during a pandemic isn\\u2019t hard enough.\\n\\nThank you for turning me into the school \\u201cmask Nazi\\u201d because you refuse to enforce the rules.\\n\\nThank you for telling students that they don\\u2019t have to wear their mask correctly because it \\u201cinfringes on their rights\\u201d turning me into the bad guy.\\n\\nThank you for caring more about TANK TOP STRAPS breaking the dress code than the safety of our students and staff.\\n\\nThanks a billion,\\n\\nYour sarcastic hallway \\u201cmask Nazi\\u201d\\n\\nEdit: Thank you all for the support. It truly means a lot.\\n\\nAlso, the \\u201cmask Nazi\\u201d was not chosen, but given to me by another teacher.\"", "title": "If you are a teacher that doesn’t enforce a mandatory mask mandate...", "upvote_ratio": 0.94, "url": "https://www.reddit.com/r/Teachers/comments/ipod2m/if_you_are_a_teacher_that_doesnt_enforce_a/"}, {"author": "honeybadgergrrl", "created_utc": 1677602594.0, "link_flair_template_id": "4433b45a-146b-11e9-a469-0ee696cc69a0", "link_flair_text": "Policy & Politics", "num_comments": 731, "post_id": "11edbif", "score": 5761, "subreddit": "teachers", "text": "\"https://www.usatoday.com/story/news/nation/2023/02/28/florida-high-school-nintendo-switch-attack/11363828002/\\n\\nTHANK GOD! Also, something good out of Florida for once. \\n\\nHopefully this will send a message. I'm sick of teachers being forced to tolerate violent and dangerous students.\"", "title": "The student who attacked his para for taking his Nintendo Switch is being held on a $1million bond and charges have been upgraded to adult felony.", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/Teachers/comments/11edbif/the_student_who_attacked_his_para_for_taking_his/"}, {"author": "NearbyBox2906", "created_utc": 1693102800.0, "link_flair_template_id": "fe0a214e-146a-11e9-893d-0e90c126802c", "link_flair_text": "Teacher Support &/or Advice", "num_comments": 959, "post_id": "162dyef", "score": 5741, "subreddit": "teachers", "text": "\"I\\u2019m a lurker on here but I don\\u2019t know what to do anymore. This just happened. I don\\u2019t know what to do.\\n\\nIt\\u2019s my first year teaching at an elementary school. Second grade. \\n\\nSo basically Im female and I have a wife, 3 year old, and 6 month old twins. I love my family. And when introducing myself to students, I said that I have a wife and kids to my students. And that\\u2019s it. I didn\\u2019t know that was so wrong, because every other teacher also does it. Right? I never mentioned it again or anything. It was just part of my introduction. \\n\\nEverything was normal for a while, just teaching. Until one day a parent requested a meeting and I of course said yes. In the meeting, the mom was angry at me saying I\\u2019m trying to indoctrinate her daughter. I told her that that was not my intention at all. But she kept going and going very angry. By the end she stormed out saying she\\u2019s reporting me to the district and getting me fired. I didn\\u2019t think she\\u2019d actually do it. I was just so nervous the entire time. But she did, and a little later, the superintendent wants a meeting with me without saying what about but I had a feeling. \\n\\nIn the meeting, he was saying that I should refrain from mentioning my family. I said I never said anything about it except introducing. He was being really annoying, shutting down everything I had to say. It felt so unfair. Like I was being targeted. Basically by the end, he threatened to fire me :) So fun. \\n\\nThe following week I was being watched by an admin. My classroom being observed from the start of school to the end. And he told me to take down my picture frame of a photo of me, my wife, and our children. Which was sitting on my desk. \\n\\nThis whole week kinda sucked. I just wanted to rant. That\\u2019s all. I don\\u2019t really know what to do but I\\u2019ll just listen. I love teaching a lot. It\\u2019s always been my dream. I could be in the wrong. I don\\u2019t know. I\\u2019m just so nervous about the entire thing. Sorry for the long post\\n\\n\\nEDIT: I was going to make another post but I don\\u2019t have that much to say. So I\\u2019ll put it in here. Thank you guys for all the help. I didn\\u2019t think it would get this much. Today is Sunday and I talk with the union  on Wednesday. Also I\\u2019ve been looking for a lawyer with the help of my Mother in law because she used to work in law. And filing a discrimination lawsuit, maybe. Depending on what happens. Thank you guys for the help and I won\\u2019t take down the photo. I live in Texas but in a somewhat more liberal part. We\\u2019ve been wanting to move to California for a long while now. We got married in California but we stayed in Texas because family. But now we\\u2019re really considering it. Thank you for the help. I\\u2019ve read nearly all the comments\"", "title": "Discrimination?? For being gay", "upvote_ratio": 0.93, "url": "https://www.reddit.com/r/Teachers/comments/162dyef/discrimination_for_being_gay/"}, {"author": "Puzzleheaded-Slip191", "created_utc": 1692141100.0, "link_flair_template_id": "f8ce003c-3a32-11ed-ab6d-2298cd14c33c", "link_flair_text": "Substitute Teacher", "num_comments": 1655, "post_id": "15s8axi", "score": 5618, "subreddit": "teachers", "text": "\"I subbed today for a 7th and 8th grade teacher. I\\u2019m not exaggerating when I say at least 50% of the students were at a 2nd grade reading level. The students were to spend the class time filling out an \\u201call about me\\u201d worksheet, what\\u2019s your name,  favorite color, favorite food etc. I was asked 20 times today \\u201cwhat is this word?\\u201d. Movie. Excited. Trait. \\u201cHow do I spell race car driver?\\u201d \\n\\nHoly horrifying Batman. How are there so many parents who are ok with this? Also how have they passed 3rd, 4th, 5th, 6th grade???!!!! \\n\\nIs this normal or are these kiddos getting the shit end of the stick at a public school in a low income neighborhood?\"", "title": "Kids don’t know how to read??", "upvote_ratio": 0.96, "url": "https://www.reddit.com/r/Teachers/comments/15s8axi/kids_dont_know_how_to_read/"}]